{
  "date": "22 Jul", 
  "text": "Certain selected areas island wide will experience two hour power cuts from today, due to a sudden breakdown at the Kerawalapitiya West Coast thermal power plant and the Lakwijaya power plant in Puttlam. The CEB is facing a power crisis as they are deprived of 400 MW of power, due to the breakdown, and with the lack of rains and dwindling hydro power capacity imposing this power cut is the only available measure, according to the CEB.\nHowever the Chairman of the CEB Wimaladharma Abeywickrema stated that all measures will be taken to restore the operations of these two power stations and rectify the current crisis. With the breakdown at the Lakwijaya coal power plant 300 MW has been deprived, while another 100 MW is deprived due to the breakdown at the Kerawalapitiya thermal power plant.\nDue to the consecutive failure in the monsoon rains that feed the reservoirs the country is forced to depend on thermal power to meet the countrys power requirement. Although the water levels in the reservoirs should be at 35% capacity, today due to the lack of rains it has reduced to 15%. The cost per unit of electricity when generated through thermal power increases ten folds in comparison to power generation through hydro power. Therefore the power network was controlled mainly by the Lakwijaya and Kerawalapitiya west coast power stations.\nOn 02 July the west coast power stations operations stalled due to a technical problem, depriving the power sector of 270 MW. However subsequent to some repairs being carried out on 12 July 170 MW was added to the national grid.\nMeanwhile due to a technical breakdown at the Lakwijaya coal power plant in Puttlam last morning, the authorities were forced to halt operations at the plant. This power station has been in operation round the clock over the past seven months. Currently three teams have been deployed to carry out the repairs needed in order to commence operations of these power stations.\nHowever the CEB states that under the prevailing situation it is difficult to maintain the proper balance in the network. Therefore it is essential to impose power cuts of at least two hours to selected areas island wide, or until there is enough rainfall to increase the hydro power capacity to around 25% to 30%.\nThe CEB chairman added that the areas that will be experiencing these power cuts will be announced today.\n", 
  "title": "Power cuts due to breakdown in Kerawalapitiya and Puttlam power stations", 
  "url": "http://powermin.gov.lk/english/?p=1320"
}