{
  "date": "28 Jul", 
  "text": "Minister of power and energy Patali Champika Ranawaka slammed the Indian media accusing them of trying to create tension between India and Pakistan and create issues in the region. He said that the Indian media had reported that Sri Lanka plans to build a nuclear power station with Pakistani aid in the Sampoor area, which is a totally fabricated story.\nAddressing a press briefing in Colombo yesterday at the ministry auditorium he said that there have been reports in the Indian media that Sri Lanka intends to build a nuclear power station in the Sampoor area with assistance from Pakistan. The Indian government had inquired from the Indian high commissioner in Sri Lanka regarding this report and the minister said that a report had also been furnished to the Indian government. However minister Ranawaka said that neither he nor the Sri Lankan government was aware of the report that had been sent to the Indian government.\nHe added that the only development project currently in progress is the 500 MW Sampoor Coal power plant that is being built jointly by the CEB and National Thermal Power Corporation of India.\nTherefore the minister accused the Indian media of reporting total lies regarding a joint venture between Sri Lanka and Pakistan to build a nuclear power plant.\nMinister Ranawaka further added that Sri Lanka did not require the approval of any country to commence development projects in the power and energy field. He said that his ministry had planned short and long term development projects, adding that in keeping with the development activities in Colombo, Hambantota, Kalpitiya, and Trincomalee areas the power and energy sector too will implement projects in keeping with the development goals.\nThe minister added that he believed that the Indian media had fabricated this false news report, as the Pakistani foreign minister was to visit Sri Lanka shortly. He said that by publishing these false stories it was probably intended to create some stress between India and Pakistan and create a tense situation in the region. He also said that this is not the first instance that the Indian media have resorted to this type of unethical reporting.\n", 
  "title": "Minister Ranawaka accuses Indian media of attempting to create tension in the region", 
  "url": "http://powermin.gov.lk/english/?p=1326"
}