{
  "date": "09 Aug", 
  "text": "In keeping with the drive of replacing 20% of the power requirement through alternative green energy sources by 2020, the ministry of power and energy will add 30MW of power to the national grid, generated through wind power.\nThe capacity will be generated through three wind power stations and will be added to the national grid at the auspicious time of 10.30 am on Thursday (09), under the patronage of the minister of power and energy Patali Champika Ranawaka.\nThe three wind power plants will look to add 90 GWh of electricity per year, 1 percent of Sri Lankas power output to the national power grid. The target of the ministry is to increase the renewable energy capacity to 15% by 2015, and a further increase to 20% by the year 2020. The minister also emphasized that the key feature of this project is that it commenced on local funding of Rs. 7200 million, while technical expertise is solely by local engineers. All the wind power turbines used in this project are of the highest standard in modern technology.\nOne of the wind power stations is located in Daluwa, Nirmalapura, while the wind turbines are located along a 03 km extent of coastal land. The investment for this project by the Nirmalapura wind power (Pvt) company is Rs. 2400 million.\nThe second wind power station is located in close proximity to the Lakwijaya coal power station in Putlam, while Daily life Renewable (pvt) company has invested Rs. 2400 million for the project. So far eight wind turbines have been constructed, while these are the largest in physical dimensions in the country. They are 85 meters in height and 82 m in diameter.\nThe 10 mw third wind power station is built at Sethapola bordering the lagoon. Power Gen Lanka had invested Rs. 2400 million for this project as well while it consists of seven 65m tall wind turbines. These turbines are located along a three kilometer stretch of land bordering the lagoon.\n", 
  "title": "30 MW of wind power to be added onto national grid", 
  "url": "http://powermin.gov.lk/english/?p=1334"
}