{
  "date": "24 Aug", 
  "text": "The Atomic Energy Authority, Sri Lanka has organized an international coordination meeting on Improving Soil Fertility, Land Productivity and Land Degradation Mitigation with the member states of Asia Pacific region from 27-31 August at the Hotel Galadari.The participating member states will be Australia, Bangladesh,China,India,Indonesia, Malaysia, Myanmar, New Zealand, Pakistan, Philippines, Republic of Korea,Sri Lanka,Thailand and Vietnam. Theobjective of the meeting will be to assist Member States in the development and effective implementation of area-wide conservation to control the impact of land-use practices on land degradation through enhancing capacities in nuclear and isotopic techniques. The regional approaches will be discussed and the knowledge and theprocedureswill be shared.\nThe project will be implemented in Sri Lanka to assess soil erosion in major agricultural lands in central highlands of Sri Lanka using nuclear techniques. In Sri Lanka, soil erosion and declining soil fertility have been the major land degradation issues in central highlands particularly in lands exposed for human use. In order to control soil erosion and ensure sustainable use of lands, a conservation area has been declared under the provision available in the Soil Conservation Act, No 25 of 1951. The area was expanded in 2007 covering the entire central highlands. However , information is scare on present status of soil erosion in major agricultural land uses in order to select priority lands for implementation of a soil conservation programmes.So the main objective of the regional project is to establish national database on soil erosion using nuclear techniques in different land use patterns in order to implement and enforcement of National Soil Conservation Act to prevent and mitigation of land degradation due to soil erosion in major agricultural land uses in central highlands of Sri Lanka and Selected coconut growing soils. Atomic Energy Authority is the national coordination institute of this project and Natural Resources Management Centre under the Department of Agriculture and the Coconut Research Institute are the other collaborative institutes.\n", 
  "title": "International Seminar on Management of Agricultural Soil", 
  "url": "http://powermin.gov.lk/english/?p=1336"
}