{
  "date": "27 Aug", 
  "text": "Two electrification projects declared open on 26 and 27 August\nMinister of Power and Energy Patali Champika Ranawaka during his inspection tour of the North Central Province declared open five electrification projects on 26 August in the district benefitting 265 families.\nThe total cost of the project is Rs. 37.76 million. The government has spent a further Rs. 6.26 million for electrification projects in the Katupuliuyankulama Palukumbura areas in the Anuradhapura district, for the benefit of 45 families.\nAnother electrification project was inaugurated in the Pandukabhayapura section 13, on 26 August, at a cost of Rs. 9.49 million for the benefit of 50 families in that area.\nThe Rambewa Oyegama electrification project built at a cost of Rs. 2.23 million will provide electricity to 25 families. The Medavachchiya Kudawalpola electrification project built at a cost of 5.56 million will provide electricity connections to 35 families in the area. Meanwhile the Anuradhapura Oyamaduwa Kimbulewa residents too received electricity connections on the same day. This project was completed at a cost of Rs. 14.18 million.\nThe minister during his tour also inaugurated the Krishnapuram and Pungkudathiv electrification projects, with an investment of Rs. 46.83 million, which will provide electricity to 770 families in the area.\nIn 2010 only 10% of the people in the area had obtained electricity connections. However in 2011 it had increased to 19%. This year so fat however the level of electrification in the Killinochchi district had reached 35%. Meanwhile over another 50 electrification projects are scheduled to be completed by the end of this year.\nAddressing the electricity consumers of Killinochchi and Anuradhapura minister Ranawaka requested them to use electricity sparingly. He added that due to the prevailing drought and the failure of the last two consecutive monsoon rains, the power sector had faced severedifficulties. Therefore he appealed to the 4.7 million power consumers to take into consideration the current situation and use electricity in aconsiderate\n", 
  "title": "1035 families in Killinochchi and Anuradhapura receive electricity connections.", 
  "url": "http://powermin.gov.lk/english/?p=1615"
}