{
  "date": "14 Sep", 
  "text": "This is the beginning of the second decade of the third millennium. At present 50% of power generation capacity and 40% of annual electricity generation in Sri Lanka comes from hydro power. The balance is generated from oil fired thermal power plants. The generation cost of a unit of electricity from Laksapana hydro complex is Rs. 0.90 and from Mahawali hydro complex is Rs. 2.30. On the other hand the average unit cost of oil fired thermal power plants is about Rs. 20. If we were to generate electricity from imported fossil fuels then the electricity consumers in Sri Lanka have to pay additional Rs. 7.50 for each a unit of electricity consumed. If so electricity would become a prohibitively expensive service for over 75% of the people living in Sri Lanka.\nElectricity is a basic need of the modern day human. The Government of Sri Lanka is in a position to satisfy this basic need at an affordable price mainly due to 40 years untiring effort of a person who lived during the first half of 20th century. This person is none other than Mr. D. J. Wimalasurendra, who is the father of hydro power in Sri Lanka.\nHe started by demonstrating the technical option that he believed in. He initiated the first mini hydro power plant in Sri Lanka in 1912 at Black Pool, utilizing the excess water from the Gregory Lake, Nuwara Eliya. In 1918, Wimalasurendra delivered a key note address to the Engineering Association of Ceylon, entitled On the Economics of Power Utilization in Ceylon. In this key note address he highlighted that the harnessing of the Mahaweli River, Kehelgamu Oya and Maskeli Oya for hydropower development would inaugurate an industrial era for this country.\nWimalasurendras colleagues among the engineering community were dubious about these projects and laughed at him. His supervisors smiled at his ideas. Others disrespected him for what they called his Journeys into the realms of fantasy. One European boss of his department transferred him to a remote area where he would have no access to scientific literature, data and statistics that inspired his dream.\nDespite negative campaigns, work on the Aberdeen-Laxapana scheme commenced in 1924, but was then suspended in 1927 due to unforeseen circumstances. The power house was constructed in 1938 and the work officially resumed on February 18\nBy the 1950s when the project was nearing completion, Wimalasurendra was a retired electrical engineer in his mid 70s. However, he was determined to see for himself the progress of the scheme he initiated. Visiting the project site, Wimalasurendra boarded a trolley moving on tracks laid through the tunnel that was been constructed for channelling water from the Kehelgamu Oya to Lakshapana. As the trolley carrying him emerged from the other end of the tunnel, there was a loud cheering and applause from the crowd waiting there to greet him. Addressing those present the veteran engineer said that although he was not so fortunate as to supervise the completion of the project, he was glad to witness others completing the work he had begun, thus realizing the dream he had half-century ago.\nSixty years passed by. During this period successive Sri Lankan governments tapped almost all the hydro potential in Sri Lanka. The present government is currently implementing an aggressive program for tapping the remaining hydro potential. The country has not exceeded 85% electrification rate. The modern-day Wimalasurendras were promoting renewable and indigenous energy based electricity during the last two decades for meeting the increasing demand. Meanwhile, the power sector pundits were advocating establishing imported fossil fuel based power plants during the last two decades. This is a similar situation that existed during Wimalasurendras era. As a result the imported fossil fuel based power generation increased from 5% in 1995 to 60% by 2010, burdening the electricity consumers in Sri Lanka.\nWe reprint this publication on Mr. D. J. Wimalasurendra on his 136\n", 
  "title": "Commemorating D. J. Wimalasurendra  Father of hydro power", 
  "url": "http://powermin.gov.lk/english/?p=1934"
}