{
  "date": "21 Sep", 
  "text": " Addressing the 54th General Conference of the International Atomic Energy Agency (IAEA) that is being held in Vienna, Minister of Power and Energy Patali Champika Ranawaka said Sri Lanka has moved towards incorporating nuclear power to country s energy mix and the Atomic Energy Authority of SL has moved to enhance human resource development in the field of nuclear energy.\nIn meeting these development priorities and plans, Sri Lanka has therefore taken a decision to look into incorporating Nuclear Power into its energy mix. Recently, the Government of Sri Lanka has approved the Atomic Energy Authority of Sri Lanka to conduct a pre-feasibility study of using nuclear energy as a viable option beyond 2020 for power generation with the technical cooperation of the Agency Minister Ranawaka said.\nFurther, a program to enhance human resource development in the field nuclear energy has already been initiated in collaboration with Engineering Universities of Sri Lanka he added. Commenting on the IAEA s commitment towards combating cancer Minister Ranawaka thanked the Government of India for its donation of the Bhabhatron II  a Cobalt-60 Teletheraphy Machine to Sri Lanka through IAEA s Programme of Action for Cancer Therapy (PACT ).\nPresident Mahinda Rajapaksa brought Atomic Energy Authority, which was earlier under Ministry of Science of Technology, under Ministry of Power and Energy when he appointed Minister Ranawaka as subject minister.\nGeneral and complete disarmament has been a declared objective of the United Nations and the international community for several decades, though it has remained elusive. Sri Lanka believes that the Nuclear non-proliferation Treaty (NPT) is the cornerstone of the nuclear non-proliferation regime and the essential foundation for the pursuit of nuclear disarmament and for the peaceful uses of nuclear energy. Nuclear disarmament and nuclear non-proliferation are interlinked and cannot be pursued independently and in isolation. We also recognise that obligations and commitments under taken by countries should not jeopardize their sovereign and inalienable right to develop research, produce and use nuclear energy for peaceful purposes.\nSri Lanka is glad to note that the NPT 2010 Review Conference has recommended notable actions and practical measures in dealing with Nuclear non Proliferation and peaceful use of Nuclear Energy. We call on the Agency and Member States to work together in giving effect to the actions recommended in the Review Conference.\nSri Lanka attaches great importance to the mandate and functions entrusted to the IAEA in enhancing the peaceful use and application of nuclear energy and technology for Member States. IAEA s mandate and over five decades of vast expertise acquired in the area of nuclear energy for peaceful purposes place the Agency in a vital and indispensable position. We are confident that the Agency would continue to maintain its independence, balance and impartiality in fulfilling its mandate. In successfully carrying out its tasks, the Agency also needs the support of Member States. Sri Lanka is firmly of the view that all avenues of diplomacy and dialogue should be employed to deal with the contentious issues confronting the Agency.\nMy delegation has read with interest the Annual Report of the Agency for 2009. The world continues to face growing challenges of climate change and declining sources of fossil fuels. As we focus on forms of renewable energy and sustainable development, it is evident that there is renewed interest in nuclear energy to meet demands of national development and power generation.\nThe Mahinda Chinthana  Vision for the Future program initiated by His Excellency Mahinda Rajapaksa, the President of Sri Lanka has identified five hubs for development activities and, Energy is defined as one of the hubs. Under this rapid development plan, I wish to state that we have formulated and introduced a 15 fold strategy called Power Lanka based on the concept of triple E s visualizing Economy, Energy and Efficiency. As a stepping stone to this strategy we are now in the process of reviewing and revisiting our Energy Policy.\nThe Government of Sri Lanka has commenced developing national infrastructure for enhanced productivity. The year 2010 marks the opening of the new Hambantota port in the south of Sri Lanka. Development of a second International Airport, bunkering facilities and other large infrastructure projects are underway.\nWe are now witnessing a great leap forward and have experienced an energy demand of 8% for the past six months and in the second quarter of the year, we have had growth rates of 8.5%. In order to meet our energy demands in the future, we need to feed our base load, as well as increase our spinning reserves to absorb non-conventional renewable energy sources such as wind, solar and mini-hydro. In meeting these development priorities and plans, Sri Lanka has therefore taken a decision to look into incorporating Nuclear Power into its energy mix. Recently, the Government of Sri Lanka has approved the Atomic Energy Authority of Sri Lanka to conduct a pre-feasibility study of using nuclear energy as a viable option beyond 2020 for power generation with the technical cooperation of the Agency. Further, a program to enhance human resource development in the field nuclear energy has already been initiated in collaboration with Engineering Universities of Sri Lanka.\nThe Atomic Energy Authority Act. No. 19 is being upgraded and drafted to meet the present and future requirements in the field of nuclear power generation, nuclear terrorism, environmental protection and nuclear safety and security. The draft act is being forwarded to the Agency with a view to finalize the Act within this year, to be approved by the Parliament of Sri Lanka.\nTerrorism remains a great threat to countries. As a country that had to face the scourge of terrorism for nearly thirty years, I am pleased to announce that Sri Lanka has been able to overcome this threat. As we look to the future with renewed hope and enthusiasm, the Government of Sri Lanka is proceeding to embark on a new era of economic development.\nSri Lanka fully supports global measures to combat terrorism and has joined multilateral efforts by becoming signatory to a number of International Conventions, including the International Convention for the Suppression of Acts of Nuclear Terrorism. The global threat posed from nuclear weapons and material falling into the hands of terrorists groups and extremist elements is very real. Therefore, physical protection of nuclear material is very essential.\nSri Lanka has become a partner of the Global Initiative to combat Nuclear Terrorism and has joined the megaport initiative, to improve safety and security of radioactive sources and monitor international movement of nuclear materials through our national ports. It has also provided security upgrades to places such as radiotherapy facilities and gamma irradiation centers under the Global Threat Reduction Initiative. We are now in the process of finalizing an agreement with the Government of the United States to facilitate the technical assistance necessary for our country in the disposition of radioactive waste in our country. In June of last year, Sri Lanka hosted a South Asia Workshop on the Implementation of UN Security Council Resolution 1540 dealing with Non-State Actors and Weapons of Mass Destruction (WMD).\nThe application of nuclear science and technology for development related purposes is an important pillar of the Agency s activities and mandate. Therefore, we attach great importance to the technical assistance provided by the IAEA to developing countries and believe that these activities be strengthened further. It is for this reason that sufficient, adequate and predictable resources for the Technical Cooperation Fund should be allocated for this purpose. At the same time, the delivery of Technical Cooperation should take the needs of recipient countries into consideration to enhance the impact of such assistance.\nSri Lanka has greatly benefited from the Technical cooperation programme of the Agency in areas such as human health, agriculture, industry, and nutrition and radiation protection. Last year Sri Lanka signed its Country Programme Framework (CPF) for 2009-2013 in December 2009, for which it is envisaged IAEA cooperation for energy planning, nuclear medicine, industrial applications, control of vector borne infectious diseases and capacity building of the national nuclear research institutes.\nSri Lanka, with the support of the Department of Technical Cooperation, has strengthening our radiological emergency preparedness planning. It is currently setting up a few sites to detect background radiation and activate a radiological warning system through the country s National Disaster Management Centre (NDMC). In this regard, the NDMC has planned national training programmes with the collaboration of the Agency in the field of radiological emergencies and similar situations.\nSri Lanka has received technical cooperation assistance on nuclear imaging for the last two decades. Four nuclear imaging centres in the government health sector have been provided with equipment and expert services with a recommended source for supply of radioisotopes. However, we note that in present circumstance the supply of Tc-99m isotope is not always reliable. As we are aware of the importance that nuclear imaging plays in the early detection of cancer, especially for developing countries, we hope that this matter may be resolved.\nSri Lanka appreciates the contribution made by the Agency for the establishment of the Bio Dosimetry Laboratory and we are pleased to note that Atomic Energy Authority of Sri Lanka is now in a position to offer bio-dosimetry services to concerned individuals on request. The advanced nuclear analytical services such as Total X-ray Fluorescence (TXRF), upgrading of human resources and capabilities in the field of nuclear analytical methods has helped improve investigations on causes for Chronic Kidney Disease, a major health concern in the north central and eastern provinces of Sri Lanka.\nThe Agency s Programme of Action for Cancer Therapy (PACT) serves as a clear demonstration of the peaceful use of the atom. We are appreciative that Sri Lanka has been one of the six PACT Model Demonstration sites (PMDS). We hope that the success of these PMDS will help provide models for comprehensive cancer care in the developing world today.\nIn this respect, we also thank the Government of India for their donation of the Bhabhatron II  a Cobalt-60 Teletheraphy Machine to Sri Lanka through the PACT programme, that will be installed at the General Hospital in Hambantota, where there is an urgent need.\nSri Lanka views the Regional Cooperative Agreement for the Asia and the Pacific as an instrument through which participating countries have reaped considerable benefits. In a follow up programmes introduced by the RCA, Sri Lanka has recognized the importance of Non Destructive Testing Techniques for the enhancement safety and productivity in Industry. The Department of National Planning of Sri Lanka has recommended the establishment of the National Centre for Non Destructive testing (NCNDT). The proposed NCNDT will perform such work on an enhanced scale.\nIn conclusion, Mr. President, I wish to thank the Secretariat of the Agency for the arrangements made for this session of the General Conference, as well as for their excellent cooperation with Sri Lanka in all aspects of the Agency s work. My delegation assures, through you the Director General and his staff of the fullest cooperation of Sri Lanka in its efforts to achieve peace, development, safety and security through the effective utilization of the peaceful uses of nuclear science and technology.\nMedia Unit-Ministry of Power & Energy 2010-09-21\n", 
  "title": "Nuclear Energy for Sri Lanka.", 
  "url": "http://powermin.gov.lk/english/?p=1949"
}