{
  "date": "18 May", 
  "text": "Those who were against constructing power stations in the past are now accusing the government of raising the power bills.\nHowever I challenge anyone to point out a single country in the Asian region that provides electricity round the clock as we do, and with lesser rates.\nLECO and the CEB are very important companies in this country that provides a valuable service to the people. It is the responsibility of these establishments to provide a quality and efficient service to the people. Minister of power and energy Patali Champika Ranawaka said that it is with the intention of providing this efficient service that LECo launched its SMS service for the convenience of the consumers.\nThrough this sms service consumers will be informed of sudden breakdowns, bill payments etc, while consumers can also inquire about their bills, sudden breakdowns, electricity connections and disconnections and all other requirements pertaining to their electricity bills and connections.\nTo register for this service type reg<space><account number>and send to 071-4643643. To download android software log onto \nAddressing the gathering at the Kukuleganga holiday resort minister Ranawaka said that certain elements accuse the government of high power bills. However I challenge them to point out any country in the Asian region that has lower bills, and a better electricity service. Even with depleting water levels at the reservoirs that generate hydro power, we still provide electricity to the consumers round the clock. While other countries in the region are imposing power cuts and even closing industries for days, we still are the only country that provides uninterrupted electricity irrespective of the issues we have to face. In Chennai they impose a daily power cut of two hours, while in rural areas power cuts are experienced for between 08  12 hours, while industries have to close for two days a week. He said that in comparison industrialists and domestic consumers in Sri Lanka enjoy electricity round the clock.\nIn about another 40 years that is by 2052 the oil reserves would have depleted, in another 60 years gas, coal reserves will be depleted in another 80 years. Taking these facts into consideration the future generations will have to face a grave power crisis. However if we all assist in conserving power during the peak hours between 06.30 and 09.30 pm daily, we can face these future challenges very effectively, said the minister.\nThe minister further added that people come to LECO and CEB offices in order to obtain solutions for their power related issues. Therefore it is our duty to listen to their problems and provide speedy solutions. We must always uphold the trust and faith the consumers have in us. Providing electricity is a noble and meritorious deed similar to granting eyesight to a visually impaired person.\nThe Chairman of LECO Chandana Hapuarachchi, several politicians and many employees also participated in this SMS service launch.\n", 
  "title": "LECO commences SMS service for the convenience of Consumers", 
  "url": "http://powermin.gov.lk/english/?p=2027"
}