{
  "date": "09 May", 
  "text": "President Mahinda Rajapakse will embark on an inspection tour today at 10.30 am, accompanied by the Japanese state deputy prime minister Katsuya Okada, the Ambassador Nobihitho Hobo, the minister of Power and Energy Patali Champika Ranawaka and the his deputy Premalal Jayasekera.\nWith the aim of meeting the ever increasing power requirement of this country the upper kothmale hydro power project was inaugurated on 03.03.2006. Located in the central hills, its 180 m long and 355 mt high dam was built across the Kothmala Oya, which is a main tributary of the Mahaweli river. The anticipated output of this hydro power project with minimum environmental damage is expected to be 150 MW. It has the capacity to generate 409 GW hours of power annually. The Upper Kothmale hydro power scheme consists of the largest tunnel ever built in Sri Lanka measuring 12.9 KM in length and 5.2 MT in breadth.\nThe underground power station currently under construction in the Niyam Gam Dora area consists of switch board panel which is 37 meters in width and 130 meters long. This facility is 66M long, 19 M wide and 36 M in height, while the transmission network has a capacity of 220kilo volts.\nThe initial civil operations of this project under phase 1 is 97% complete. While the the Fixing of the Hydro machinery is 100% complete. The electricity generation equipment installation process is 100% completed according to the Upper Kothmale Hydro Power Project office.\nThe Japanese Government has provided a concessionary loan of Rs. 37,817 Million under its foreign development assistance through the Japan cooperation bank, while the Ceylon Electricity Board has contributed Rs. 8548 Million for this project.\nMeanwhile 495 houses have been constructed for the families displaced by the project. In keeping with the policy of the Upper Kothmale Project, all families displaced by this project were awarded houses greater in value to the ones they had lost, while all infrastructure facilities such as water, electricity, transport facilities ect. were also provided, and they were given full ownership to the houses as well.\nFurthermore a bridge was also constructed across the Thalawakale Kothmala oya of 80 M at a cost of Rs. 77 million further enhancing the transportation facilities, under the guidance of the minister.\nThe Kothmale Hydro Power project comprises of 02 generators with a capacity of 75 MW each. The power generation of the first generator commenced its trial test run toward the end of January this year, while its total capacity of 75 MW was connected to the National grid on 28 March. The other 75 MW from the second generator is expected to be added to the National Grid by the second week of June.\nThe CEB employees attached to this project have successfully achieving the goal of expeditiously completing the responsibility placed on them by the minister of power and energy, on time\n", 
  "title": "Work on the Upper Kothmale Hydro Power project has neared 96% completion.", 
  "url": "http://powermin.gov.lk/english/?p=2053"
}