{
  "date": "18 Apr", 
  "text": "In raids conducted by the CEB during the month of March Rs. 21,351,084.47has been raked in as fines. This sum is made up of Rs. 3,917,729.00 as courtfines and Rs. 17,433,355.47 recovered as losses incurred by the CEB due to theillegal tapping of electricity.\nThe CEB has detected 237 cases of power piracy by adjustingthe meters fraudulently, while 108 cases of power tapping had been reported byusing hooks, making up a total of 345 cases of illegal power tapping.\nMeanwhile from the beginning of the year the CEB flyingsquad has nabbed 331 power pirates, and recovered a sum of Rs. 21.5 million infines.\nIn comparison to the number of illegal power tappingreported in the month of January there is a considerable decrease during themonth of February. However during the festive season and the increase in powerconsumption, there is an increase in the number of power piracy incidentsreported.\nThe ministry of power and energy further stated that withthe approach of the Vesak festival, there could be a development in the numberof power piracy incidents. However the ministry stated that they will be takingstrict measures against those who engage in obtaining power through illegalmeans.\nThe ministry of power and energy further stated that theyare burdened with huge financial losses due to these illegal power users, andrequested the public to assist them in nabbing those who obtain power throughillegal means, by calling the hotline 2422259 and reporting such incidents tothe raids team.\nIn raids conducted by the CEB during the month of March Rs. 21,351,084.47has been raked in as fines. This sum is made up of Rs. 3,917,729.00 as courtfines and Rs. 17,433,355.47 recovered as losses incurred by the CEB due to theillegal tapping of electricity.\nThe CEB has detected 237 cases of power piracy by adjustingthe meters fraudulently, while 108 cases of power tapping had been reported byusing hooks, making up a total of 345 cases of illegal power tapping.\nIn comparison to the number of illegal power tappingreported in the month of January there is a considerable decrease during themonth of February. However during the festive season and the increase in powerconsumption, there is an increase in the number of power piracy incidentsreported.\nThe ministry of power and energy further stated that withthe approach of the Vesak festival, there could be a development in the numberof power piracy incidents. However the ministry stated that they will be takingstrict measures against those who engage in obtaining power through illegalmeans. The ministry of power and energy further stated that theyare burdened with huge financial losses due to these illegal power users, andrequested the public to assist them in nabbing those who obtain power throughillegal means, by calling the hotline 2422259 and reporting such incidents tothe raids team.\n", 
  "title": "The CEB has detected 237 cases of power piracy", 
  "url": "http://powermin.gov.lk/english/?p=2074"
}