{
  "date": "27 Feb", 
  "text": "The South Korean government has pledged their fullest cooperation for the development of the countrys power sector.\nDuring minister of Power and Energy Patali Champika Ranawakas Korean tour from 11 to 17, he met the Knowledge minister of that country\nFeok ChoHe also held several rounds of discussions with private and government sector representatives in the power and energy field. The Korean government has also pledged their support for the development of the countrys transmission and power generation facilities.\nThe primary intention of this tour was to obtain the worlds best water management technology Pump Water Storage to Sri Lanka, said minister Ranawaka. He further stated that measures will be taken to further enhance the current capacity of 1200 MW.\nThe minister further stated that nine sites in the country have been identified as viable locations for the implementation of the new Pump Water Storage technology. Through the implementation of the new technology the anticipated power generation could be further enhanced to 3500 MW, added the minister.\nFor the implementation of the new Pump Water Storage technology two reservoirs on two elevations are required. During the peak hours the water from the upper reservoir will be used to generate power while, during the off peak hours water will be pumped from the lower reservoir to the upper one. By the implementation of the new technology, water that is used for the generation of power can be re used over and over again.\nThe minister further added that through the implementation of this system, renewable energy sources such as wind and solar power could be added efficiently to the national grid. He also said that instead of the high cost thermal power generation during the peak hours of between 06.30 and 09.30 pm, hydro power can be used once the new technology is implemented. Coal can be used for power generation during off peak hours, while the use of oil for thermal power generation could be minimized drastically, which could reduce the cost of power generation.\nThe minister also said that for a country like Sri Lanka the use of hydro power will be economically viable, and also thanked the Korean Ambassador to Sri Lanka Choi Jong Moon for the assistance rendered by his government.\n", 
  "title": "Korea agrees to provide assistance to enhance Sri Lankas Hydro Power generation", 
  "url": "http://powermin.gov.lk/english/?p=2105"
}