{
  "date": "13 Jan", 
  "text": "According to a decision taken by the Minister of Power and Energy Patali Champika Ranawaka to conduct all activities of the Power and Energy ministry and all its affiliated companies in a transparent manner, The total Income and Expenditure of LECO was presented to the public at a press conference held this afternoon (2011.01.12) at the Power and Energy Ministry auditorium.\nLanka Electric Company which was established in 1983, currently operates in the Western Province and the southern coastal belt. Through Maintaining the supply of Electricity, upliftment, supply, development, extension, generating and selling of electricity for the welfare of the people, have in comparison with last year have shown a marked improvement in income and expenditure.\nWith the intention of providing the people with the best energy solutions through uninterrupted improvements, LECO which recorded an income of around Rs. 14 billion last year, anticipates a figure of around Rs. 18.5 Billion this year. Last year Rs. 12 million was spent on purchasing power. With the intention of improving their service to the consumer plans have been implemented to increase that figure to Rs. 15 million this year. Through this LECO anticipates a profit of Rs. 796 million this year, against the profit of Rs. 264 million (before tax) recorded last year.\nLeco which lays claim to a prudent history of 25 years, can be identified as a company that provides the same quality service as the Ceylon Electricity Board. Furthermore LECO is committed to serve the people through being Environmentally friendly, satisfying the customer through innovative services, dedication and providing the best service through a talented and contented workforce .\nLanka Electric company which provided their services to 392,782 consumers in 2004, have been efficient enough to improve that figure to 473,813 this year. Although LECO is reaping the benefits of providing the consumers a better, trusted service, through its favourable infra structure, they are committed to developing constant quality development programs. In addition to these consumer oriented programs, plans are currently under way for the progressive development of more efficient street lighting.\nUnder the farsighted leadership of the Minister of Power and Energy Patali Champika Ranawaka, Leco pointed out that it their sole intention to provide the consumer with a more efficient and quality service, at an affordable price.\n", 
  "title": "LECO Income & Expenditure Presented to public Plans to uplift Customer service standards.", 
  "url": "http://powermin.gov.lk/english/?p=2163"
}