{
  "date": "03 Jan", 
  "text": "Sri Lanka Sustainable Energy Authority (SLSEA) plans to launch Energy Management Systems in bulk energy consuming establishments. Therefore, they hope to introduce SLS ISO 50001 to Sri Lanka in collaboration with Sri Lanka Standards Institution (SLSI) and the Renewable Energy Authority.\nThe implementation of Energy Management Systems SLS ISO 50001 will be established in institutions for a resolute energy conservation mechanism to be implemented. This measure will be carried out through managers appointed for the designated energy consumers from which bulk energy consuming organizations will be the designated consumers in the initial phase.\nTechnically qualified personnel who can provide consultancy to establishments to carry out the implementation of Energy Management Systems will be certified as energy auditors and will help to regulate the energy consumption of Sri Lanka.\nAddressing the gathering at this event minister of Power and Energy Patali Champika Ranawaka said tha in the first phase implementation of this initiative where it is implemented in about 1500 factories, around 240 GW hours of energy is conserved, resulting in a commercial profit of Rs. 10 billion.\nFor the daily requirement of 2000 MW, the CEB has managed to maintain an electricity generation of 2980 MV despite of the difficulties faced with Hydro power generation. Despite countries like India, Bangladesh, Pakistan, Nepal and Bhutan curtailing power for around 08-16 hours per day, Sri Lanka has been able to provide the people a steady and uninterrupted electricity supply said the minister.\nAmong the dignitaries who attended the event today (13) at the BMICH were the Chairman of the Renewable Energy Authority Dr. Kithsiri Dissanayaka, Chairman of the Standards Institution and many senior officials.\n", 
  "title": "Ministry of Power and Energy to launch Energy Management Systems in bulk energy consuming establishments.", 
  "url": "http://powermin.gov.lk/english/?p=2200"
}