{
  "date": "10 Nov", 
  "text": "The Upper Kothmale project which commenced construction in 2006 to cater to the ever increasing electricity demand in the country, has now completed 91% of its total construction.\nThis electricity project which is expected to complete construction by the end of 2011under 5 stages is expected to add a capacity of 150 MW to the National Grid. The initial civil operations of this project under phase 1 is 94% complete. While the civil operations of the second stage is 91% complete, the third stage of this project which is the Fixing of the Hydro machinery is 99% complete. While the stage 4 of the project, which is the electricity generation equipment installation process is 86% completed, while the final 5th stage of transmission line construction is 84% complete according to the Upper Kothmale Hydro Power Project office.\nThe Project office further stated that the efforts for preserving the rain water for longer periods of time within the reservoir, and maintaining minimal quantities of sediment from reaching the rivers and maintaining the life span of the reservoirs at maximum level, the water management project which commenced in 2007 has proven to be a total success.\nAs assistance for this project bamboo and eucalyptus saplings were provided free of charge by the Mahaweli Authority. Recently a survey was conducted in the area of 310 KM which covers the catchment area of the upper kothmale project, while these saplings were planted in this area with the aim of increasing the forest cover.\nThe activities taking place in the upper kothmale power project these days are the inspection of the sluice gates, construction of the side bund, assembling of the parts of the turbine, and the fixing of the transmission cables of the high voltage 220KW network.\nThe Japanese Government has provided a concessionary loan of Rs. 37,817 Million under its foreign development assistance through the Japan cooperation bank, while the Ceylon Electricity Board has contributed Rs. 8548 Million for this project.\nIt is expected that through this project 150 MW of power will be added to the National Grid while this is the last largest hydro power project to be constructed in this country. It is expected to generate 409 million units annually enabling the country to meet its power requirements without hindrance\n", 
  "title": "Upper Kothmale Hidro Power station water preservation project successful", 
  "url": "http://powermin.gov.lk/english/?p=2272"
}