{
  "date": "10 Nov", 
  "text": "Addressing the MBA Alumni Association- University of Colombo Evening Forum on Renewable Energy- The Future at the Sapphire Ball Room, Ceylon Continental Hotel on the 25th of October as the key note speaker, Minister of Power and Energy Patali Champika Ranawaka said that with fossil fuel resources fast depleting and the future of nuclear power uncertain subsequent to the disaster in Japan in the recent past, it is most appropriate to focus our attention on renewable energy sources.\nAs Sri Lanka has no abundant supply of oil deposits and currently depend heavily on the import of oil bearing high costs, which in turn is a major burden on our economy, focusing on renewable energy sources would be a wise investment for the future said Minister Ranawaka. He further emphasized the uncertainly of crude oil supply due to the volatile situation in the oil producing regions.\nCrude oil and natural gas are concentrated in few geographical regions of the world he said adding that the top 15 producer countries account for 90% of production. However in the case of coal, the situation could be termed as less dramatic, since the geographical spread of the resource is not as concentrated as in the case of oil and natural gas said the Minister.\nIt is high time now we should advocate and invite decisive and urgent action to change the focus of energy supply industry from fossil fuels to renewable energy he said. Adding that However, proven coal reserves are also concentrated in a few producer countries, where the top 10 producer countries accounting for more than 90% of the global coal output. The geographical spread of coal reserves, incurs considerable costs in transportation and handling of coal, from the mine to the user.\nThe National Energy Policy & Strategies of Sri Lanka places renewable energy development as a high priority and considers it to be one among the nine main policy elements. This policy paper which is now being reviewed is likely to further strengthen the policy focus on renewable energy development. It is envisaged the present 10 % level of renewable energy component of the electricity generation would increase up to 20 % by the year 2015.\nThe National Energy Policy & Strategies of Sri Lanka places renewable energy development as a high priority and considers it to be in the forefront among the nine main policy elements said the minister . This policy paper which is now being reviewed is likely to further strengthen the policy focus on renewable energy development, hence It is envisaged the present 10 % level of renewable energy component of the electricity generation would increase up to 20 % by the year 2015 said Minister Ranawaka in conclusion.\n", 
  "title": "Renewable Energy Sources a viable solution to the Power Crisis", 
  "url": "http://powermin.gov.lk/english/?p=2282"
}