{
  "date": "10 Nov", 
  "text": "His Excellency president Mahinda Rajapakse during his swearing in ceremony that by 2016 electricity coverage will be provided for the entire country. However thanks to his expeditious development plan we are now able to fulfill that dream by 2012. In the past although electricity was a luxury afforded only to the affluent, today it is an essential service. And in a bid to extend that fundamental right to the rural masses minister of Power and Energy Patali Champiuka Ranwaka has issued instructions to provide electricity even to the difficult areas. The minster made these comments at a ceremony to vest in the public the Weheragala rural electrification project in the Minaragala district.\nThis project initiated at a cost of Rs. 13.5Million will Benefit 200 families in the area. Concurrent to this event the Dawsor street rural electrification project at a cost of Rs.15.9 million and Rajakandiya at a cost of Rs. 9. 07 million was vested in the public by the minister. In addition the opening of the Uva reawakening project office, inauguration of the Buttala Grantre electrification project and the inspection of the Diyathalawa rural electrical engineers office and consumer center was also carried out by Minister Ranawaka. Minister Ranawaka vesting these projects in the people stated that in the past people retied for the people by 6 or 7 in the evening. However today the situation has changed dramatically and there has been immense development in the industrial sector even in rural areas. Thus electricity has become a vital aspect of this development. He said today people dont need to depend or be hood winked by promises of politicians during election periods. Instead electricity will be provided for all irrespective of their political affiliations.\nCommenting further minister Ranawaka said that they are urging the public to use electricity sparingly. The Minister went on to say that people dont need to buy electrical equipment just for the sake of buying it but buy only when u really need it.\nWhen officials arrive to grant them electricity connections they see them as divine beings. Due to adversity climatic conditions in the reason past has to be curtailed. However due to the contribution of thermal power to the national grid this situation was averted. It is stated even in Buddhist scriptures that proving light is equal to giving eyesight to a person. The primary aim of providing electricity to the rural masses is to provide the younger generation more learning opportunities thus widening their scope of education opportunities. The minister finally said in conclusion that although our generation had to engage in learning with the aid of the flickering light of the bottle lamp, however our children need not endure those hardships. He said the day these children go back to their villages as doctors or engineers it will not only be a pride for their parents but a sense of pride and satisfaction for those who provided them electricity as well\n", 
  "title": "Uva Province Monaragala achieves 70% Electrification coverage", 
  "url": "http://powermin.gov.lk/english/?p=2300"
}