{
  "date": "10 Jul", 
  "text": "The annual Pan poojaurgingtimely rain held by the Ministry of Power and Energy headed by Minister Patali Champika Ranawaka was held yesterday at the Jaya Sri Maha Bhodiya.\nThe Ministry of Power and Energy said that the intention of this yearly ritual is to ensure the rains are consistent throughout the year enabling the uninterrupted power generation at the Hydro power stations.\nOn the instructions of the Atamasthanadhipathi Dr. Pallegama Siriniwasa thero 11 pots of water collected from Maussakale, Castlereigh, Victoria, Kothmale, Randenigala, Bowatanne, Inginiyagala, Samanalawewa, Kukuleganga, Ukuwela and Udawalawe which supplies the water for the generation of Hydro power were taken to the Anuradhapura Galkulama Sudharmarama Temple in a motor procession and then taken to the Ruwan Wali Maha Saya amid seth pirith chanting of the high priests.\nThe pots of the water were then placed before the Sri Maha Bhodhiya and offered by the high priests and the chosen disguised guests, seeking blessings for uninterrupted rain for the stable generation of power throughout the year.\nThe Minister of Power and Energy also inaugurated a special electricity supply illuminating the area between the Anuradhapura Sri Maha Bhodiya and Ruwan weli Seya. Chief Minister of the North Central Province Berty Premalal Dissanayake was also present at this special ceremony.\nIn addition to the Minister of Power and Energy Patali Champika Ranawaka, CEB chairman Wimaladharma Abeywickrema, GM Nihal Wickremasuriya, Power Generation Unit Additional GM M.G. Wickremasekera and a significant gathering of CEB employees also took part in this religious ceremony.\nConcurrent to this ceremony water obtained from the Maussakale and Castlereigh reservoirs were offered to the Maussakale Sri Saman Devalaya in a special pooja. A pirith recital urging timely rainfall was conducted on the advice of theSripadasthanadhipathi under the patronage of the Deputy Minister of Power and Energy Premalal Jayasekera yesterday\n", 
  "title": "Aamisa Pooja held at the Sri Maha Bhodiya pleading for timely rain.", 
  "url": "http://powermin.gov.lk/english/?p=2382"
}