{
  "date": "05 Jul", 
  "text": "Our Language has a very long history. Therefore it is vital for us to safeguard our languagewhich has a history of around 300 years for the sake of our future generations. Minister of Power and Energy Patali Champika Ranawaka stated that it is perhaps due to the fact that out of about 6000 languages hailing from the time of Mihindu Maha Rahathan Wahanse, our language boasts of a 3000 year history. The minister made these comments addressing a gathering as the chief gust at a poetry recital organized by the CEB Internal Audit and Special investigations unit welfare committee, All Ceylon Poetry federation and the Young poetry club at the Jana Kala Kendraya in Battaramulla.\nAddressing the Gathering the Minister further said:\nOut of around 6000 languages currently in use our language has a prominent place due to it being in use for the past 3000 years continuously. He said we should thereforeprotect our language a further 3000 years for the benefit of our future generations. There is a close bond between Buddhism and our language. During the Initial stages poetry evolved based on this relationship.\nHowever literary masterpieces of our land were not done leisurely. Almost every piece was created while working, whereas other literary creations were done at leisure. With the advancement of language there was a difference in literary creations as well, although it was always not a satisfactory one. The poets of yesteryear produced their creations in a more devious manner, whereas the present day poets simply ink their thoughts in crude form. However he said that we can anticipate a more favorable future thanks toPoetry recitals such as this.\nConcurrent to the Poetry recital by a distinguished poets, a book on poetry by the CEB Accountant Dambagasaare Karunadasa was also launched. This poetry recital no doubt was a welcome change for those gathered which also featured prominent poets such as P.M. Ajith, Piya Hingurangala, Pabasara Liyanage, Warakapola Ayarin, Makandure Amarasinghe, Palpita Ubayawansa, Walpitamulle Sunil Perera, Malabe Ajith Wettasinghe and Rev. Galley Athulananda Thero.\nThis event was also graced by the Chairman of the CEB, GM and a large gathering of staff members.\n", 
  "title": "Our Language which has a 3000 year history should be preserved further", 
  "url": "http://powermin.gov.lk/english/?p=2396"
}