{
  "date": "24 Jul", 
  "text": "In the face of financial difficulty we all expect top pay less on electricity bills, as it is difficult to pay huge amounts for electricity. But reducing the cost on electricity bills is also in the hands of the consumer. By conserving energy and reducing wastage we could make a clear difference in our electricity bills. This could result not only is savings for the consumer but also for the progress of the country as well. The Minister of Power and Energy Patali Champika Ranawaka made these comments today (23.06.11) addressing a group of employees of the Homagama General Hospital on the Preservation of electricity.\nThis educational seminar on the preservation methods of electricity and adhering to these methods, organized by the Renewable Energy Authority on the instructions of the Minister of Power and Energy Patali Champika Ranawaka, highlighted the benefits not only individually but as a whole country. Prior to this seminar previous seminars targeting both the State and Private sector were organized firstly at the World Trade Centre, followed by Sri Lankan Catering, Blood Bank, Sampath Bank and Bank of Ceylon staff.\nAddressing the gathering Minister Ranawaka stated that:\nIf the previous authorities had taken the right decisions at the right time many obstacles faced by the Power and Energy Sector could have been averted. But no matter what obstacles we have had to face Sri Lanka is the only country in the Asian region that provides electricity 24 hours a day uninterrupted. Therefore it is right to say that our country is in the forefront where electricity supply is concerned. The time has dawned where we must move away from expendable energy sources and focus our attention on low cost alternative energy sources. The minister urged the people to assist in the process of evolving from traditional energy sources to more cost effective alternative energy sources, and in completely putting behind us the era of darkness and taking the country into a new era of energy efficiency.\nThe Director of the Homagama General Hospital Karunaratne Samarasinghe, Deputy Director Pushpa Gamlath and Chairman of the Renewable Energy Authority Dr, Kithsiri Dissanayake together with around 250 hospital staff members participated in this seminar.\n", 
  "title": "By increasing the efficiency and minimizing wastage there could be a clear difference in electricity bills.", 
  "url": "http://powermin.gov.lk/english/?p=2402"
}