{
  "date": "20 Jul", 
  "text": "After a lapse of 22 years The Minister of Power and Energy Patali Champika Ranawaka visited Polonnaruwa to discuss the electricity problems of the people of the area and also held discussions with the employees of the CEB last Saturday (11.06.11)\nDuring this visit of the Minister of Power and Energy held at the Hingurakgoda Ananda Balika Maha Widyalaya, from 9.30 am to 5.00 pm a mobile service was conducted for the benefit of the electricity consumers of Minneriya, Hingurakgods, Madirigiriya and Manampitiya areas, while this mobile service was successfully conducted under the guidance of the Deputy General Manager of the North Central Province CEB Gratian Muthukudaarachchi by the Electrical Engineer of Madawachchiya Hemali Amaradiwakara, Chief Engineer construction Shirley Kumara, commercial engineer Samanthi Sudharshani and the dedicated service of the entire CEB staff . Here issues pertaining to bills, breakdowns, and electricity meters were attended to, while those anticipating new electricity connections were also given their connections. During the course of this mobile service those who had applied for new electricity connections were handed their connections by Minister Ranawaka. Land development deputy Minister Siripala Gamlath, Deputy Minister Social Services Chandrasiri Sooriyaarachchi and around 600 villagers attended this mobile service.\nConcurrent to this Mobile service, a special discussion on the problems faced by the people and on ways of maintaining an efficient electricity service in the polonnaruwa district was held with the politicians of the area including the Land development deputy Minister Siripala Gamlath, Deputy Minister Social Services Chandrasiri Sooriyaarachchi, The North Central Province Power and Energy Minister Nandasena Ratnayake and North Central Province Minister Peshala Jayaratne, together with several provincial counselors and consumer representatives. At this discussion issues related to the power supply in the area together with the future plans for new electricity projects in keeping with the vision of the Minister of Power and Energy Patali Champika Ranawaka by 2012 were also reviewed.\nMeanwhile the Manampitiya E City office built to cater to the electricity needs of the people of the Minneriya area was also declared open by Minister Ranawaka.Meanwhile the minister also engaged in cordial discussions with the nearly 170 employees of the Minneriya area electrical Engineers office. An employee of the with nearly 30 years of service added that this is the first time in his service that he has witnessed the visit of a minister to their office. It was also heartwarming to see him gift the minister a historical artifact on behalf of the entire staff as a token of gratitude and happiness.\nAnother Electrification scheme was inaugurated by the Minister of Power and Energy benefiting 132 families in Payagala Kalugala Yaya 1 while another at Udakorasagalla was also handed over to the public by the minister providing electricity to 61 families in the area. Provincial councillors Weerasena Gamage and Duminda Dissanayake participated in this event. Addressing those gatherd at this handing over Minister Ranawaka said that these electrification projects were inaugurated not just for the villagers to watch tele dramas, matches and realty programs, but for the future of the children of the area and also for the small scale and medium scale business community to further develop their operations.\nThe Ministry of Power and Energy stated that so far this year inclusive of the 12th and 13th 26 electrification projects have been completed in the Anuradhapura district at a cost of Rs. 185.9 million benefiting 1560 families.\nPrior to the Poya day the deputy minister Duminda Dissanayake escorted the Minister of Power and Energy to the Allawewa Kahatagasdigiliya Veragala Siri Sangabo Raja Maha Viharaya, giving the minister the rare opportunity of witnessing the rare artifacts obtained through excavations being conducted at the temple. Subsequent to the temple visit the minister visited the North Central province CEB General Managers office and held cordial discussions with the workers there. Addressing them the minister said the the CEB has evolved from being an organisation plagued with debt to one that is showing great promise and have begun to make profits and is not indebted to any institution. He also told them that they should think of the consumer as their friend.\nWith the aim of improving the 81% coverage in the Anuradhapura district to 100% the Minister held discussions with senior officials of the power sector together with the politicians of the area.Chief Minister of the North Central Province Berty Premalal Dissanayake, Youth Affairs and skills development deputy Minister Duminda Dissanayake, Women and Child development minister Tissa karaliyadda, Irrigation and Water Resource Minister W. B Ekanayake Provincial MP Samarasinghe and several others participated in this event.\nHere the Minister discussed the progress on Widulamu Lanka in providing electricity to all and appreciated the dedication and commitment of the work force involved in these projects.\nEnding the 4 day tour Minister Ranawaka participated at the illumination ceremony of Ruwanvali seya together with the Prime Minister and opened the Aloka Poojawa on the 14th at 7 pm at Mihinthalaya in Anuradhapura.\nMay the Blessing of the Triple gem grant the Minister of Power and Energy and his staff the strengh and courage to forge forward in achieving their goal of Electricity for all by the year 2012.\n", 
  "title": "A nation Illumination.", 
  "url": "http://powermin.gov.lk/english/?p=2409"
}