{
  "date": "20 Jul", 
  "text": "In View of the Poson Celebrations and in line with the electrification process of the entire North Central Province, focusing on the Anuradhapura District under the guidance of the Minister Of Power and Energy Patali Champika Ranawaka, and the supervision of the Renewable Energy Authority, an E-2 Energy Efficiency Shop was established for the proper utilization of the areas Natural and human resources by minister Ranawaka. The uniqueness of this was that it is the first such center for the efficient utilization ofpower and energy.\nThe Efficient utilization of power is the best method to overcome the power crisis faced by country. The Ministry of Power and Energy pointed out that from the point of power generation to the point of consumption, minimizing wastage is the best way to make maximum use of the available resources. This center will also educate the consumer of the best methods of power conservation. The ministry further stated that not only from the government perspective but this center will also serve in helping the consumer spend less on power and avail them of the benefits such conservation brings.\nThrough this center programs will be implemented for the efficient usage of electricity in both state and private establishments. This center will properly manage the Natural resources as well as the Human resources in the area. The Ministry of Power and Energy stated that this center will also hold several educational programs on the efficient use of electricity targeting schools and higher education centers in the area. In addition this center this center will also set the background for the proper and efficient use of electricity.\nWhile steps are being taken to provide an efficient service for the Anuradhapura district, an E city office was also declared open by the minister of Power and Energy for the convenienceof the consumers.\n", 
  "title": "The First E-2 Center for Maintaining an Efficient Electricity Service Established in Anuradhapura", 
  "url": "http://powermin.gov.lk/english/?p=2412"
}