{
  "date": "16 Jul", 
  "text": "energy is a very important topic for the entire world today. The world has been looking for economic development throughout the past period and different areas like technology, information management, etc. have attained far reaching goals. For this economic development, energy is one of the major resources used for which the major source is fossil fuel. Extensive use of fossil fuel in the way we do right now, has led to energy and environmental crises faced by mankind. On the one side, there is a rapid depletion of fossil fuel resources. On the other side the burning of fossil fuel results in environmental issues. Therefore, the focus of the entire world has been set towards the sustainability in the energy sector, and apart from the long-term energy sustainability, obviously it is necessary that we do have more sustainable solutions for energy in the short-term horizon as well.\nOn the Invitation of the SAARC Power and Energy Center, on the instructions of the Ministry of power and Energy, a four day workshop on Power and energy conservation was organized by the Renewable Energy Authority with the participation of 6 countries at the Colombo Intercontinental Hotel with the patronage of the Minister of Power and Energy Patali Champika Ranawaka this morning. (16.06.11)\nShifting the energy scenario from the fossil fuel base to a renewable energy base is our goal in the generation side with the targets of achieving 10% of the power generation using renewable energy by 2015 and 20% of power generation by 2020. Nevertheless it is of no lesser importance that we launch demand side management and energy efficiency improvement activities from the user side. The Minister further said We have set target to achieve 10% of the energy consumption in 2010 by 2020. All in all, these are the possible pathways towards sustainable development. As a region, he said , SAARC countries have the opportunity in collaborating activities in these lines.\nThe Director of the SAARC region Power and Energy Centre Prof. Mohomed Farvas, Chairman of the Renewable Energy Authority Dr. Kithsiri Dissanayake, Director of the Ministry of Power and Energy Upali Daranagama and CEB general Manager Nihal Wickremasuriya including many foreign dignitaries participated in this event.\n", 
  "title": "SAARC Region Training Programme on Energy Management & Energy Auditing to be held in Colombo", 
  "url": "http://powermin.gov.lk/english/?p=2418"
}