{
  "date": "14 Jul", 
  "text": "Concurrent to the Poson Celebrations Mahahalmillawa, Galkandegama, Kalathirappane, Kalugalayaya 1 and Udakorasagalla electrification projects were handed over to the public by the Minister of Power and Energy Patali Champika Ranawaka, benefiting 361 families and costing the Ministry of Power and Energy Rs. 84 million.\nAddressing the gathering Minister Ranawaka stated that the aim of these electrification projects is not to simply provide entertainment opportunities to the villagers in terms of Tele Dramas, and Reality shows, but with a view to providing opportunities for the younger generation to better develop their future, and to support the village small scale businesses to grow into medium and large scale enterprises thus strengthening the backbone of the countrys economy.\nTargeting 5 areas most prone to elephant attacks, the Minister of Power and Energy handed over 5 electrification projects over to the public. Here the transformer of theMahahalmillawa electrification project was established at a cost of Rs. 78 lakhs, for the benefit of 75 families in the Alapaththuwa and Ahatuwewa areas.\nProviding of electricity for 63 families of the Galkandegama area was carried out by the Agrarian Services and wildlife minister S. M. Chandrasena. The villagers stated that the provision of electricity was a huge boost to their success. In addition electricity was provided to 45 families living in harsh conditions by Minister Ranawaka. Furthermore benefiting 132 families the Kalugalayaya Electrification scheme and Udakorasagalla for the benefit of 61 families was inaugurated by the Minister. Provincial MP Weerasena Gamage and Youth Services and Skills development deputy Minister Duminda Dissanayake participated.\nWith the aim of increasing the electricity coverage to 100% which was at 81% in the Anuradhapura district discussions were held between the minister and officials of the CEB and other politicians. Chief Minister Berty Premalal Dissanayake.Land Development Minister Siripala Gamlath, Social Services Deputy Minister Chandrasiri Sooriyaarachchi, North Central ProvinceMinisterof Power Nandasena Ratnayake, Provincial Minister Peshala Jayaratne and several other Provincial ministers and Parliamentarians participated in this event.\nWhile Minister Ranawaka on this occasion spoke about the many electrification projects being launched in order to fulfill the goal of providing electricity to all by 2012.\nBy June this year 26 electrification projects have been completed in the Anuradhapura district benefiting 1560 families. The ministry of power and energy incurred Rs. 185.9 million.\n", 
  "title": "Anuradhapura Electrification 81% covered.", 
  "url": "http://powermin.gov.lk/english/?p=2425"
}