{
  "date": "13 Jul", 
  "text": "After a lapse of 22 years The Minister of Power and Energy Patali Champika Ranawaka visited Polonnaruwa to discuss the electricity problems of the people of the area and also held discussions with the employees of the CEB last Saturday (11.06.11)\nDuring this visit of the Minister of Power and Energy held at the Hingurakgoda Ananda Balika Maha Widyalaya, from 9.30 am to 5.00 pm a mobile service was conducted for the benefit of the electricity consumers of Minneriya, Hingurakgods, Madirigiriya and Manampitiya areas, while this mobile service was conducted under the guidance of the Deputy General Manager of the North Central Province CEB by the Electrical Engineering section. Here issues pertaining to bills, breakdowns, and electricity meters were attended to, while those anticipating new electricity connections were also given their connections. During the course of this mobile service those who had applied for new electricity connections were handed their connections by Minister Ranawaka. Land development deputy Minister Siripala Gamlath, Deputy Minister Social Services Chandrasiri Sooriyaarachchi and around 600 villagers attended this mobile service.\nConcurrent to this Mobile service, a special discussion on the problems faced by the people and on ways of maintaining an efficient electricity service in the polonnaruwa district was held with the politicians of the area including the Land development deputy Minister Siripala Gamlath, Deputy Minister Social Services Chandrasiri Sooriyaarachchi, The North Central Province Power and Energy Minister Nandasena Ratnayake and North Central Province Minister Peshala Jayaratne, together with several provincial counselors and consumer representatives. At this discussion issues related to the power supply in the area together with the future plans for new electricity projects in keeping with the vision of the Minister of Power and Energy Patali Champika Ranawaka by 2012 were also reviewed.\nMeanwhile the Manampitiya E City office built to cater to the electricity needs of the people of the Minneriya area was also declared open by Minister Ranawaka.\nThree electrification schemes initiated with the aim of improving the 80% coverage of the Polonnaruwa district was handed over to the public by minister Ranawaka. The 3 projects namely Nikapitiya, Nikapitiya Gembagala and Alahara Wakanda electrification Projects were handed over to the public, while the Government has incurred an expense of Rs. 14 million to provide electricity to 301 families in this area. While this year 7 electrification projects in the Polonnaruwa District have been handed over to the public, the Government has incurred an expense of Rs. 37.6 million which has benefited 551 families. The Minister stated that the Government has already allocated funds to support the electrification projects in the Polonnaruwa District with the aim of fulfilling the goal of 100% electrification coverage in the Polonnaruwa District.\n", 
  "title": "80% Electrification coverage for the Polonnaruwa District.", 
  "url": "http://powermin.gov.lk/english/?p=2428"
}