{
  "date": "01 May", 
  "text": "Let me first thank you for the keen interest in participating this all important event, which I am sure all of you will benefit and will get a good insight about not only the concept of Balanc Score Card but also about the future operational strategy of the CEB.\nAt the outset I would like to emphasis that as government owned entities we used to measure and evaluate only financial indicators and this was the primary criteria in gauging the successfulness of our organizations. But, in addition to the financial perspective there are three additional perspectives, namely Customers, Employee Learning & Growth and Internal Business Process. As a whole we need to strike a right balance between these four vital elements. This balancing act will be done by the process called the Balanced Score Card System.\nBalanced Score Card System is a strategic planning and management tool which can be used in an organization to align and focus our activities to the vision and strategy of the organization, to improve internal and external communications, and to monitor organization performance against strategic goals. This will help us to add non-financial measures to financial measures which will reflect a more balanced perspective of our organization. I must also stress that this is not a tool to measure any individual performances but to measure the overall strategy of the organization with necessary corrective indicators. Measuring individual performances for personal appraisal will be an entirely different methodology and perhaps if we succeed in achieving the desired results we might have to extend this process for individual performance appraisals.\nThis may be the first time in a government organization in Sri Lanka, to start such a process and I wish CEB can take the lead and show the rest of the institutions the way forward.\nHaving said that, I am of the opinion that CEB is a well-managed organization when compared to most of our state owned entities, but I would like to emphasis that we could do a lot better especially related to customer satisfaction, to be more productive, to stream line our internal structure and activities to clearly reflect organizational goals and objectives. This will help us to be at the forefront of well managed institutions in our country even above the private sector.\nDear friends, we should clearly address the problem of not truly representing the internal structure of the CEB with a well-managed balanced Score Card system. We must extend this process taking into account the socio economic benefits of our activities and those parameters should also be internalize to create a right balance. For an example we can measure the incremental increase in land prices, impact on having uninterrupted electricity throughout 24 hours, measuring the quality of our power supply to our customers, etc. If we add other external parameters like socio-economic benefits created by the CEB we would be able to calculate the total profits rather than direct financial profits. The principle of Corporate Shared Value could guide us to achieve this.\nHow do we identify these internal and external factors and create a strategic approach to meet our goals and objectives. In this scenario I believe that problem lies within us, which remain trapped in an outdated approach to value creation that has emerged over the past few decades.\nWe continue to view value creation narrowly, trying to optimize financial performance but might be missing the most important customer needs and wants. We should take the lead in bringing our business and society more closer and create a new model of our own. We should also look for the principle of shared value, which involves creating economic value in a way that also creates value for society by addressing its needs and challenges.\nAccording to the Harvard Business Review,\nThe concept of shared value can be defined as policies and operating practices that enhance the competitiveness of a company while simultaneously advancing the economic and social conditions in the communities in which it operates. Shared value creation focuses on identifying and expanding the connections between societal and economic progress\nUnquote\nHaving said that let me also speak a few words about why we should go for green energy. The renewable energy sources are, in abundance in nature, are, at first, more expensive and difficult to draw on, but priced properly, will be cheap, reliable and clean. In addition with consequences of climate change, which I am confident we are now experiencing to a certain extent, there is no choice for us, but to start moving towards cleaner and greener energy sources in the future.\nOn this perspective we not only as a nation but also as the whole world are now meeting the challenges of climate with greener technology on a grand scale. Please look into the things now happening in the world especially related to the oil and gas, there will be more chaos in future and prices of oil, gas and coal will increase and by 2030 there will not be sufficient and economical energy sources for countries like us. Therefore, we should prepare our plans now and look forward for greener and safer energy sources.\nI am positive that Balanced Score Card if properly implemented will be a strategic planning and management tool which will not only measure our individual performances against the organizational objectives but also will help us to identify what should be done and measured. This will help the senior managers like you to truly execute your strategies.What is imperative is, as professionals, we strive for the unfettered mind and the truth. As professionals we intend to defend the independent professional judgment against the subjective irrational opinion of the ordinary.\nBesides, our country won this unity through the great sacrifices and sufferings of many. It is now time for the great reconciliation and the building of a prosperous nation. Just like building the nation in a psychological sense, building the nation in the physical sense is also important. It is the duty of professionals like you to take the lead in both spheres of activity.\nI sincerely wish that todays conference will be able to contribute to the progress of our organization.\n", 
  "title": "For the first time in the State Sector CEB Going for Balance score card System", 
  "url": "http://powermin.gov.lk/english/?p=2452"
}