{
  "date": "08 Feb", 
  "text": "I posess a clean set of hands in order to provide an honest efficient service to the power and energy sector, said the new minister of Power and Energy Pavithra Wanniarachchi.\nAssuming duties on 31 January, minister Wanniarachchi said that her intention was to continue the efficient service that was accorded to the general public thus far, pointing out that she has been able to carry on the duties entrusted to her by the President so far without any complications. Similarly I am confident that I will be able to manage the Power and Energy sector that is said to have some problamatic situations, without any hindrance or burdening the consumer or the work force, she said.\nThe new minister of Power and Energy Attorney Pavithra Wanniarachchi took her oaths before the president on 28 January 2013. She is the daughter of MP for Pelmadulla and deputy minister of Industry and Scientific Affairs and the Governer of the Wayamba province the late Dharmadasa Wanniarachchi. Pavithra Wanniarachchi who entered politics as an MP for the Sabaragamuwa Provincial Council, was elected to parliament in 1994 as the Deputy Minister for Health, Social Services and Highways. Since 2000 to date she has been functioning in the capacity of the Cabinet Minister for plan implementation, Samurdhi activities and eradicating poverty, Youth Services, National Heritage and Cultural Affairs, and prior to her present appointment she was also functioning in the capacity of the Minister of Technology and Research. Wanniarachchi is also the deputy secretary of the Sri Lanka Freedom Party and is in charge of the partys womens wing.\nSubsequent to assuming duties with the blessings of the Maha Sangha the minister said that one of the main reasons for complications arising in the power and energy sector is the high production cost. Therefore instead of burdening the consumer with the additional costs, we must endeavor to solve the issues plaguing this sector, and find appropriate solutions. I anticipate the untiring support of the deputy minister and all other institutions affiliated to the ministry of power and energy in achieving the task of achieving Sri Lankas total electrification target, which is currently at 94% TO 100% by the end of this year, she said.\nSeveral other ministers including the minister of Economic Development Basil Rajapaksa, Deputy Minister of Power and Energy Premalal Jayasekera, Chairman of the Sabaragamuwa Provincial Council Kanchana Jayaratne, the Director General of the Media Centre for National Security Lakshman Hullugalle and several other dignitaries also participated in the ceremony.\n", 
  "title": "Pavithra Wanniarachchi assumes duties as the new MInister of Power and Energy", 
  "url": "http://powermin.gov.lk/english/?p=3040"
}