{
  "date": "15 Aug", 
  "text": "The CEB, which was blacklisted as a loss making organization by the COPE Report (Parliamentary Select Committee on Common Enterprises) has now turned into a profit making Organization states, Attorney  At Law, and Hon. Minister of Power and Energy Pavithra Wanniarachchi.\nJoining the ceremony she further stated that the Ceylon Electricity Board recorded a substantial profit in 2013 and that it is expected to record a similar profit in 2014 too.\nWhen our Hon President handed over this Ministry to me in 2013 he told me to ensure that the whole country should be provided with electricity in 2014. As a person who was born in the village and brought up in the village and who loved the people of the village knows the suffering of the poor man in the village without electricity. That is why he got activated and decided to give electricity to the village.\nOur President really and truly loves children. As a villager he is well aware of the hardship and the trauma that the village children had to undergo when they had to trudge to school passing muddy holes while carrying their shoes in their hands. The trauma and the difficulties they had to undergo when studying with the light of the kerosene lamp. It is because of these reasons that he took a policy decision to develop the village.\nIt is the hope and wish of the leader of our country that we should take our children to a higher place and level in society than their parents. The hearts and minds of our people are strong, and they never sway in times and situations of adversity and have the courage and the back bone to stand up to any adverse situation. They can work hard too. If we help the children of these parents with the aforementioned qualities we cannot even imagine where they would finally end up.\nToday our country is in the process of standing up and developing. All villages are developing. By the end of this year the country will get 100 % electrification .Even though the villages did have electricity, at the time I took over this portfolio there were no electricity poles near the houses. Therefore the people were unable to get electricity. They had to obtain the electricity at their own expense. But I changed the Electricity Bill. The onus of providing electricity poles right up to the houses were vested by me in the Ceylon Electricity Board. I did not stop there. Our people who have to put up a severe battle with the elements have no means to get the electricity from the electricity pole that is fixed in front of their house, nor do they have the means to wire their houses. It is to solve this problem that it was decided to grant a loan of Rs. 40,000/- which could be settled within 6 years, and which includes the cost of electricity consumption too. It has been arranged to set off this loan plus the electricity consumption within these 6 years of the loan payment. This project has been planned and initiated as a concessionary means of providing electricity to the village folk who live under various difficulties, to obtain electricity. By successfully providing electricity to the village folk their standard of living, their economic sustainability and social and cultural values have undergone a massive metamorphosis.\nThe era of Mahinda Rajapakse is a period of huge change. This change is an era where the lives of the poor man have been uplifted. What did the UNP do for us? No roads were built, no electricity was given, no schools were built. All they came for were the votes.\nThe Ceylon Electricity Board sustained losses for many number of years. It joined the list of institutions that sustained losses according to the COPE Report. But last year the CEB recorded a substantial profit. According to the far seeing policies and programs of His Excellency the President, we have been successful in recording a good profit this year too, said Hon. Minister Pavithra Wanniarachchi.\n", 
  "title": "The ceylon electricity board, which was listed as a loss making entity by cope has now turned into a profit making organization", 
  "url": "http://powermin.gov.lk/english/?p=3380"
}