{
  "date": "10 Sep", 
  "text": "Hon Minister of Power & Energy, Pavithra Wanniarachchi, Attorney at Law, stated that the CEB will not be an institution riddled with Debt burdens any more and that it has now transformed itself to a people friendly institution serving the people, under the able and far seeing leadership of His Excellency President Mahinda Rajaapakse. She stated this when she attended the ceremony to handover the concessionary loans to get electricity connections for the houses of low income families which started from the Ratnapura district.\nUnder the concept of Mahinda Chinthana to ensure the upliftment of low income village families, the Ceylon Electricity Board, under the direction of the Ministry of Power and Energy too, has launched many schemes. Under this scheme a maximum amount of Rs. 40,000 will be given as a concessionary loan to be paid within 6 years, under an instalment scheme , which includes the electricity bill.\nSpeaking further at this inauguration ceremony the Hon Minister if Power and Energy, Pavithra Wanniarachchi, Attorney at Law stated that in order to speed up the programme to provide electricity to all households in the inland, this concessionary loan scheme was introduced and inaugurated under the guidance and advice of His Excellency the President, Mahinda Rajapakse. The Hon Minister, Pavithra Wanniarachchi also stated that the present government is the only government who considered that, it is a basic Human right to provide electricity to the people.\nWhen I first took over the Ministry of Power and Energy the rule at that time was, even though there is electricity in the village, the public had to spend out of their pocket to install the power poles if they wish to get electricity for their homes. But I changed this rule. I took a practical decision that just as much electricity is given to the village, the onus to fix an electricity pole in front of the house, should be vested with the Ceylon Electricity Board.\nAt that time Hon. President gave me the responsibility of providing electricity to all households by end of 2014. What we understood, when we went to the villages was that eventhough electricity had come to the village, it was difficult to get the electricity to the house from the pole, due to the poverty of our people. Some people did not have enough money even to get the wiring installed in their house. There was no body or no institution to lend them the money for this purpose. It was while looking for a solution for this problem that we came up with this idea to get the Electricity Board to bear the cost of wiring and the cost of installing the electricity Pole in front of the house and to recover this money, along with the electricity bill , in 72 monthly installments in 6 years, without any interest and thus providing electricity to the people.\nWe should be grateful to our President for giving the necessary advice and guidance for this practical solution. We should be grateful to our President, who is like a loving father to our people.\nElectricity is a wonderful thing. Today every nook and corner of Sri Lanka has electricity. We will be able to supply 100% electricity by the end of this year to the country.Even in countries in this region, such as India, Nepal, Pakistan and China there is no 100% electricity supply. However the Hon. President gave me this target. When I told this to my officers they took all measures to achieve this target.\nAttending this occasion was Mr. Kanchana Jayaratne, Chairman of the Sabaragamuwa Provincial Council, vice chairman of the Ceylon Electricity board Mr. KapilaPerera, General Manager of the CEB Mr. Shavindranath Fernando, and all Senior officials of the Ceylon Electricity Board and members of the Provincial and Pradesheeya Sabhas of the Ratnapura District.\n", 
  "title": "The sri lanka electricity board will no longer be an institution of debt", 
  "url": "http://powermin.gov.lk/english/?p=3387"
}