{
  "date": "31 Mar", 
  "text": "EnergyEmpowered Nation Theten-yeardevelopmentplanof theenergysectorwaslaunchedby the Hon. Prime Minister Ranil Wickramasinghe with the invitation of the Minister of power andenergyHon. Patali Champika Ranawaka at theWatersEdge, Battaramulla, with the participation of eminent people in thesector.\nWith the theme EnergyEmpowered Nation the practical workplanup to 2025 had been formulated by the ministry of power andenergyand its affiliated institutions with the contribution of privatesector. Theplanhad focused on 08 thrust areas that have direct impact on theenergysector.\nThe Minister Patali Champika Ranawaka pointed out that the foundation of theenergyplanis the energysecurity. It is crucial for our country as the stability of our country, stability of theenergysectorand the basis of ourdevelopmentis highly affected by the energysecurity. A country without energysecurity is a country that is insecure. Such a country cannot achieve stable and sustainabledevelopment. Therefore, we must always strive to achieve theenergysecurity. Minister Ranawaka further explained his views on the plans ahead said,\nIn the future we are expecting to develop the greenenergy. Today, the contribution of greenenergyto the total power generation is about 50%. By 2020 we are expecting to increase the contribution by another 20%. In the meantime we are expecting to provide electricity to the whole population by the end of thisyear. Further, we expect to minimize theenergywastage and improve the conservation ofenergy. The dependency of the Transportationsectoron fossil fuel has to minimize. Hence we are expecting to establish the firstelectric vehicle charging stationbefore the Sinhala newYear. An issue of energydebentures also will be planned with an intention of minimizing the debt burden of the electricity board and petroleum corporation.\nPrime minister Hon. Ranil Wickramasinghe speaking in the occasion said that, the country should self-sufficient withenergyto establish a knowledge based society. Recalling the introduction of the open economy system in 1977 and the implementation of the integrated Mahaweli scheme, he said those initiatives were taken with the aim of making Sri Lanka self-sufficient in power requirements. Prime Minister further said the people of the country must thankful to minister Ranawaka who understood the necessity ofenergyrequirements and prepared plans accordingly.\nMinister of Finance Hon. Ravi Karunanayaka, Minister of Disaster Management Hon. A.H.M.Fawsi, Minister of UrbanDevelopment, water supply and drainage Hon. Rauf Hakim, State minister of Plantations Hon. K.Vellayuthan, Hon. Nishantha Sri Warnasinghe Provincial Councilor and Secretaries of the ministries of power andenergy, Finance, Policy planning, childrens affaires, and transportation, and Senior officials of Ceylon Electricity Board, Lanka Electricity Company(Pvt) Ltd, Ceylon petroleum corporation, and Sri Lanka Sustainableenergyauthority participated the event.\n", 
  "title": "Ten year Sri Lanka Energy Sector Development Plan launched", 
  "url": "http://powermin.gov.lk/english/?p=3502"
}