{
  "date": "04 May", 
  "text": "If the country is ruling under good governance, timely rains will occur, harvest will boom and the country will be able to move forward smoothly. Now the ministry of power and energy has given a new target to be achieved. Sri Lanka has to be self -sufficient with energy as the same manner it is sufficient in paddy by now. We are starting the program this year. We will start extracting oil and natural gas from our own oil and gas deposits.\nWe hope that we would be succeeded in this task with the blessing of the Tooth Relic, spiritual power and the blessings of other relics. Our intention is to see this country is becoming super nation that is self-sufficient in energy. We wish that the religious and good governance and the rule of good moral strengthened by the new administration to carry forward the entire country a place of proud and a prestige, said Mr. Patali Champika Ranawaka the Minister of Power and Energy.\nHe expressed his views at a ceremony of laying the foundation stone for the construction of a multi-purpose building at the Sri Dalada Maligawa premises. The multipurpose building is expected to provide services for the devotees who are visiting to offer homage to the sacred tooth relic and for the artists who are participating at the Procession of the Temple of Tooth Relic. The costs will be incurred by the Ministry of Power and Energy and the designing will be carried out by the Sri Lanka Navy.\nSpeaking at the occasion Minister Ranawaka further said,\nThis location where the sacred tooth relic is housed is very important to us. We need to remember again and again that this country had protected the Buddha Sasana continuously for two thousand three hundred years. There is no such a religious history for any other country in the world.\nFinally, when we lost our country to foreign invaders, it was happened in this vicinity. At that time many patriotic people of the country had made great sacrifices to save our motherland with the blessings of the Sacred Tooth Relic. This land carries hard evidence for that. It is a great responsibility of the nation to create a suitable environment for the location that suits our national heritage as well as the spirituality of this place.\nWe are grateful to the Ceylon Electricity Board for the formalization and rearrangement of the electricity systems in this place. And we will be thankful to the Lanka Transformers limited for the re-arrangement of the internal electrical system of this temple of tooth relic.\nIn 2012 when the country encountered a severe drought, we had the blessings and protection of sacred tooth relic. Not only have this place, but also we to protect all the religious places of the country. he said.\nThe Central Province Chief Minister Sarath Ekanayake , Diyawadana Nilame of the Sri Dalada Maligawa Nilanga Dela Bandara , Chairpersons of CEB , LECO and Petroleum Corporation , Secretary to the Ministry of Plan Implementation and the Commander of Sri Lanka Navy also attended the event.\n", 
  "title": "The ministry of power and energy has given a target to make Sri Lanka a nation self -sufficient in energy like it was achieved in paddy cultivation.", 
  "url": "http://powermin.gov.lk/english/?p=3764"
}