{
  "date": "25 May", 
  "text": "The ministry of power and energy together with the Presidents office declared an energy conservation month from 15th May to 15th June. The launch was held under Presidents Patronage with a 4 KM walk. This project was another step of that energy conservation program.\nYou are the people who are dedicated towards the national security and taking actions to ensure it. You are the people who fought the battle without thinking of your lives to re-gain the peace of the country. In this peaceful environment, you have a huge responsibility towards conservation of energy. Being a government entity and also being the SLArmy who have direct linkages to about three hundred thousand families you have a great job to be done.\nMain objective of this program is to raise some awareness on the conservation of energy and we expect you to become leaders and pioneers who are making efforts in implementing these practices in your establishments as well as at home.\nHow can we manage energy in our houses and offices? Here we are discussing some important techniques, tactics, ways and means of energy conservation which we can use to conserve energy. Not only the electricity, but also a large number of motor vehicles are being used by the Armed forces. Therefore, we are also expecting to save fuel from your day today activities.\nEnergy is usually physical in nature. If there is any change to be done in the real world context, what mainly required is energy. Energy is essential if we want to do something.There are different levels of energy. First well try to identify what the primary energy is? Primary energy can be used directly without any changes. As examples we can identify hydro power, solar power, wind power, energy of firewood, oil, coal and gas.\nWhen the primary energy is changed to the level which we can use for different applications, it is called secondary energy. Here we can take the exmple of electricity where we use it by turning on a switch. Ultimately, what is important for us is the services we are get out from it. We need to move vehicles, have to have light when it is dark, need to heat surroundings when it is cold and need to cool the environment when it is hot. Energy gets wasted when converting primary energy to secondary. Conservation of energy is the minimizing of this energy wastage.\nThe biggest complain against us is the high cost of electricity comparing with the other countries in the region. But we have a speciality where other countries dont have. That is being the single country in the region where electricity is provided round the clock. Ans also we provide electricity to industry at a concessionary rate.\nWhen considering the influence to the world economy from fossil fuel, it is about 80% which happen through oil, coal and gas. By the year 2045-2055 world will face a scarcity of oil, coal and gas resources. At present, fifty percent of our total import cost is for coal and oil imports. Therefore, to reduce this level we have to use energy strategically. To face this situation we have to use walking for shorter distances and have to use public transport as much as we can. We have to use our own vehicles for essential purposes only. When driving motor vehicles we have to keep the speed level at 60-80 kmph and have to keep the air pressure of tyres at the optimum level. Vehicke should not keep at the start mode when it is not necessary. Use correct lubricants for your vehicles. By properly maintaining your vehicles you can save fuel and contribute to conserve energy.\nThere are about 5.5 million households in Sri Lanka. If each household turned off a single light bulb which is not essential, we can save electricity which is sufficient to close down a power station. Reduce the usage of bulbs in between 6.30 PM to 9.30 PM. Try to turn-off at least one light bulb. Use a different time outside the peak power band 6.30 PM to 9.30 PM for ironing. Usually in households the highest number of units consumed for refrigiration. Place the refregirator where there is no direct sunlight. Minimize the time that keep the refrigirator door open. Repair if there is any leakage. Place windows enabling natural light to come in.Dont use old incandescent lamps for lighting. And also it can save a lot of energy by using energy efficient electrical utilities.\nIn an office the main demand for electricity is for air conditioning. Therefore the temperature should be keep at 26 degrees centigrade. Regarding oil and electricity consumption also a little saving from a single family cumulatively becomes a lage national saving. Providing quality fuel is also one solution for improving energy conservation.\nCeylon Electricity Board and Ceylon Petroleum Corporation are finding technological solutions by researches. Our main objective is to make the country self-sufficient from energy while directing the country towards green energy. When people are getting educated from this message like today, we expect that they will act towards saving energy he said.\nMinister of power and energy Mr. Patali Champika Ranawaka said at an occasion held to educate army officers on energy management at the defense service college auditorium on May 25th.\nLieutenant General A W J C De Silva commandar of the army, Mr.Padmasiri the director general of the sustainabele energy authority, Assistant director General Mr. Wimal Nadeera, Additional secretary to the ministry of power and energy Mr. Upali daranagama including senior officers of the Sri Lanka Army attended the programme.\n", 
  "title": "Minister of Power & Energy educates Army Officers on energy conservation", 
  "url": "http://powermin.gov.lk/english/?p=3781"
}