{
  "date": "04 Jun", 
  "text": "Eventhough you have studied different subjects, you must necessarily coincide with the innovation economy. It is the heritage of Asia. Every country that had been developed up to now turned to powerful nations because they had clearly realized the power of information technology. The future of the world, building through technologycal innovations. Therefore, we the people in this country must make this a super power. said the Minister of Power and Energy Mr.Patali Champika Ranawaka. He expresses these views today (03) participating at a certificate awarding ceremony for students those who have completed the final stage of the Institute of AAT, held at the Bandaranaike Memorial International Conference Hall.\nSpeaking further Minister Ranawaka said,\nWe all know how the human being is differentiating from other beasts. Out from about 80 million species, human is a different and a powerful creature. The main reason for that is the human creativity. Human being had made some innovations throughout the history of mankind including language, symbols, communication and accumulation of knowledge. Human beings were able to communicate the knowledge they gained generation to generation. Another innovation done by human is producing food through plants and trees. That is agriculture and through that people were able to create food as well as medicine. Another revolution of mankind is inventing energy. First he ruled the fire. With that innovation human being was able to mark a great breakthrough of energy.\nIt is reveled that average human needs 2060 kilo calories minimum for his daily living.Those who cannot afford to eat that amount is called the poor people. Sri Lanka has 6% poor families in this country. But in average, people enjoy 125 times of the life requirement. This amount is increasing without limitations. So we are facing an energy problem. There were no air-conditioned offices and houses in Sri Lanka before 20 years. But today, air conditionning has become essential. 40% of the electricity generated today, use for air conditionning\nIn early days, the knowledge was limited only to the males and also confined to developed industrial countries. But today, the limits have been expanded. Also today, our communication has become revolutionized. Storage of data and communication has been integrated and a massive development had occurred.At the same time the innovation economy has come forward. It is based on the information technology. he said.\n\n\n", 
  "title": "We must make country a skillful and a super power. That is the heritage of Asia", 
  "url": "http://powermin.gov.lk/english/?p=3797"
}