{
  "date": "08 Jun", 
  "text": "Most important ministry of Sri Lanka is the ministry of Environment none other Mr.Patali Champika Ranawaka, the minister of power and energy said at a function held at the Foundation Institute to mark theWorld Ocean Day-2015.\nSince 1970s there has been an enthusiasm in our country about the oil and gas resources situated in our ocean. From 1997 onwards many attempts were made to explore on those resources. Finally, experiments reveled that gas and oil deposits are available in the Mannar basin. At present, steps are being taking to make use of those resources.\nWe have already decided to convert all the power stations owned Ceylon Electricity Board which running through diesel and other liquid fuel to work through gas. Accordingly, our first target is to bring the gas found in Mannar to keravalapitiya.Then it is expected to distribute gas needed for Colombo city and utilixe it for the production of electricity.\nToday, the country has been stuck in middle of a debt mountain as our spendings were more. Some expenditure was more than three or four times due to some decisions taken in the last era. In the future the weight of debt will be fallen on our children. Money required for the country will be collecting through bond issues. To overcome this situation foreign indebtedness of the country and the economy has to manage properly. Otherwise there should be enough resources in the country to come out from this indebtedness. The only solution available today to overcome this situation is the utilization of unattended oil and gas resources in the ocean,Eventhough we received these resources in the near future, the country may not be developed as we expect. Nigeria become poor and Norway become rich after they found the oil resources in their countries. Therefore, we have to use these resources mindfully. The processes should be well acceptable both environmentally as well as socially. Accordingly, we need to get these oil and gas resources without damaging the environment and marine resources.\nIn the year 2008 we had a goal of demarking marine boundaries. According to the international marine Law the area of the sea which has silt of the country belongs to that particular country. In line with that law our country also got additional area from the sea and become a country 1/3 large as India. If we analysed the situation correctly our next generation will be getting the benefit of having an area 23 times larger than earlier. The new area we received along with a mountain of resources. He said.\n", 
  "title": "Now Sri Lanka is 23 times larger than it was before", 
  "url": "http://powermin.gov.lk/english/?p=3834"
}