{
  "date": "10 Jun", 
  "text": "This is the first time that all the institutions in the power and energy sector had come under a single roof. Accordingly, Electricity, renewable energy, petroleum, petroleum exploration, distribution and atomic energy had come under a single ministry. Our main objective is to develop the entire energy sector institutions into a collective synergistic mass. In the future it is expected implement a development plan to popularize and provide green energy for consumers at an affordable price. Minister of power and energy Mr.Patali Champika Ranawaka said.\nHe expressed this views at a Climate Change Forum on Favouring a green economy and sustainable urban development participating as the chief guest that was at Galle Face Hotel, Colombo on 10th June.\nIn the history we were used to deal with the environment in a very friendly and effective manner. As a tropical country we are getting sunlight throughout the year. Therefore, we need less energy compare with the countries in the polar region. Hence we must try our best to get the light, ventilation, heat and cold from the natural environment.\nAs the ministry of power and energy, our main objective is to work as an active institution and being working together as a team and also to contribute to the efficiency of the sector. Another main factor we have to improve is the provision of high quality service to the customers and thereby improving customer satisfaction.\nAt this time our attention had been focused on putting up charging stations to encourage the usage of electrical vehicles under the energy security policy and to develop infrastructure to electrify railway tracks. At the same time steps had been taken to introduce a pricing formula for the future based on accurate variables and indicators. Therefore, in the future a more transparent tariff structure will be able to introduce. He said.\n", 
  "title": "Development plan to provide green energy at an affordable price", 
  "url": "http://powermin.gov.lk/english/?p=3876"
}