{
  "date": "22 Jun", 
  "text": "Key public entities namely, Ceylon Petroleum Corporation, Ceylon Electricity Board, Port and the Airport should be administered through an independent commission and it is necessary to manage the country strategically to move forward the economy of the country,said minister of power and energy Mr. Patali Champika Ranawaka participating in the inaugural sessions of a workshop to draw up sound national policies. This program was held under the patronage of the President Maithripala Sirisena at the foundation institute Colombo on June 22.\nExpressing his ideas the minister mentioned that However the key institutions of the country such as CPC, CEB, Port and Airport should be administered through an independent commission, this proposal has not got the required support yet, The minister pointed out that step is necessary to carryforward the country economically.\nMinister of power and energy Mr.Ranawaka further said, in another ten years the Ceylon Electricity Board may technically become obselete. In the year 2002 there was a move to divide the Ceylon Electricity Board into six parts politically. By now Ceylon Electricity Board is on the brink of a critical situation both politically and technically.CEB could observe a customer churn in the segment of main electricity consumers in 2010. In certain countries the principal electricity network had reached a situation of extinction.\nIn future the CPC may not need electricity. Therefore, policies of a country should formulate in line with the technological revolution. In 1992, the growth of the labour force of the country was higher than the growth of the population. But now it is decreasing. Therefore at this time it is necessry to implement a re-structuring process to keep the economy active Ranawaka said.\n", 
  "title": "Ceylon Petroleum Corporation, Ceylon Electricity Board, Port and Airport should  be administered through an independent commission", 
  "url": "http://powermin.gov.lk/english/?p=3895"
}