{
  "date": "29 Jun", 
  "text": "We can be independent from energy in a day when the green energy becomes popular and the less weight had put on fossil fuels\nDr. Abdul Kalam, the former president of India emphasized the importance of working together as member countries of the SAARC region to move towards an energy independent region by the year 2030. He expressed these views delivering the inaugural address of the International Symposium on Energy Challenges in the knowledge based economy, organized by the ministry of power and energy.\nBy using fossil fuels, people emit more than 30 Giga Tons of Carbon Dioxide to the atmosphere per year. So it is difficult to estimate the damage that may cause by the fossil fuels to our earth and the atmosphere. The energy sector is highly influnced by politics. The SAARC countries which have a similar cultural background must get-together to change this trend towards the use of renewable energy sources. Then only the earth will become a healthy place for human being to live. Dr.Kalam Emphasized.\nFurther expressing his views Dr.Kalam said,\nWe can only find the energy independence from fossil fuels if we start reducing the use of fossil fuels and use more and more renewable energy. I suggest that SAARC countries should come forward gettogether and develop a 100 million Dollar fund to do research on green energy.\nIndia had been already launched two satellites into orbit to measure the changes taking place in the atmosphere. If both Sri Lanka and India jointly launch a new satellite, it will help both countries to help to continue the studies towards an establishment of green oceans and green nations.\nThe minister of power and energy Mr. Patali Champika Ranawaka addressing the gathering said,\nAs a country, Sri Lanka is ahead of other countries in the region in education, health, life expectancy and women empowerment. But still it is at a low status regarding the knowledge economy initiatives and innovations. Sri Lanka is in the 105th position in innovations out from 143 countries of the world. The greatest challenge ahead of us is energy sufficiency and how to avoid the middle income trap reaching a country of developed economy.\nWe must find our own approaches to achieve upper income country status. In its way forward we have to win four challenges.\nAt first, country should gain the economic success through a sustainable development process. Second one is the conservation of the environment by protecting the bio diversity. The next is to create a social equity without cast creed religion and social class. The last but not the least is the achievement of individual happiness. These four factors help to create social prosperity and economically balanced nation. He said.\n\n\n", 
  "title": "More than 20 percent of energy requirement of Sri Lanka will be extracted from Solar and Wind power", 
  "url": "http://powermin.gov.lk/english/?p=3945"
}