{
  "date": "09 Jul", 
  "text": "Freedom of a nation can be achieved only when the political freedom, economic freedom and the socio equality of the country maintained in the correct manner. I would say we are still very weak in that sense. We are proud to speak about the history of our country that had been built by our ancestors with blood, sweat and tears. But to speak about the future with the same proudness, we must built our present based on the spiritual power of our ancestors. The minister of power and energy Mr. Patali Champika Ranawaka said at the centenary of the Captain Edward Henry Pedris execution at the hands of the colonial administration during the 1915 Sinhala-Muslim riots in Ceylon. The commemoration was held at the Sri Lanka Foundation Institute.\nThe biography of Captain Henry Pedris which were written in both Sinhala and English languages were launched at this occasion.\nMinister Ranawaka noted that today, Sri Lanka has got a valuable opportunity to successfully move forward towards a developed future. When taking social indices the country is at a better position compare with the other countries of the world especially in the region. In our county the life expectancy of a person at the birth had reached to 80 years. We must be happy about it. It is an equal status of a 1st world nation. And also our literacy rate is at a higher level about 98 percent. It is the highest in our region. When consider the education it is higher than any country of our region. Today, the female ratio of the university had become 62 percent as Sri Lanka is one of the Buddhist countries. Developed countries like Australia, New Zealand, and Japan have not yet achieved that level.\nToday, our country had achieved infrastructure development. At present, there are 5.5 million families in the country. Ninety eight percent of those families are having electricity for their houses. Every family will get electricity by the end of this year. Earlier the electricity was a luxury which enjoyed by a limited number of families. Today, there is a telephone at every house. Every child knows how to use a computer. If the physical things are developing at this rate, we must also develop the political environment accordingly that suit for this situation. It should be a knowledge, honesty, justice and equality. Fulfilling that task is the best honor that we can offer to the national hero, Capt. Henry Pedris. We are having the potential of being the strongest and the super country of this region. Today we are having the opportunity of getting self sufficient from food, drugs, and the fuel. Today, we have found oil and gas deposits from the North Western province of this country. Those resources will help to make a leap in the future from its current position. He said.\n", 
  "title": "Freedom of a nation can be achieved when the political freedom, economic freedom and the socio equality of the country maintained  in the correct manner", 
  "url": "http://powermin.gov.lk/english/?p=3967"
}