{
  "date": "20 Oct", 
  "text": "An estimated cost of US$ 200 million\nPlans are underway to meet the growing demand for electricity and to improve the quality and reliability of the electricity supply in the Colombo Metropolitan Area. It is expected to minimise the power losses in transmission and distribution. The increase in efficiency of the National Grid will be achieved through the introduction of low-loss power transmission and distribution lines and construction of new substations.This project is initiated with the instructions of the minister of power and renewable energy Mr.Ranjith Siyambalapitiya.\nThe minister expressing his views on the project said that it is his duty as the subject minister to ensure the provision of a quality and uninterrupted electricity supply to the consumers. To meet this challenge it has to pay the attention not only to develop power generation but also to minimise the losses in transmission and distribution system of the electricity. said the Minister Siyambalapitiya.\nIt is estimated that the total cost would be US $ million200 for this project. Financial support for this project will be provided by Japan International Cooperation Agency  JICA. The project is expected to complete before the end of next year. When this project is implemented, the transmission and distribution losses would be minimal and through that a reliable and uninterrupted electricity supply could be provided to the cunsumers. the minister of power and renewable energy Mr. Ranjith Siyambalapitiya emphasized.\nSri Lanka is the only country in the South Asian region to offer an uninterrupted power supply from the national grid while all other countries in the region impose power cuts for a major part of every day. To maintain the status continuely in the future, the help of the customers is necessary and the minister request the public to contribute their fullest to the process of conserving power.\n", 
  "title": "A new project for Colombo to minimise the losses of Electricity transmission and distribution", 
  "url": "http://powermin.gov.lk/english/?p=4025"
}