{
  "date": "19 Oct", 
  "text": "Renewable energy authority is an important institution that comes under my ministrys purview. At the same time energy management is very important. When handling the responsibility of providing electricity to the consumers we face several challenges as a government. One is to provide uninterrupted and efficient energy supply at a low cost.\nAs an institution we must take measures to minimise the cost of handling electricity. Many people are discussing how much energy required for the country and how to generate that amount. Also as a government we are having the responsibility to ensure the provision of electricity to every household. We are usually discussing on putting up more and more new power stations. But through the proper management of electrical power also we can save a number of units. That will help to minimise the need to build new power stations. emphasized Attoney at Law Mr.Ajith P. Perera, the deputy minister of power and renewable energy.\nHe expressed these ideas at the ceremony of awarding certificates to the Energy Managers of SL Air Force. The function was held at Air Force Camp  Katunayake for those who had been appointed to conserve energy at Airforce camps. This event has been organized by the Renewable Energy Authority of Sri Lanka.\nDeputy Minister Mr.Ajith P. Perera further said,\nNow the war is over. But we still require the strength of the forces. While ensuring the security of the country it is your duty to maintain your environment to get the maximum contribution towards the country. Our duty is to prepare plans to achieve that goal. It is a good sign that you have come forward to achieve the target. This is another instance where your have showed your patriotism to the rest of the world. For every unit of electricity saved there is some saving for the country. With these savings the country is getting rich. That is some saving for your children for their future.\nIt is a victory of our ministry if we could minimize the power consmption of this largest camp of Sri Lanka. The main wastage of electricity is the usage of obsolete equipments and circuits. This course is important to identify such errortic citcuits also. From that we can go for energy management process which can get a higher result from a minimal cost. he said.\nThe commanding officer of the Air force camp- Katunayake Air Commodore Mr.Pathirana, Director General of the Renewable Energy Authority Mr. M.M.R. Padmasiri and many officials participated the occasion including power managers and senior officials of the airforce.\n\n\n", 
  "title": "Costs for new power stations can be minimize through power management", 
  "url": "http://powermin.gov.lk/english/?p=4042"
}