{
  "date": "27 Nov", 
  "text": "Within three months 405 cases of unlawful users of electricity.\nThe ministry of power and renewable energy emphasizes that the raids are being carrying out Island-wide by the Ceylon Electricity Board to nab culprits of electricity theft. These raid operations are conducting parallel with the process of elevating the CEB as the most prominent institute that provide efficient and quality services in the public sector in Sri Lanka with a concept of Mr. Ranjith Siyambalapitiya, the minister of power and renewable energy. The ministry reports that the process of identifying the suspects and raiding is very much successful.\nDuring the past three months (July, August and September) the special investigations unit of CEB had uncovered 405 incidents where electricity had been tapped fraudulently. The CEB had collected a total sum of Rs 38,398,390.54 through raids conducted during above 3 months alone and was able to collect Rs. 2,848,000 as court fines.\nMr. Ranjith Siyambalapitiya the minister of power and renewable energy said that, he considers that it is a basic responsibility of his ministerial portfolio to develop CEB as the most efficient institution in the public sector. To make it a reality he had introduced a process to achieve those objectives internally in CEB as well as externally.\nThe Minister of Power and Electricity, Ranjith Siyambalapitiya had instructed the officials to conduct more raids to nab the suspects who  are obtaining electricity through the illegal methods by way of altering the metres, using hooks etc., where the CEB incurs heavy financial losses through such acts of power piracy.The ministry requests the general public to inform such unlawful acts of power piracy of both domastic and industrial premises to the help line of  the CEB Call Centre by immediately dialing  the number 1987 short code or using Customer Service Hotline 011 2422259.\n", 
  "title": "Rs.3.8 Mn income per 3 months through raids", 
  "url": "http://powermin.gov.lk/english/?p=4202"
}