{
  "date": "01 Dec", 
  "text": "After the Russian revolution the Comrade Lenin who paid his attention on developing infrastructure, had instructed to provide electricity to every house as the first step.\nThe national ceremony marking the completion of the 287 electricity projects and grid extensions that vested in the public was held at Ruwanwella. The total costs of the projects were about Rs.826 Mn. It is expected to provide electricity to 6397 families by this programme records the ministry of electricity and renewable energy.\nThis is a time period that we have to face new challenges and our determination is to win those challenges as the ministry of power and energy. We could identify a segment where there are a lot of people fall into. They do not get the electricity connection to their houses eventhough the power lines are situated closer. There are another segment of people that dont have the grid electricity available closer to their vicinities. Altogether there are about 250,000 families belongs to both these catrgoties. The most important issue is that there are about 500,000 school children in these families. The main reason for not getting electricity is the poverty. We have taken this problem as a challenge for us and launched a special project. As a solution for that problem we have introduced them a consessionary loan scheme of Rs.40, 000 to get the electricity connection. The procedure is simple as it needs only the Grama Niladhari certificate of their place of residence. Our target is to provide electricity for those 250,000 households.\nThe most crucial infrastructure that affects the economic development of the country is the Electricity. Comrade Lenin ordered to provide electricity to all households after the Russian Revolution. As a country which suffered form a war for 30 years, we must be happy to have 98% electricity for the households of the country.  When the balance 2% have completed by the month of January 2016, the electrification of the country will reach 100%. he said.\n", 
  "title": "Newly completed Electricity projects and grid extensions 287 vested in the people", 
  "url": "http://powermin.gov.lk/english/?p=4214"
}