{
  "date": "04 Jan", 
  "text": "We are trying to develop the country in a national government framework between the UNF and the Sri Lanka Freedom Party (SLFP). We must make sacrifices to create good things ignoring political biases as we are working in a common political framework. We have to move forwards in this unfamiliar path which we dont have early experience. We are a nation who got the independence from the British rule in 1948 and continued our administration with divided politics. We did not gettogether even to achieve a common goal. Those days when people from the government laying foundation stones for public projects the opposition parties opposed it always. But now no one canoppose like earlier. We are now carrying forward these development activities as a collecticve responsibility of all of us. Today we are working collectively getting together at village, district and the country level. said Mr.Ranjith Siyambalapitiya the minister of power and renewable energy.\nHe made these comments participating at a foundation stone laying ceremony in the Kegalle district. The minister laid foundation stones to develop two roads with the financial assistance from the I road project of the Asian Development Bank. It is expected to develop two roads in the Deraniyagala Divisional Secrtary area. The Malibida-Magala road and the Dickwella-Digana road from Deraniyagala Hospital will be developed under this project.\nMinister Siyambalapitiya further said,\nMany people participated at the event including Mr. Kabir Hashim the general secretary of the United National Party, the Minister of Public Enterprises Development. Mr. Dushmantha Mithrapala the deputy minister of Justice and Buddha Shasana, Ms. Thusitha Wijemanne MP, Mr. Sujith Perera MP and Mr. Ranjith Polgampola, the UNP member of the provincial council.\n", 
  "title": "Today we are working collectively on a way forward getting together the village, district and the whole country", 
  "url": "http://powermin.gov.lk/english/?p=4245"
}