{
  "date": "09 Mar", 
  "text": "Generation of power is one of the main responsibilities of us. Generating power through renewable energy is a new responsibility. We are always trying to do new things. Net-metering system is a fairly new and a very important thing for us. Today, we are able to introduce this net metering system to Sri Lankan citizens. The system is getting popular among electricity consumers and the demand is growing. The business community in this sector introducing their net metering products in a very competitive manner. Sometimes the competitors create confusion among the customers and make them complex at the end. As a ministry we have a responsibility to protect the customers from this complexities and confusions by introducing some standards for the net- metering systems.\nIn our country the direct taxes on consumers are very less. According to per capita income of the country, the number of income tax payers should be around 1-1.2 million direct tax payers. But there are only 0.3 million direct tax payers. When considering the requirements of the society, providing more and more concessions is a matter. Government has to take decisions, considering and balancing all of the requirements. With that view point, we have identified the net-metering system as one of the areas we have to pay our attention. According to that concept, the day that every house becomes a power house is not too far said Mr. Ranjith Siyambalapitiya the minister of power and renewable energy.\nThe minister expressed his views participating at a conference organized to educate solar system providers with the objective of connecting one hundred thousand houses with solar panels to the national grid through the net-metering system. This conference was held at the Foundation Institute, Colombo. Mr. Ajith P. Perera the deputy minister of power and renewable energy also participated this occasion.\nWhen comparing the ministry of power and renewable energy with other ministries, our ministry provides a more sensitive service for the public. Today, people cannot live without the ministry of power and renewable energy. More than five hundred fifty households and business community are complaining even we failed to provide them electricity for few minutes. When the public is not too close and stay on silence, we can do our work more leisurely. But our ministry is different in that way as it is closely bind with people.\nThese days we are preparing power generation plans up to the year 2030, with the strong dedication of the deputy minister and employees. When preparing these plans we are leaning more towards low cost renewable electricity generation plans. We hope to give consessions to renewable energy producers who are producing electricity according to the standards.\nSenior officials of the ministry of Power and Renewable Energy, Ceylon Electricity Board, Lanka Electricity Company and Rewewable Energy Authority along with representatives of net- metering companies participated at the event.\n", 
  "title": "The day is not too far that every house becomes a power house", 
  "url": "http://powermin.gov.lk/english/?p=4287"
}