{
  "date": "02 Mar", 
  "text": "We consider the provision of electricity to the public as a social service. At present, electricity is an essential infrastructure facility. Gampaha is a developed district that more than 2.3 million people are living. There are about 0.6 million houses in the district. Out from these houses there were 4805 houses without electricity. Under the National Electrification programme Ratama Eliyai, Adura Duralai (A brighter country  banishing darkness) 1364 houses has been provided with Electricity. There are another 3441 houses that does not have electricity yet. Different reasons are there for not having electricity.\nEconomic, legal, attitudinal, social and physical matters are among them. We are trying to solve each and every such matter and provide them electricity with the objective of achieving 100% electrification level in the Gampaha District said Mr. Ranjith Siyambalapitiya the minister of power and sustainable energy.\nThe minister said that participating at the coordinating committee meeting in the Gampaha district that was held at the District secretariat office Gampaha.\nAt this moment we have provided electricity for 98% of the population in Sri Lanka. But still there are around 250,000 households without having electricity. This segment is a hidden group in the society. It is a low income class with extreme poverty. In most of these cases electricity is available closer to their homes. But they are unable to get the electricity to their homes due to cost. Ceylon Electricity Board has a huge responsibility on that. We have started a concessionary loan scheme to solve that economical matter. At the same time when providing electricity we have minimized the legal and physical barriers such as the requirement of scrutinizing the deeds and the requirement of the standard quality of the house. Our intention is to provide electricity for everyone and achieve 100% electrification by solving these matters. he said.\nThe state minister Ms. Sudarshani Fernandopulle, Deputy minister Mr. Dulip Wijesekara, Co-chairman of the district coordination committee Mr. Ajith Mannapperuma, Mr. Edward Gunasekara, Mr. Kavinda Jayawardena, District secretary of Gampaha, Provincial secretaries, Senior officials of the CEB and many state officials participated at the meeting.\n", 
  "title": "Everyone in the Gampaha District will get the access to electricity by the end of April", 
  "url": "http://powermin.gov.lk/english/?p=4296"
}