{
  "date": "08 Mar", 
  "text": "Some people might say that it is an easy task to provide electricity to the remaining 2% of the population who are not having electricity after completing 98%. But this balance 2% is the most difficult to provide with electricity. Among this balance group there are some people living for years without electricity even though the facility is readily available closer to their homes. But they are unable to get electricity for their houses due to various reasons. These reasons may be of economic, legal, attitudinal, social and physical. Now we are trying our best to provide them electricity to reach 100% electrification of the country by solving all these matters. Ceylon Electricity Board has a huge responsibility in fulfilling this task. Some people are undermining the service of CEB very much. But the CEB is having the pride of providing electricity round the clock to the general public. It is the sole institution of the South Asia having that honour. said Mr. Ranjith Siyambalapitiya the minister of power and renewable energy.\nThe minister expressed his views participating at the opening ceremony of a grid electricity substation at Mahawa under the program Ratama Eliyai, Adura Duralai (A brighter country  banishing darkness)\nMinister Siyambalapitiya further expressing his views..,\nCEB has to face huge obstacles in generating transmission and distributing of electricity. We are moving forward facing those obstacles. Electricity is a basic utility and infrastructure requirement which is needed by every citizen today. When electricity fails even for a moment, people feel it very much as they are highly sensitive on the availability of electricity. Many things in the country had changed by now. The country is moving forward with peace and consensus. Well try to make Sri Lanka a developed country by utilizing that change. For that purpose the electricity is essential. I am happy to declare open this newly built grid substation in the fast developing North Western province.\nMr. T.B Ekanayake, the state minister of lands, Dr. Suren Batagoda, the secretary to the ministry, Mr. Anura Wijepala, the chairman of the CEB and political authority and people of the area participated this occasion.\n", 
  "title": "CEB is in the process of fulfilling the requirements of public", 
  "url": "http://powermin.gov.lk/english/?p=4315"
}