{
  "date": "29 Dec", 
  "text": "We have introduced three methods under the scheme battle for solar energy. They are namely, Net metering, Net Accounting and Net plus. The Net plus scheme was introduced targeting less income people. The speciality of this scheme is providing electricity at a lesser tariff to low income people.\nHon. President had declared this year as the year of eliminating poverty. Therefore we are ready to introduce a method to provide solar cells at a lower cost to less income people. That will help them to reduce their monthly electricity bill and to get an additional income. We are planning to launch this net plus scheme in Elarera-Bakamoona area with the commemoration of Presidents\n2nd year in office. said Mr. Ranjith Siyambalapitiya the minister of power and renewable energy.\nHe expressed this at a special meeting held at the ministry of power and renewable energy regarding the establishment of solar energy villages.\nFurther expressing his views minister Siyambalapitiya said,\nThe cost of a unit of electricity generates under net plus scheme is at a rate of Rs. 4.50. But when we are purchaseing a unit from them we pay Rs. 22 on average. Eventhough there is such a benefit, those less income people are not coming forward to get this benefit. Their involvement to this scheme is at a very low level. The main reason is their mentality. That mentality wont allow them to think about this benefit. They are more concern of fulfilling their primary needs than joining this scheme.Therefore, I request from the companies which are providing solar panels to fix these panels on their roofs enabling them to cover their electricity bill and to have an additional income. Companies have to plan a method to cover the cost of the solar panels in a fixed number of years he said.\nDr. Suren Batagoda, the secretary to the ministry of power and renewable energy, senior officials of sustainable energy authority and agents from several private solar panel companies participated at the meeting.\n", 
  "title": "Solar panels will be provided at a concession to people with less income", 
  "url": "http://powermin.gov.lk/english/?p=4522"
}