{
  "date": "01 Jan", 
  "text": "Ministry of power and renewable energy is a very much influential entity that rendering a great service to the society through its affiliated organizations. Alleviation of Poverty is the theme of president this year which is also shared by the Ministry of power and renewable energy. Last year we have provided a great service to the society. We supplies electricity to about 265,000 residents who had no electricity even they had closer access to the electricity distribution network. It happened due to their poverty.\nWe expect to mark 100% electrification in Sri Lanka with the second anniversary of the president Maithripala Sirisena in office, by providing electricity to Lankagama a remote village. We faced many challenges in the year 2016. Also in the year 2017 too there are many challenges to overcome. I believe the staff of our ministry work with consensus, discussion and agreement. Therefore we can face any challenge and win. We have that confidence. Therefore the ministry of power and renewable energy is not afraid of facing challenges said Mr. Ranjith Siyambalapitiya the minister of power and renewable energy. He said that participating at the ceremony of resuming duties for the New Year, by taking state service oath.\nMinister Siyambalapitiya further said,\nProvision of electricity to houses is a main requirement to alleviate poverty. Many countries of the world used this element to move the country towards development in a short time. We are ready to launch many special projects during the year 2017. Special tariff system has been introduced to agriculture farming community to elevate from self-sufficiency to commercial level. We also started a massive project to convert one million roofs to solar power stations. Through that project we mainly focused on less income electricity consumers. Therefore we believe that our ministry is fulfilling its obligations towards the society.\nAs employees of the state sector, we have a huge responsibility on our shoulder. When comparing to twenty million population of Sri Lanka, state employees are a segment that enjoy some special benefits. As a whole when comparing the income level, knowledge and social status, the state employees are in an upper position providing leadership to the nation and enjoying some benefits. Therefore, we have a great responsibility on our shoulders to develop this nation. All employees of this ministry were able to be a part of the merit of providing electricity for five hundred thousand people who had studied using kerosine oil lamps and we have to continue our dedication to build the nation also in the year 2017.\n", 
  "title": "Ministry of power and renewable energy never afraid of challenges", 
  "url": "http://powermin.gov.lk/english/?p=4546"
}