{
  "date": "15 Jan", 
  "text": "We are ready to build solar power plants on roofs under the program Battle for solar energy through climate fund that is initiated to build a new low-carbon business economy and low carbon life patterns. Under this scheme, electricity bill will be free for 5 years and the owner will be able to get some pocket money too. After first five years, people will be able to get a big sum of money up to 20 years. By that time the cost of solar panels would have been set off.\nWe started this project with the patronage of Hon. President at Puwakgaha Ulpatha area in Bakamoona. Now people can fix solar panels on their roofs without any initial payment. Only an area of 40 Sq. feet will be required on the roof to fix these panels said Mr. Ranjith Siyambalpitiya the minister of power and renewable energy.\nThe minister said that participating at a foundation stone laying ceremony for the proposed new customer service centre for the Area Electrical Engineer  Ruwanwella with a cost of Rs.37 Million.\nMinister Siyambalapitiya further said,\nAt present, we are facing a severe drought. The department of meteorology forecasts the weather condition would prevail for another 5-6 months. It is the most severe drought we are facing after the year 2006. We have a big challenge to provide electricity for people without any interruption. Now we have only 36% of water level in reservoirs. Accordingly we have to use diesel or coal as an alternative energy source. But we cannot pass this cost to the public. We have already educated the cabinet regarding this and a sub-committee was appointed by the President. Now the electricity problem and the solutions to implement have been forwarded to the committee. The government had agreed to support us in this matter. We request from the general public also to support at this moment to save 25 Mega Watts of electricity. A circular will be issued on using air-conditioners by maintaining temperature at 26C. To encourage the public to save electricity, we are planning to offer incentives such as Viduli Wasana program.\n", 
  "title": "A circular to maintain temperature of air conditioners at 26C", 
  "url": "http://powermin.gov.lk/english/?p=4550"
}