{
  "date": "15 Feb", 
  "text": "An opportunity to medium scale investors to generate solar electricity at a competitive price.\nThis is a new message for potential investors and a challenging decision for us. It is not an easy task. But we took that decision. This is a turning point of the history of buying electricity from private sector. The total benefit of this decision effect about six million household electricity users. We took this decision for them. The ultimate result as we think will be the minimization of the electricity bill. This is another stage of this 60MW Battle for solar energy that we implemented for the benefit of the entrepreneurs. We would like to openly invite all Sri Lankans to be electricity producers abide to the CEB regulation of buying only 1 MW from each. Especially medium scale electricity producers will be able to come up with solar electricity producers without making any influence. Well provide the opportunity for them. said Mr. Ranjith Siyambalapitiya the minister of power and renewable energy.\nMinister said that participating at the ceremony of opening the project office at Chunnakam for the proposed wind power plant. This wind power project consists of two wind power plants with 10 MW each. It will start on 2017 and expected to complete by 2018. After completion these two plants they will be called Vayushakthi Vittanar and Yal Vayu pavan. These two plants will be able to produce 63MW of electricity on the annual basis and the plant will be installed at Chavakachcheri. Mr. Ajith P. Perera, the deputy minister of power and renewable energy along with senior officials of the ministry and Ceylon Electricity Board participated at this occasion.\nMinister Siyambalapitiya further added,\nWe are moving at a faster rate to grow our sustainable energy sector. We need to spend every second on this. Myself together with my deputy minister especially prime minister and the president are making efforts to develop sustainable energy. Buying electricity from private produces is practice that had been carried out from a long time. Every government in the recent past approved it. We usually bought electricity by sitting together and at a price that everyone agreed upon. This is the first time we started buying electricity through an open competition. This is historical. We were able to buy a unit of electricity produced by wind energy at a cost of Rs.12.29. Before that no company had been agreed to sell electricity at this price. I expect to complete this project within one year and to provide electricity for about 40,000 houses.\n", 
  "title": "An opportunity for medium scale investors to generate solar electricity at a competitive price", 
  "url": "http://powermin.gov.lk/english/?p=4574"
}