{
  "date": "13 Feb", 
  "text": " Ready to introduce as a self employment for home gardens\n Started cultivating 2000 Hectares.\n 50% of the energy need of the country can be fulfilled by bio mass without any environmental damage.\nThe use of biomass fuel (woody fuels fuel from firewood) is the main contributor that cater the demand of energy in Sri Lanka. The woody fuel is a low cost energy source and it creates minimum damage to environment. But usage of this fuel is not formally organized yet.\nAt present, a considerable amount of foreign currency is spent annually on coal and other fossil fuel. It is 40% of our imports expenditure. Therefore we have to divert gradually to other energy sources. From this project that we start today, initial steps will be taken to cultivate Giniseeriya (Glinicidia Cepium) in 2000 hectares. Then we hope to establish collection centers island-wide to collect these Giniseeriya (Glinicidia Cepium) stumps at a required quality. People of our country can expand this program as a self-employment. In home gardens the Giniseeriya trunk can be used as a support for peper creepers and the leaves can be used as a fertilizer while the branches can be given to the collection centers to get an extra income. We started this national program with the leadership of Hon. President Maithripala Sirisena who is also a nature lover.\nTherefore general public must improve the knowledge on this regard and join this program to make a success.\nThe minister said that participating at the Giniseeriya cultivation program at the forest conservation office Eppavala. The foundation stone laying ceremony for firewood collection centre was held at Muvangama, Mawathagama in Kurunegala area. This is implementing as a joint project of Sri Lanka Sustainable Energy Authority, United Nation Food and Agriculture Organization and the ministry of power and renewable energy.\n", 
  "title": "National program to use Giniseeriya as a fuel has started", 
  "url": "http://powermin.gov.lk/english/?p=4577"
}