{
  "date": "16 Sep", 
  "text": "Today, few of our brothers in Ceylon Electricity Board are striking. They had charged many allegations. Putting full-stop to fraud and misappropriation in Ceylon Electricity Board is one of them. In fact, I can tell our brothers with a responsibility that my term is the era where fraud and misappropriation in CEB have come down. We are procuring everything through competitive bids. We are doing so is to reduce frauds, and that is our aim. For example: in an urgent situation, if minister wants, he has authority to purchase electricity first and later can inform it to the Cabinet of Ministers. However, all the times what I have done is that I took steps to purchase electricity through calling bids internationally. So far, we have purchased solar power and wind power at competitive price and thereby we have reduced their price from Rs.23.00 up to Rs.12.00 and Rs.11.00 respectively. There may be problems. We have to find solutions for them. But, I can tell with a responsibility that my term is the era where fraud and misappropriation in CEB have come down.\nThe second allegation is the matter that the money of the Employees Provident Fund was misused. I took action in this regard. This had taken place during 2008  2009. I initiated inquires based on the first information I received. The Criminal Investigation Department carried out inquiries. A criminal case also was filed. Not only that but also an inquiry was conducted in the ministry, and an internal audit inquiry too was held. Apart from these, a civil case also was filed. Central Bank of Sri Lanka has already agreed to return part of that money to us. If we receive that half of money, we have option to get the rest of it by having discussion or even by filing a case. In my era only, actions were taken to get that money back and bring culprits before the law.\nThird is the increase of electricity bill which they talk about. This is the era where Ceylon Electricity Board faced a lot of financial crisis. It happened not with any ones fault. We should have increased the electricity bill in that time, but we have passed it. There are climate changes which we are facing very often. We have experienced an acute drought after 30 years. As a country providing 100% electricity, that is why we estimated at the beginning of this year that an additional cost would incur for fuels in order to maintain continuous power supply without hindrance. I informed this to the Cabinet of Ministers and explained that we never need to increase the electricity bill as an alternative remedy.\nCabinet of Ministers has accepted this as a risk management fund. Both His Excellency the President and the Hon. Prime Minister extended their support to receive additional funds from the Treasury to cover this sort of additional cost. 6 billion rupees has already been provided by the Treasury. Therefore, we have passed the time when we wanted to increase the electricity bill. This is the first time where cost incurred without receiving funds from the Treasury and without putting burden on the public.\nNext matter is the issue to stop the service of NVQ employees in Ceylon Electricity Board which is spoken by them now. There were about 7000 employees who had not been absorbed into permanent service. They have now been absorbed into permanent cadre. Now, NVQ employees are recruited as trainees. Now they have a good opportunity to join the permanent service of Ceylon Electricity Board with their technical knowledge given to them to ensure quality and profession of Ceylon Electricity Board, and they can get into permanent cadre by submitting their certificates at the time of their appointments.\nOther important issue is the salary anomalies which are spoken by them. This happened in 2014, and now they are talking about it. This is a very complicated issue. Because, one group says that salary should not be increased in any way as a remedy to solve such salary irregularities. Other group says no that their salary should be increase. Two groups are with different views and dragging each other. We had negotiations with all these groups. We appointed a committee under the Secretary to the Ministry. We gave opportunity to every trade union to have discussion on their issues in a very appropriate democratic way of finding solutions, and to implement the decision to be given by that of committee. In this favorable environment, they unfortunately initiated strike.\nWe have a responsibility. We have provided 5.5 millions of people with electricity. It is our responsibility to protect the needs of all those people. I kindly appeal all these brothers to protect the good name of CEB. Please report to work. We are always prepared to find solutions through negotiations. People have recognized us as a group who takes decision based on negotiations. Therefore, we do not allow any inconvenient to cause even single consumer of this country. Please see every problem in a practical way. Two groups are in two sides and blindly talking. Then, how can we reach a neutral decision. It is difficult. So, I appeal all be cooperating and helpful to find a good solution for this matter in dispute.\n", 
  "title": "Report to work forthwith without putting the public in trouble.  Minister of Power and Renewable Energy Hon. Ranjith Siyambalapitiya asks from the CEB employees who involved in strike.", 
  "url": "http://powermin.gov.lk/english/?p=4710"
}