{
  "date": "09 Jun", 
  "text": "Nowadays, an arid condition is prevailing and therefore, a conference on creation of artificial rain in Sri Lanka with the technical assistance of Thailand in order to maintain a continuous hydro power generation by breaking all the barriers coming due to such a dry situation was held in Colombo Kingsbury Hotel in last couple of days with the participation of the Minister of Power and Renewable Energy Hon. Ranjith Siyambalapitiya.\nThe Minister, Ranjith Siyambalapitiya who expressed his view\nOut of total power generation in our country, over 40% of electricity is generated from hydropower and which is a matter on which we should be proud of. Since the cost for our power generation is shared through several means, we can be able to generate electricity with a least cost in a more efficient environment friendly manner. However, a trend of difference in receipt of rain being prevailing for many years has become a big issue. For many years, monsoon rain did not experience properly and therefore in 2016, the overall capacity of power generation in our country had declined up to 26%. Due to this nature of reasons, even in last 1950s Sri Lanka had initiated to create an artificial rain with the technical assistance of Thailand which is the only country in the world who has the patron rights certificate. If this facility initiated, thereby three areas like hydropower generation, agriculture and drinking water would reach special benefits he further added.\nThailand Ambassador His Excellency Chulamanee Chartsuwar and including special delegates were participated in this conference. Many experts and technical experts from Department of Metrology, Ministry of Mahaweli, Sri Lanka Air-Force, Department of Irrigation etc. in Sri Lanka participated in this conference with a view to gain technical knowledge on creation of artificial rain. The Secretary to the Ministry of Power and Renewable Energy, Dr. B.M.S. Battagoda and including many others expressed their views in this conference.\n", 
  "title": "Solutions for scarcity of electricity through Artificial Rain", 
  "url": "http://powermin.gov.lk/english/?p=4909"
}