{
  "date": "15 Mar", 
  "text": "His Excellency Yukiya Amano, the Director General of International Atomic Energy Agency had arrived in Sri Lanka yesterday (14) for an official visit on the invitation of the Government of Democratic Socialistic Republic of Sri Lanka with a view of expanding atomic energy technology through technical assistance of International Atomic Energy Agency in order to successfully achieve the future development goal of Sri Lanka.\nThe said Director General accompanied today (15) with the surveillance visit towards the premises of new office of Atomic Energy Board on the invitation of Hon. Ranjith Siyambalapitiya, the Minister of Power and Renewable Energy and his participation.\nSo far, Sri Lanka has achieved a commendable winning goal by moving towards use of atomic energy technology through the assistance of International Atomic Energy Agency. Atomic Medical Unit operated under University of Peradeniya, Sri Lanka Gama Center and National Center for Non-Destructive Test etc. which give valuable service to the people are shining among others. Further opportunities are provided through International Atomic Energy Agency at universal level to participate at foreign trainings, conference etc. in order to develop the knowledge and the skills of Sri Lanka scientist, doctors, engineers and physical doctors. .\nFurthermore, a large number of scientific instrument and machineries with valuable technology have been received by Sri Lanka from International Atomic Energy Agency. Here what the specialty is that certain such instrument is not available at local market for purchase.\nThis work plan of technology is a key mechanism through which enhances the potential atomic energy technology in member countries of International Atomic Energy Agency. Through this program, human resources and physical resources are developed in order to achieve main objectives of member countries. This atomic energy technology is used in its peaceful application to enhance peoples health and nutritional condition, and for food and agricultural projects, water resources and their management, and improvement of fields of environment and industry.\nThis International Atomic Energy Agency was established in 1957. This is a join institution of the United Nations. This is an independent body functioning with dedication towards the high improvement of science and technology on the affairs which are universally and diplomatically handled. Further, this Agency as a Universal Center helps its member countries to achieve their social and economic goals. Power generation from atomic energy and use of atomic energy technology to achieve self-sufficient goal of this technology and that of knowledge is taking a prominent place among the programs initiated through peaceful application of atomic energy technology and atomic science. As Sri Lanka is a one of the staring member countries of this International Atomic Energy Agency, it has received considerable assistance and benefit from such Agency for progressive journey of its atomic science and atomic energy technology through the work plan of technological cooperation of such agency being implemented from 1957.\nHis Excellency Yukiya Amano is to visit Sri Lanka Gama Center and National Center for Non-Destructive Test affiliated to Sri Lanka Energy Atomic Board during his official visit to Sri Lanka. Yukiya Amano, the Director General of International Atomic Energy Agency also will be visiting Atomic Energy Regulatory Authority of Sri Lanka.\n", 
  "title": "Seeking Assistance from International Atomic Energy Agency in order to successfully achieve the Future Development Goal of Sri Lanka. Official Visit to Sri Lanka by Yukiya Amano, the Director General of International Atomic Energy Agency (IAEA).", 
  "url": "http://powermin.gov.lk/english/?p=4922"
}