{
  "date": "20 Mar", 
  "text": "Bringing a good message into the society is a very hard struggle. Wimalasurendra at his time worked a lot to bring this good concept of hydropower generation and hydropower electricity into the society. Wimalasurendra prepared many plans and submitted, but then white people did not accept such plans. Finally, Wimalasurendra went to Parliament through election, and he established his hydropower station. Sooriyabala Sangramaya is also that of one. Then Wimalasurendra being in Parliament made his effort of hydropower generation succeeded. However, today even I being in Parliament implement such a policy, succeeding is a very difficult task the Minister of Power and Renewable Energy said.\nThe Minister gave this statement while he was attending an event of distribution of solar power packages to Yattiyantota Divisional Secretariat Office of Kegalle District held in last couple of days.\nThe Minister further stated that.,\nIf we generate one unit of electricity from gas we have to spend more than Rs.40.00. However, such unit of electricity can be generated from hydropower at a mere rate of Rs.4.00. Power generation from gas will bring many environmental consequences. Today, we have reached maximum level in hydropower generation. By now, all the reservoirs for hydropower generation are in ending stage. Once Broadland Reservoir, Morogolla Reservoir and Seethawakka Power Project are completed, all reservoirs used for hydropower generation will come to end. Small Hydropower stations have also been established and completed. At the time of construction of Broadland Reservoir a big issue appeared saying that water rafting might have been affected. However, it has been able to control such water rafting better than earlier. With that example, when a merit task is undertaken, we all have to work with good understanding, and be helpful to bring such merit to the community. I hope you all would cooperate and achieve the merit together. Therefore, I implore that strength and courage should come to us to carry out such task.\nSenior officials of Ceylon Electricity Board including politicians from the area, and as well as a big crowed of people from that area participated at this event.\n", 
  "title": "Make Consumers and whole Society benefited at large through Sooriyabala Sangramaya as Wimalasurendra then introduced the hydropower concept into Society", 
  "url": "http://powermin.gov.lk/english/?p=4931"
}