[
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "“Bringing a good message into the society is a very hard struggle. Wimalasurendra at his time worked a lot to bring this good concept of hydropower generation and hydropower electricity into the society. Wimalasurendra prepared many plans and submitted, but then white people did not accept such plans. Finally, Wimalasurendra went to Parliament through election, and he established his hydropower station. Sooriyabala Sangramaya is also that of one. Then Wimalasurendra being in Parliament made his effort of hydropower generation succeeded. However, today even I being in Parliament implement such a policy, succeeding is a very difficult task” the Minister of Power and Renewable Energy said.", "The Minister gave this statement while he was attending an event of distribution of solar power packages to Yattiyantota Divisional Secretariat Office of Kegalle District held in last couple of days.", "The Minister further stated that….,", "“If we generate one unit of electricity from gas we have to spend more than Rs.40.00. However, such unit of electricity can be generated from hydropower at a mere rate of Rs.4.00. Power generation from gas will bring many environmental consequences. Today, we have reached maximum level in hydropower generation. By now, all the reservoirs for hydropower generation are in ending stage. Once Broadland Reservoir, Morogolla Reservoir and Seethawakka Power Project are completed, all reservoirs used for hydropower generation will come to end. Small Hydropower stations have also been established and completed. At the time of construction of Broadland Reservoir a big issue appeared saying that water rafting might have been affected. However, it has been able to control such water rafting better than earlier.  With that example, when a merit task is undertaken, we all have to work with good understanding, and be helpful to bring such merit to the community. I hope you all would cooperate and achieve the merit together. Therefore, I implore that strength and courage should come to us to carry out such task”.", "Senior officials of Ceylon Electricity Board including politicians from the area, and as well as a big crowed of people from that area participated at this event."]},
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "“Power generation through solar power is very useful to country and environment and even to people individually. Making one million of house premises as power producing units through solar power system is the main aim of us. This concept of power generation though solar power is the best and the foremost useful concept. However, people are not thinking much about this. One matter generally attracted would not take much time to get socialized. But, unfortunately useless petty things are quickly getting into socialization. However, making this type of concept into socialization is a very hard struggle. Therefore, steps will be taken to make each and every house enabling to become as power generating unit and as well as to make the people aware through provision of solar power packages to all places of worship and in particular to government institutions. Today, we have provided all Divisional Secretariat Offices in District of Kegalle with solar power packages. From today onwards, the electricity bills of these offices would become zero, not only that but also all houses in Sri Lanka become rapidly as power generating units by bringing the concept of generation of solar power even among the staff working in such offices” the Minister of Power and Renewable Energy, Hon. Ranjith Siyambalapitiya, pointed out.", "\nThe Minister, who participated at the event of distribution of the said solar power packages to all Divisional Secretariat Offices in Kegalle District which took place in last couple of days, stated this.", "\nThe Minister, Ranjith Siyambalapitiya further expressed his views as follows:", "\n“Today, we are making a valuable concept known as Sooriyabala Sangramaya into socialization.  40% of electricity in our country is coming from hydropower.  However, an up and down condition has been in rainfall for 03 years and amidst we would take initiatives to create artificial rains for water catchment areas. Thailand is the only country which has patron rights certificate to create such artificial rains. From 1950s, the artificial rain system has been in practice in that country. This artificial rain system which does not allow the clouds in the sky to disappear would be helpful to make rains in any wanted places for us. ‘Sooriyabala Sangramaya’ is also that of activity. We have started this Sooriyabala Sangramaya Scheme to generate electricity from each solar x-ray in order to get maximum use out of solar power source. Ceylon Electricity Board has agreed to pay a Rs. 22.00 for a unit of electricity generated at a house through this solar power system. This is a good amount of payment. If this price of offer is given to private sector electricity producers, such parties will be in line”."]},
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "Nowadays, an arid condition is prevailing and therefore, a conference on creation of artificial rain in Sri Lanka with the technical assistance of Thailand in order to maintain a continuous hydro power generation by breaking all the barriers coming due to such a dry situation was held in Colombo Kingsbury Hotel in last couple of days with the participation of the Minister of Power and Renewable Energy Hon. Ranjith Siyambalapitiya.", "The Minister, Ranjith Siyambalapitiya who expressed his view……", "“Out of total power generation in our country, over 40% of electricity is generated from hydropower and which is a matter on which we should be proud of.  Since the cost for our power generation is shared through several means, we can be able to generate electricity with a least cost in a more efficient environment friendly manner. However, a trend of difference in receipt of rain being prevailing for many years has become a big issue. For many years, monsoon rain did not experience properly and therefore in 2016, the overall capacity of power generation in our country had declined up to 26%. Due to this nature of reasons, even in last 1950s Sri Lanka had initiated to create an artificial rain with the technical assistance of Thailand which is the only country in the world who has the patron rights certificate. If this facility initiated, thereby three areas like hydropower generation, agriculture and drinking water would reach special benefits” he further added.", "Thailand Ambassador His Excellency Chulamanee Chartsuwar and including special delegates were participated in this conference. Many experts and technical experts from Department of Metrology, Ministry of Mahaweli, Sri Lanka Air-Force, Department of Irrigation etc. in Sri Lanka participated in this conference with a view to gain technical knowledge on creation of artificial rain. The Secretary to the Ministry of Power and Renewable Energy, Dr. B.M.S. Battagoda and including many others expressed their views in this conference."]},
{"name": ["Posted by ", " in ", "Official Discussion held with Ranjith Siyambalapitiya, the Minister In-Charge of the Subject", "His Excellency Yukiya Amano, the Director General of International Atomic Energy Agency had arrived in Sri Lanka yesterday (14) for an official visit on the invitation of the Government of Democratic Socialistic Republic of Sri Lanka with a view of expanding atomic energy technology through technical assistance of International Atomic Energy Agency in order to successfully achieve the future development goal of Sri Lanka.", "The said Director General accompanied today (15) with the surveillance visit towards the premises of new office of Atomic Energy Board on the invitation of Hon. Ranjith Siyambalapitiya, the Minister of Power and Renewable Energy and his participation.", "So far, Sri Lanka has achieved a commendable winning goal by moving towards use of atomic energy technology through the assistance of International Atomic Energy Agency. Atomic Medical Unit operated under University of Peradeniya, Sri Lanka Gama Center and National Center for Non-Destructive Test etc. which give valuable service to the people are shining among others. Further opportunities are provided through International Atomic Energy Agency at universal level to participate at foreign trainings, conference etc. in order to develop the knowledge and the skills of Sri Lanka scientist, doctors, engineers and physical doctors.         .", "Furthermore, a large number of scientific instrument and machineries with valuable technology have been received by Sri Lanka from International Atomic Energy Agency. Here what the specialty is that certain such instrument is not available at local market for purchase.", "This work plan of technology is a key mechanism through which enhances the potential atomic energy technology in member countries of International Atomic Energy Agency. Through this program, human resources and physical resources are developed in order to achieve main objectives of member countries. This atomic energy technology is used in its peaceful application to enhance people’s health and nutritional condition, and for food and agricultural projects, water resources and their management, and improvement of fields of environment and industry.", "This International Atomic Energy Agency was established in 1957. This is a join institution of the United Nations. This is an independent body functioning with dedication towards the high improvement of science and technology on the affairs which are universally and diplomatically handled. Further, this Agency as a Universal Center helps its member countries to achieve their social and economic goals. Power generation from atomic energy and use of atomic energy technology to achieve self-sufficient goal of this technology and that of knowledge is taking a prominent place among the programs initiated through peaceful application of atomic energy technology and atomic science. As Sri Lanka is a one of the staring member countries of this International Atomic Energy Agency, it has received considerable assistance and benefit from such Agency for progressive journey of its atomic science and atomic energy technology through the work plan of technological cooperation of such agency being implemented from 1957.", "His Excellency Yukiya Amano is to visit Sri Lanka Gama Center and National Center for Non-Destructive Test affiliated to Sri Lanka Energy Atomic Board during his official visit to Sri Lanka. Yukiya Amano, the Director General of International Atomic Energy Agency also will be visiting Atomic Energy Regulatory Authority of Sri Lanka."]},
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "“So far, Sustainable Energy Authority is being maintained in the third party’s buildings. This Authority is to be shifted to a permanent building and thereby its functions will be regularized. This building is a special structure. Sustainable Energy Authority will move to an environment friendly constructed building. This is an environment friendly structure. Sustainable Energy Authority is prepared to use every solar x-ray and every drop of water without wasting. That is very important. People have kept faith on this Authority. Therefore, Sustainable Energy Authority should function as a role player in a manner where such faith kept by people upon the Authority is protected. Further, there is a special feature that is that, today is the first event where the State Minister of Power and Energy, Hon. Ajith Perera participates after his promotion into his new portfolio. He will be blessed by everyone at this moment”, the Minister of Power and Renewable Energy, Hon. Ranjith Siyambalapitiya said.", "The Minister pointed out this while he was attending the event of laying foundation stone to the environment friendly building which is proposed to construct for Sustainable Energy Authority. It has been estimated that this new building will be constructed at the cost of 550 million rupees.", "Further, Minister Ranjith Siyambalapitiya stated….", "“I find the Sustainable Energy Authority Act as a very constructive Act among the other existing laws in Sri Lanka. I have not come across to such a constructive and comprehensive Act. Provisions are available in this said Act to undertake many things related to this sector and its progress. I implore for blessing to have many creative activities being at this building. Most of the time, if we start a work to do that would take a long and long period of time to complete it.  However, what is a special feature regarding this building is such building was being able to complete within a short period of particular time. Hence, it has been scheduled to complete construction work of this building by the month of December of this year”"]},
{"name": ["Posted by ", " in ", "“Today, we nationally inaugurated the wind power initiative. What we now doing is what we had to do many decades ago, and that is why we are naming national tasks what we start as Sangramaya, initiative etc. As the time has lapsed, we have to get together and undertake these things based on Sangramaya rapidly. Now, attention has been turned on renewable energy generation in Sri Lanka. Water, solar and wind can be mentioned as major source which are used for this purpose. Today, we have used water at maximum level to generate electricity. Practice of generating electricity form solar power is rapidly spreading throughout the Island, and in the meantime, we have started this wind power initiative. Generating 30% of electricity from renewable energy in Sri Lanka by 2020 is our target. We have to increase that level up to 50% by 2030. Therefore, I hope this wind power initiative would be supported at large” said Hon. Ranjith Siyambalapitiya, the Minister of Power and Renewable Energy.", "The Minister said this while he was attending the national inauguration of Wind Power Park at Berakanda of Ambantota.", "The Minister, Ranjith Siyambalapitiya in his further view expressed..,", "“Our country is an Island. As our country is covered by seas, plenty of wind is available for us. From today, people can make their contribution towards wind power generation under the same conditions of Sooriyabala Sangramaya. We are inviting the public to take part in this task much. We will encourage our manufacturers to produce necessary turbines within this country. Another feature is the one that the Berakanda Solar Park existed so far is going to change as a renewable energy park from today onwards. This can be made as a knowledge developing and research park for our children and elders” the Minister said.", "Senior officials from the Ministry of Power and Renewable Energy, Sri Lanka Sustainable Energy Authority and Ceylon Electricity Board including many people of the area participated in this event."]}
][
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "Nowadays, an arid condition is prevailing and therefore, a conference on creation of artificial rain in Sri Lanka with the technical assistance of Thailand in order to maintain a continuous hydro power generation by breaking all the barriers coming due to such a dry situation was held in Colombo Kingsbury Hotel in last couple of days with the participation of the Minister of Power and Renewable Energy Hon. Ranjith Siyambalapitiya.", "The Minister, Ranjith Siyambalapitiya who expressed his view……", "“Out of total power generation in our country, over 40% of electricity is generated from hydropower and which is a matter on which we should be proud of.  Since the cost for our power generation is shared through several means, we can be able to generate electricity with a least cost in a more efficient environment friendly manner. However, a trend of difference in receipt of rain being prevailing for many years has become a big issue. For many years, monsoon rain did not experience properly and therefore in 2016, the overall capacity of power generation in our country had declined up to 26%. Due to this nature of reasons, even in last 1950s Sri Lanka had initiated to create an artificial rain with the technical assistance of Thailand which is the only country in the world who has the patron rights certificate. If this facility initiated, thereby three areas like hydropower generation, agriculture and drinking water would reach special benefits” he further added.", "Thailand Ambassador His Excellency Chulamanee Chartsuwar and including special delegates were participated in this conference. Many experts and technical experts from Department of Metrology, Ministry of Mahaweli, Sri Lanka Air-Force, Department of Irrigation etc. in Sri Lanka participated in this conference with a view to gain technical knowledge on creation of artificial rain. The Secretary to the Ministry of Power and Renewable Energy, Dr. B.M.S. Battagoda and including many others expressed their views in this conference."]},
{"name": ["Posted by ", " in ", "“Today, we nationally inaugurated the wind power initiative. What we now doing is what we had to do many decades ago, and that is why we are naming national tasks what we start as Sangramaya, initiative etc. As the time has lapsed, we have to get together and undertake these things based on Sangramaya rapidly. Now, attention has been turned on renewable energy generation in Sri Lanka. Water, solar and wind can be mentioned as major source which are used for this purpose. Today, we have used water at maximum level to generate electricity. Practice of generating electricity form solar power is rapidly spreading throughout the Island, and in the meantime, we have started this wind power initiative. Generating 30% of electricity from renewable energy in Sri Lanka by 2020 is our target. We have to increase that level up to 50% by 2030. Therefore, I hope this wind power initiative would be supported at large” said Hon. Ranjith Siyambalapitiya, the Minister of Power and Renewable Energy.", "The Minister said this while he was attending the national inauguration of Wind Power Park at Berakanda of Ambantota.", "The Minister, Ranjith Siyambalapitiya in his further view expressed..,", "“Our country is an Island. As our country is covered by seas, plenty of wind is available for us. From today, people can make their contribution towards wind power generation under the same conditions of Sooriyabala Sangramaya. We are inviting the public to take part in this task much. We will encourage our manufacturers to produce necessary turbines within this country. Another feature is the one that the Berakanda Solar Park existed so far is going to change as a renewable energy park from today onwards. This can be made as a knowledge developing and research park for our children and elders” the Minister said.", "Senior officials from the Ministry of Power and Renewable Energy, Sri Lanka Sustainable Energy Authority and Ceylon Electricity Board including many people of the area participated in this event."]},
{"name": ["Posted by ", " in ", "Official Discussion held with Ranjith Siyambalapitiya, the Minister In-Charge of the Subject", "His Excellency Yukiya Amano, the Director General of International Atomic Energy Agency had arrived in Sri Lanka yesterday (14) for an official visit on the invitation of the Government of Democratic Socialistic Republic of Sri Lanka with a view of expanding atomic energy technology through technical assistance of International Atomic Energy Agency in order to successfully achieve the future development goal of Sri Lanka.", "The said Director General accompanied today (15) with the surveillance visit towards the premises of new office of Atomic Energy Board on the invitation of Hon. Ranjith Siyambalapitiya, the Minister of Power and Renewable Energy and his participation.", "So far, Sri Lanka has achieved a commendable winning goal by moving towards use of atomic energy technology through the assistance of International Atomic Energy Agency. Atomic Medical Unit operated under University of Peradeniya, Sri Lanka Gama Center and National Center for Non-Destructive Test etc. which give valuable service to the people are shining among others. Further opportunities are provided through International Atomic Energy Agency at universal level to participate at foreign trainings, conference etc. in order to develop the knowledge and the skills of Sri Lanka scientist, doctors, engineers and physical doctors.         .", "Furthermore, a large number of scientific instrument and machineries with valuable technology have been received by Sri Lanka from International Atomic Energy Agency. Here what the specialty is that certain such instrument is not available at local market for purchase.", "This work plan of technology is a key mechanism through which enhances the potential atomic energy technology in member countries of International Atomic Energy Agency. Through this program, human resources and physical resources are developed in order to achieve main objectives of member countries. This atomic energy technology is used in its peaceful application to enhance people’s health and nutritional condition, and for food and agricultural projects, water resources and their management, and improvement of fields of environment and industry.", "This International Atomic Energy Agency was established in 1957. This is a join institution of the United Nations. This is an independent body functioning with dedication towards the high improvement of science and technology on the affairs which are universally and diplomatically handled. Further, this Agency as a Universal Center helps its member countries to achieve their social and economic goals. Power generation from atomic energy and use of atomic energy technology to achieve self-sufficient goal of this technology and that of knowledge is taking a prominent place among the programs initiated through peaceful application of atomic energy technology and atomic science. As Sri Lanka is a one of the staring member countries of this International Atomic Energy Agency, it has received considerable assistance and benefit from such Agency for progressive journey of its atomic science and atomic energy technology through the work plan of technological cooperation of such agency being implemented from 1957.", "His Excellency Yukiya Amano is to visit Sri Lanka Gama Center and National Center for Non-Destructive Test affiliated to Sri Lanka Energy Atomic Board during his official visit to Sri Lanka. Yukiya Amano, the Director General of International Atomic Energy Agency also will be visiting Atomic Energy Regulatory Authority of Sri Lanka."]},
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "“Power generation through solar power is very useful to country and environment and even to people individually. Making one million of house premises as power producing units through solar power system is the main aim of us. This concept of power generation though solar power is the best and the foremost useful concept. However, people are not thinking much about this. One matter generally attracted would not take much time to get socialized. But, unfortunately useless petty things are quickly getting into socialization. However, making this type of concept into socialization is a very hard struggle. Therefore, steps will be taken to make each and every house enabling to become as power generating unit and as well as to make the people aware through provision of solar power packages to all places of worship and in particular to government institutions. Today, we have provided all Divisional Secretariat Offices in District of Kegalle with solar power packages. From today onwards, the electricity bills of these offices would become zero, not only that but also all houses in Sri Lanka become rapidly as power generating units by bringing the concept of generation of solar power even among the staff working in such offices” the Minister of Power and Renewable Energy, Hon. Ranjith Siyambalapitiya, pointed out.", "\nThe Minister, who participated at the event of distribution of the said solar power packages to all Divisional Secretariat Offices in Kegalle District which took place in last couple of days, stated this.", "\nThe Minister, Ranjith Siyambalapitiya further expressed his views as follows:", "\n“Today, we are making a valuable concept known as Sooriyabala Sangramaya into socialization.  40% of electricity in our country is coming from hydropower.  However, an up and down condition has been in rainfall for 03 years and amidst we would take initiatives to create artificial rains for water catchment areas. Thailand is the only country which has patron rights certificate to create such artificial rains. From 1950s, the artificial rain system has been in practice in that country. This artificial rain system which does not allow the clouds in the sky to disappear would be helpful to make rains in any wanted places for us. ‘Sooriyabala Sangramaya’ is also that of activity. We have started this Sooriyabala Sangramaya Scheme to generate electricity from each solar x-ray in order to get maximum use out of solar power source. Ceylon Electricity Board has agreed to pay a Rs. 22.00 for a unit of electricity generated at a house through this solar power system. This is a good amount of payment. If this price of offer is given to private sector electricity producers, such parties will be in line”."]},
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "“So far, Sustainable Energy Authority is being maintained in the third party’s buildings. This Authority is to be shifted to a permanent building and thereby its functions will be regularized. This building is a special structure. Sustainable Energy Authority will move to an environment friendly constructed building. This is an environment friendly structure. Sustainable Energy Authority is prepared to use every solar x-ray and every drop of water without wasting. That is very important. People have kept faith on this Authority. Therefore, Sustainable Energy Authority should function as a role player in a manner where such faith kept by people upon the Authority is protected. Further, there is a special feature that is that, today is the first event where the State Minister of Power and Energy, Hon. Ajith Perera participates after his promotion into his new portfolio. He will be blessed by everyone at this moment”, the Minister of Power and Renewable Energy, Hon. Ranjith Siyambalapitiya said.", "The Minister pointed out this while he was attending the event of laying foundation stone to the environment friendly building which is proposed to construct for Sustainable Energy Authority. It has been estimated that this new building will be constructed at the cost of 550 million rupees.", "Further, Minister Ranjith Siyambalapitiya stated….", "“I find the Sustainable Energy Authority Act as a very constructive Act among the other existing laws in Sri Lanka. I have not come across to such a constructive and comprehensive Act. Provisions are available in this said Act to undertake many things related to this sector and its progress. I implore for blessing to have many creative activities being at this building. Most of the time, if we start a work to do that would take a long and long period of time to complete it.  However, what is a special feature regarding this building is such building was being able to complete within a short period of particular time. Hence, it has been scheduled to complete construction work of this building by the month of December of this year”"]},
{"name": ["Posted by ", " in ", "Minister Ranjith Siyambalapitiya", "\nMinister of Power and Renewable Energy", "“Bringing a good message into the society is a very hard struggle. Wimalasurendra at his time worked a lot to bring this good concept of hydropower generation and hydropower electricity into the society. Wimalasurendra prepared many plans and submitted, but then white people did not accept such plans. Finally, Wimalasurendra went to Parliament through election, and he established his hydropower station. Sooriyabala Sangramaya is also that of one. Then Wimalasurendra being in Parliament made his effort of hydropower generation succeeded. However, today even I being in Parliament implement such a policy, succeeding is a very difficult task” the Minister of Power and Renewable Energy said.", "The Minister gave this statement while he was attending an event of distribution of solar power packages to Yattiyantota Divisional Secretariat Office of Kegalle District held in last couple of days.", "The Minister further stated that….,", "“If we generate one unit of electricity from gas we have to spend more than Rs.40.00. However, such unit of electricity can be generated from hydropower at a mere rate of Rs.4.00. Power generation from gas will bring many environmental consequences. Today, we have reached maximum level in hydropower generation. By now, all the reservoirs for hydropower generation are in ending stage. Once Broadland Reservoir, Morogolla Reservoir and Seethawakka Power Project are completed, all reservoirs used for hydropower generation will come to end. Small Hydropower stations have also been established and completed. At the time of construction of Broadland Reservoir a big issue appeared saying that water rafting might have been affected. However, it has been able to control such water rafting better than earlier.  With that example, when a merit task is undertaken, we all have to work with good understanding, and be helpful to bring such merit to the community. I hope you all would cooperate and achieve the merit together. Therefore, I implore that strength and courage should come to us to carry out such task”.", "Senior officials of Ceylon Electricity Board including politicians from the area, and as well as a big crowed of people from that area participated at this event."]}
]