{
  "date": "April 19, 2017", 
  "text": "Sinhala Hindu New Year Festival was celebrated at the premises of  Sri Lanka Embassy in Beijing on 16th of April 2017 with over 275 participants including Sri Lankans, Chinese and other countries.The celebration was co-organized by the Embassy and China  Sri Lanka Youth Forum.H.E. Dr. Karunasena Kodituwakku, Ambassador of Sri Lanka to China chaired the celebrations. The ceremony began with the hoisting of the National Flag by the Ambassador Dr. Karunasena Kodituwakku followed by singing of the National Anthem both in Sinhala and Tamil, lighting of the traditional oil lamp.The Festival was filled with traditional customs and rituals which was an immense opportunity for Sri Lankans in Beijing and adjacent areas to get together and showcase the value of the Sri Lankan customs to all foreign visitors.All the foreign visitors to the event were warmly welcomed according to the Sinhalese rituals and they were entertained with cultural performances by Beijing and Tianjin Students Cultural troupes and were treated to traditional Sri Lankan food.The event also offered the experience of more than 30 Aurudu games to the participants who enjoyed marathon, pillow fighting, tug of war, bursting of balloons.At the end of the ceremony the selection of Awurudu Kumara and Awurudu Kumari among the other events, was the most eye-catching event.Embassy of Sri LankaBeijingSinhala Hindu New Year Festival was celebrated at the premises of  Sri Lanka Embassy in Beijing on 16th of April 2017 with over 275 participants including Sri Lankans, Chinese and other countries.The celebration was co-organized by the Embassy and China  Sri Lanka Youth Forum.H.E. Dr. Karunasena Kodituwakku, Ambassador of Sri Lanka to China chaired the celebrations. The ceremony began with the hoisting of the National Flag by the Ambassador Dr. Karunasena Kodituwakku followed by singing of the National Anthem both in Sinhala and Tamil, lighting of the traditional oil lamp.The Festival was filled with traditional customs and rituals which was an immense opportunity for Sri Lankans in Beijing and adjacent areas to get together and showcase the value of the Sri Lankan customs to all foreign visitors.All the foreign visitors to the event were warmly welcomed according to the Sinhalese rituals and they were entertained with cultural performances by Beijing and Tianjin Students Cultural troupes and were treated to traditional Sri Lankan food.The event also offered the experience of more than 30 Aurudu games to the participants who enjoyed marathon, pillow fighting, tug of war, bursting of balloons.At the end of the ceremony the selection of Awurudu Kumara and Awurudu Kumari among the other events, was the most eye-catching event.Embassy of Sri LankaBeijing", 
  "title": "Sri Lankans in Beijing celebrates Sinhala-Hindu New Year Festival    ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1005-sri-lankans-in-beijing-celebrates-sinhala-hindu-new-year-festival"
}