{
  "date": "April 22, 2017", 
  "text": "Minister Karunanayake was in Washington leading Sri Lanka delegation to the IMF-World Bank Spring Meetings.Alluding to many investment opportunities in areas such as infrastructure development, agro processing, health care, export oriented manufacturing and the tourism sector, Minister Karunanayake outlined the business-friendly policies adopted by the Government of Sri Lanka to position the country as the gateway to Asia. He discussed the benefits that US companies in Sri Lanka could avail of under the existing and potential FTAs with countries in the region, which can provide a larger market in the regionbeyond Sri Lanka. Minister Karunanayake presented an overview of the progress in macroeconomic fundamentals of the country, which are integral cornerstones of a favorable investment climate and urged U.S. companies to look at Sri Lanka not only as an investment destination but also as a country with a high quality of life with excellent amenities for rest and recreation. He pointed out that the government is putting in place mechanisms to support entrepreneurship, technology adoption, trade diversification and environmentally friendly industries and urged U.S. businesses to forge partnerships with the Sri Lankan private sector paving the way to strengthen business links over the next decade.In his concluding remarks, Ambassador Prasad Kariyawasam reiterated that with its market-friendly economic policies, geo-strategic location and high quality physical environment, Sri Lanka has become a business-friendly, eminently livable and welcoming destination in the region. The roundtable discussion was attended among others, by senior officials of the U.S. Chamber of Commerce South Asia Team, senior representatives from Coca Cola, Exxon Mobil, Ventech Engineering LLCs, McLarty Associates, Bower Group Asia, USIBC, CIPE, Mastercard, FedEx, Trimble Navigation Ltd.The United States continues to be Sri Lankas largest export market. Bilateral trade turnover currently stands at approximately USD 3.3 billion and the U.S. accounts for 28% of Sri Lankas total exports in 2016.Minister of Finance Ravi Karunanayake speaking at the U.S. Chamber of Commerce highlighted prospects for increasing bilateral trade and U.S. investment in Sri Lanka at a breakfast roundtable meeting hosted by the US Chamber of Commerce.  Minister Karunanayake was in Washington leading Sri Lanka delegation to the IMF-World Bank Spring Meetings.Alluding to many investment opportunities in areas such as infrastructure development, agro processing, health care, export oriented manufacturing and the tourism sector, Minister Karunanayake outlined the business-friendly policies adopted by the Government of Sri Lanka to position the country as the gateway to Asia. He discussed the benefits that US companies in Sri Lanka could avail of under the existing and potential FTAs with countries in the region, which can provide a larger market in the regionbeyond Sri Lanka. Minister Karunanayake presented an overview of the progress in macroeconomic fundamentals of the country, which are integral cornerstones of a favorable investment climate and urged U.S. companies to look at Sri Lanka not only as an investment destination but also as a country with a high quality of life with excellent amenities for rest and recreation. He pointed out that the government is putting in place mechanisms to support entrepreneurship, technology adoption, trade diversification and environmentally friendly industries and urged U.S. businesses to forge partnerships with the Sri Lankan private sector paving the way to strengthen business links over the next decade.In his concluding remarks, Ambassador Prasad Kariyawasam reiterated that with its market-friendly economic policies, geo-strategic location and high quality physical environment, Sri Lanka has become a business-friendly, eminently livable and welcoming destination in the region. The roundtable discussion was attended among others, by senior officials of the U.S. Chamber of Commerce South Asia Team, senior representatives from Coca Cola, Exxon Mobil, Ventech Engineering LLCs, McLarty Associates, Bower Group Asia, USIBC, CIPE, Mastercard, FedEx, Trimble Navigation Ltd.The United States continues to be Sri Lankas largest export market. Bilateral trade turnover currently stands at approximately USD 3.3 billion and the U.S. accounts for 28% of Sri Lankas total exports in 2016.", 
  "title": "FM highlights potential for increased Sri Lanka - U.S. bilateral trade", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1020-fm-highlights-potential-for-increased-sri-lanka-u-s-bilateral-trade"
}