{
  "date": "April 22, 2017", 
  "text": "They will be given Rs. 250,000 to purchase furniture while Rs 10, 000 will be given for transportation of their belongings.At the meeting, it was also decided to pay a monthly allowance of Rs 50, 000 and the transport allowance of Rs 10, 000 for each family, who will move away from the dangerous zone until they are given full compensation or a permanent house.The relevant ministries on the instructions of the President and the Prime Minister agreed to provide a house or the assessed compensation to the victims within three months.The President instructed the relevant officials to pay a fair compensation on the assessed value to the families, who are not willing to receive a new house.Those who are obtaining compensation will also be given the proposed allowance for transportation and furniture. So far, it has been concluded that there are 60 totally damaged houses while 22 partially damaged houses are located in the dangerous zone and this program will be applied for 211 houses immediately.The National Housing Development Authority has decided to the housing loans given to the affected house owners in Dahampura and Pansalhena areas by the Authority. Accordingly, the housing loans obtained not only by the residents in those areas but the residents in the dangerous zone will also be abolished.The Prime Minister pointed out the necessity of drafting a national policy on removing of solid waste to prevent such tragedies in the future. There, it was decided to convene a meeting once a week under the patronage of the President with the participation of the Prime Minister, relevant ministers, and other officials to discuss and plan an immediate program.He also instructed the Colombo Municipal Council and the Treasury to reimburse the total amount of money to the relevant ministry, which is spent by the National Housing Development Authority for the houses given to the victimized house owners.The President also instructed the officials to create a program to disseminate correct information through media on the relief given to the victimized people.The owners of 60 totally damaged houses in Meethotamulla will be given houses today (21st April) as per the instructions of President Maithripala Sirisena and Prime Minister Ranil Wickremeisnghe given at the Progress Review Meeting on providing relief to the Meethotamulla victims.   They will be given Rs. 250,000 to purchase furniture while Rs 10, 000 will be given for transportation of their belongings.At the meeting, it was also decided to pay a monthly allowance of Rs 50, 000 and the transport allowance of Rs 10, 000 for each family, who will move away from the dangerous zone until they are given full compensation or a permanent house.The relevant ministries on the instructions of the President and the Prime Minister agreed to provide a house or the assessed compensation to the victims within three months.The President instructed the relevant officials to pay a fair compensation on the assessed value to the families, who are not willing to receive a new house.Those who are obtaining compensation will also be given the proposed allowance for transportation and furniture. So far, it has been concluded that there are 60 totally damaged houses while 22 partially damaged houses are located in the dangerous zone and this program will be applied for 211 houses immediately.The National Housing Development Authority has decided to the housing loans given to the affected house owners in Dahampura and Pansalhena areas by the Authority. Accordingly, the housing loans obtained not only by the residents in those areas but the residents in the dangerous zone will also be abolished.The Prime Minister pointed out the necessity of drafting a national policy on removing of solid waste to prevent such tragedies in the future. There, it was decided to convene a meeting once a week under the patronage of the President with the participation of the Prime Minister, relevant ministers, and other officials to discuss and plan an immediate program.He also instructed the Colombo Municipal Council and the Treasury to reimburse the total amount of money to the relevant ministry, which is spent by the National Housing Development Authority for the houses given to the victimized house owners.The President also instructed the officials to create a program to disseminate correct information through media on the relief given to the victimized people.", 
  "title": "Houses for 60 totally damaged houses in Meethotamulla", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1021-houses-for-60-totally-damaged-houses-in-meethotamulla"
}