{
  "date": "April 22, 2017", 
  "text": "The Government has taken steps to provide new houses for all 98 families, whose houses were completely destroyed and yesterday houses were provided for the persons who expressed their consent to receive houses under the first phase.The government has spent 392 million rupees for these houses.Rs. 250,000.00 will be granted to each beneficiary of the houses to purchase furniture.If the values of the destroyed houses exceed the calculated value, the difference will also be paid in cash to respective families, in the future.The President presented the deeds of the houses for the beneficiaries at the Ministry of Disaster Management.Prime Minister Ranil Wickremesinghe, Ministers Susil Premajayantha, Anura Priyadarshana Yapa, Patali Champika Ranawaka, Vajira Abeywardena, A. H. M. Fawzie, Deputy Ministers Lasantha Alagiyawanna, Dunesh Gankanda and the Member of Parliament S. M. Marikkar also participated on this occasion.The first phase of providing houses for the displaced persons, whose houses were completely destroyed due to the collapse of a section of the Meethotamulla garbage dump, was launched yesterday (21st April) under the patronage of President Maithripala Sirisena. 30 families received new houses under the first phase.   The Government has taken steps to provide new houses for all 98 families, whose houses were completely destroyed and yesterday houses were provided for the persons who expressed their consent to receive houses under the first phase.The government has spent 392 million rupees for these houses.Rs. 250,000.00 will be granted to each beneficiary of the houses to purchase furniture.If the values of the destroyed houses exceed the calculated value, the difference will also be paid in cash to respective families, in the future.The President presented the deeds of the houses for the beneficiaries at the Ministry of Disaster Management.Prime Minister Ranil Wickremesinghe, Ministers Susil Premajayantha, Anura Priyadarshana Yapa, Patali Champika Ranawaka, Vajira Abeywardena, A. H. M. Fawzie, Deputy Ministers Lasantha Alagiyawanna, Dunesh Gankanda and the Member of Parliament S. M. Marikkar also participated on this occasion.", 
  "title": "New houses for Meethotamulla victims", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1022-new-houses-for-meethotamulla-victims"
}