{
  "date": "2017-04-24", 
  "text": "Addressing a group of representatives of Meethotamulla victimized people at Temple Trees he said that people who are living in rented houses will also be given an allowance in the future.The participants directly discussed their grievances with the Prime Minister on this occasion and they were apprised regarding the decisions have been taken by the government such as providing new houses to people who are willing to move away from the high risk area, providing an allowance of Rs 50, 000 until the damage is assessed, providing a transport allowance to move away from the high risk area, not recovering the housing loans the victims have obtained from the National Housing Development Authority, and providing a compensation for the damaged furniture as well as vehicles.Prime Mniister instructed the government officials and the victims to go to the Divisional Secretariat on Tuesday to resolve their issues about property while to on Thursday to resolve the issues about deeds.Ministers Anura Priyadarshana Yapa, Wajira Abeywardhane, Sagala Ratnayake, Faizer Mustapha, MP S.M. Marrikkar, Secretary to the Prime Minister Saman Ekanayake, IGP Pujith Jayasundara, and Deputy Chief of Staff of Prime Minister Mrs. Rosi Senanayake also participated.Prime Minster Ranil Wickremesinghe said that the government has decided to reimburse the total value of the damaged houses due to the Meethotamulla disaster. Addressing a group of representatives of Meethotamulla victimized people at Temple Trees he said that people who are living in rented houses will also be given an allowance in the future.The participants directly discussed their grievances with the Prime Minister on this occasion and they were apprised regarding the decisions have been taken by the government such as providing new houses to people who are willing to move away from the high risk area, providing an allowance of Rs 50, 000 until the damage is assessed, providing a transport allowance to move away from the high risk area, not recovering the housing loans the victims have obtained from the National Housing Development Authority, and providing a compensation for the damaged furniture as well as vehicles.Prime Mniister instructed the government officials and the victims to go to the Divisional Secretariat on Tuesday to resolve their issues about property while to on Thursday to resolve the issues about deeds.Ministers Anura Priyadarshana Yapa, Wajira Abeywardhane, Sagala Ratnayake, Faizer Mustapha, MP S.M. Marrikkar, Secretary to the Prime Minister Saman Ekanayake, IGP Pujith Jayasundara, and Deputy Chief of Staff of Prime Minister Mrs. Rosi Senanayake also participated.", 
  "title": "Govt. will reimburse the total value of damaged houses - PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1023-govt-will-reimburse-the-total-value-of-damaged-houses-pm"
}