{
  "date": "2017-04-24", 
  "text": "Head of the Team Mitsutake Numahata handed over the report and made a presentation explaining the recommendations of the Team.He said as a short term measure, the garbage dump should be stabilized to ensure there would not be further collapses. Before the onset of the monsoon the shape of the dump should be streamlined and the base should be covered with polythene. As a secondary measure, the shape of the dump should be made symmetrical with a broad base to ensure proper distribution of the gravity.The team also proposed long term measures to remove the dump by adopting 3-R system of Reduce, Reuse and Recycle.President Sirisena thanked the Japanese Experts Group for undertaking a comprehensive study within days of the disaster and said that the Japanese expertise would be useful to solve the major issue of garbage in Sri Lanka. He pointed out that although the Meetotamulla disaster began as a human tragedy, now the garbage has become a political issue. He said the need for a lasting solution to the issue and sought continued support from Japan for this endeavor.Ministers Susil Premajayantha, Anura Priyadarshana Yapa and Patali Champika Ranawaka and Japanese Ambassador Kenichi Suganuma were also present on this occasion.The Japanese Experts Team presented their report on Meetotamulla Garbage Dump to President Maithripala Sirisena today (24th April) at the Presidents Official Residence in Colombo.   Head of the Team Mitsutake Numahata handed over the report and made a presentation explaining the recommendations of the Team.He said as a short term measure, the garbage dump should be stabilized to ensure there would not be further collapses. Before the onset of the monsoon the shape of the dump should be streamlined and the base should be covered with polythene. As a secondary measure, the shape of the dump should be made symmetrical with a broad base to ensure proper distribution of the gravity.The team also proposed long term measures to remove the dump by adopting 3-R system of Reduce, Reuse and Recycle.President Sirisena thanked the Japanese Experts Group for undertaking a comprehensive study within days of the disaster and said that the Japanese expertise would be useful to solve the major issue of garbage in Sri Lanka. He pointed out that although the Meetotamulla disaster began as a human tragedy, now the garbage has become a political issue. He said the need for a lasting solution to the issue and sought continued support from Japan for this endeavor.Ministers Susil Premajayantha, Anura Priyadarshana Yapa and Patali Champika Ranawaka and Japanese Ambassador Kenichi Suganuma were also present on this occasion.", 
  "title": "Japanese experts present report to President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1026-japanese-experts-present-report-to-president"
}