{
  "date": "April 26, 2017", 
  "text": "Vice President, Global Alliance for Trade Facilitation Donia Hammami, Global Alliance for Trade Facilitations Trade Expert and Senior Advisor, Eric Miller are now in Colombo to address the session joined by Chairman of International Chamber of Commerce Sri Lanka Keerthi Gunawardane, Minister of Industry and Commerce Rishad Bathiudeen and Economist Subhashini Abeysinghe.The session is jointly steered by International Chamber of Commerce Sri Lanka (ICCSL) and Global Alliance for Trade Facilitation (GATF).Vice President Hammami leads ICC policy work in Customs and Trade Facilitation at the International Chamber of Commerce (ICC), the worlds largest business organization with a network of over six million members in more than 100 countries.World Trade Organisations Trade Facilitation Agreement (TFA), agreed in 2013, was the first multilateral trade agreement since the creation of the WTO in 1995. It came in to force this February. The TFA was accepted by 112 member countries including Sri Lanka. The focus of the session will be to tell our private sector of the impact of TFA for Sri Lanka and, more importantly involve them in going forward said ICCSL Chairman Gunawardane.WTO TFA provides a unique opportunity to promote inclusive growth by making cross-border trade easier, quicker and less costly for businesses of all sizes.Sri Lankas first ever country session for its exporters on the historic WTO Trade Facilitation Agreement (TFA) will commence in Colombo today (26th April).   Vice President, Global Alliance for Trade Facilitation Donia Hammami, Global Alliance for Trade Facilitations Trade Expert and Senior Advisor, Eric Miller are now in Colombo to address the session joined by Chairman of International Chamber of Commerce Sri Lanka Keerthi Gunawardane, Minister of Industry and Commerce Rishad Bathiudeen and Economist Subhashini Abeysinghe.The session is jointly steered by International Chamber of Commerce Sri Lanka (ICCSL) and Global Alliance for Trade Facilitation (GATF).Vice President Hammami leads ICC policy work in Customs and Trade Facilitation at the International Chamber of Commerce (ICC), the worlds largest business organization with a network of over six million members in more than 100 countries.World Trade Organisations Trade Facilitation Agreement (TFA), agreed in 2013, was the first multilateral trade agreement since the creation of the WTO in 1995. It came in to force this February. The TFA was accepted by 112 member countries including Sri Lanka. The focus of the session will be to tell our private sector of the impact of TFA for Sri Lanka and, more importantly involve them in going forward said ICCSL Chairman Gunawardane.WTO TFA provides a unique opportunity to promote inclusive growth by making cross-border trade easier, quicker and less costly for businesses of all sizes.", 
  "title": "First Colombo session on WTO agreement opens today", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1036-first-colombo-session-on-wto-agreement-opens-today"
}