{
  "date": "May 01, 2017", 
  "text": "Today, the workers are not only those who harvest the fields and fuel the machinery: as the concept of working is reinvented in the 21st century, the workers are also those who are engaged with their work via technology and the internet in the global marketplace. New definitions have also brought on new responsibilities and needs, ones that must be taken into account when we talk of worker interests.The stage today is set for us to rise above the standard May Day celebrations to embrace a bigger, more relevant and meaningful concept with the participation of the private sector in Sri Lanka.This May Day, may we experience the courage, the desire and the capability to go beyond the traditional definition, to encompass a greater dialogue that includes better working conditions, greater opportunities and ideas that deliver the kind of results needed in today's world of technology and connectivity.Ranil WickremesinghePrime MinisterMay Day celebrates a historic testimony of labour in all its dignity and sacrifice. It unites the workers of the world, in acknowledging that the global economy is indeed empowered by the workers and their service. Today, the workers are not only those who harvest the fields and fuel the machinery: as the concept of working is reinvented in the 21st century, the workers are also those who are engaged with their work via technology and the internet in the global marketplace. New definitions have also brought on new responsibilities and needs, ones that must be taken into account when we talk of worker interests.The stage today is set for us to rise above the standard May Day celebrations to embrace a bigger, more relevant and meaningful concept with the participation of the private sector in Sri Lanka.This May Day, may we experience the courage, the desire and the capability to go beyond the traditional definition, to encompass a greater dialogue that includes better working conditions, greater opportunities and ideas that deliver the kind of results needed in today's world of technology and connectivity.Ranil Wickremesinghe Prime Minister", 
  "title": "Prime Ministers May Day message", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1050-prime-minister-s-may-day-message"
}