{
  "date": "2017-05-01", 
  "text": "Over the years, the working class has played a defining role in the making of Sri Lanka to what it is today. I would like to take this opportunity, therefore, to extend my gratitude to the working population for their tireless work and contribution towards the growth and development of our country.Our nation is at a decisive juncture of her history. As such, I would like to call upon the working community, while striving hard toward the prosperity of our nation, to also remain sensitive and committed to the needs of national unity and reconciliation.Finally, as we pause to reflect on the struggles, victories, and the challenges faced by the labour population, I would like to encourage all political parties to use its May Day celebrations as a platform to advocate the cause of the working community and an occasion to celebrate their efforts.R. SampanthanLeader of the OppositionThe International Workers Day is an occasion to recognize the achievements of the working class and pay tribute to the sacrifices made by workers in securing economic and social rights all over the world.   Over the years, the working class has played a defining role in the making of Sri Lanka to what it is today. I would like to take this opportunity, therefore, to extend my gratitude to the working population for their tireless work and contribution towards the growth and development of our country.Our nation is at a decisive juncture of her history. As such, I would like to call upon the working community, while striving hard toward the prosperity of our nation, to also remain sensitive and committed to the needs of national unity and reconciliation.Finally, as we pause to reflect on the struggles, victories, and the challenges faced by the labour population, I would like to encourage all political parties to use its May Day celebrations as a platform to advocate the cause of the working community and an occasion to celebrate their efforts.R. Sampanthan Leader of the Opposition", 
  "title": "Opposition Leaders May Day message", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1051-opposition-leader-s-may-day-message"
}