{
  "date": "2017-05-01", 
  "text": "The eight-member delegation, which was led by Lin Hai, Director of CCPIT expressed interest in areas of investment in software and hardware development, the manufacture of hydrogen and nitrogen based product, logistics including the warehousing of chemical product for transshipment overseas using Sri Lanka as a hub, network security, gems and jewellery, the assembly of equipment and education.A presentation in Chinese by Vipula Jayasinghe, Senior Deputy Director (Promotion) responsible for China of BOI included the many advantages Sri Lanka offers to Chinese investors as well as the long standing friendly relations that have developed between the Governments and the people of both countries.The BOI delegation consisted of Prasanjith Wijayathilake - Executive Director (Promotion), Dilip S Samarasinghe - Director (Media and Publicity), Ms. Nilupul De Silva - Director (Promotion), Nelson Kumarapeli-Senior Deputy Director (Horana EPZ) and Vipula Jayasinghe - Senior Deputy Director (Promotion).The Board of Investment (BoI) of Sri Lanka hosted a delegation from the China Council for the Promotion of International Trade (CCPIT) Beijing Chapter who was visiting Sri Lanka to study the potential for trade and investments between the two countries. The eight-member delegation, which was led by Lin Hai, Director of CCPIT expressed interest in areas of investment in software and hardware development, the manufacture of hydrogen and nitrogen based product, logistics including the warehousing of chemical product for transshipment overseas using Sri Lanka as a hub, network security, gems and jewellery, the assembly of equipment and education.A presentation in Chinese by Vipula Jayasinghe, Senior Deputy Director (Promotion) responsible for China of BOI included the many advantages Sri Lanka offers to Chinese investors as well as the long standing friendly relations that have developed between the Governments and the people of both countries.The BOI delegation consisted of Prasanjith Wijayathilake - Executive Director (Promotion), Dilip S Samarasinghe - Director (Media and Publicity), Ms. Nilupul De Silva - Director (Promotion), Nelson Kumarapeli-Senior Deputy Director (Horana EPZ) and Vipula Jayasinghe - Senior Deputy Director (Promotion).", 
  "title": "BoI hosts a business delegation CCPIT", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1052-boi-hosts-a-business-delegation-ccpit"
}