{
  "date": "May 03, 2017", 
  "text": "The government will seek high standards in media in Sri Lanka through the establishment of an independent media commission said Parliamentary Reforms and Mass Media Deputy Minister Karunarathne Paranawithana addressing World Press Freedom Day Conference in Jakarta today (3rd May).  The Government is also committed to the course of journalist safety and all efforts will be taken to end impunity, Deputy Minister Paranawithana said addressing the panel on Journalists Safety and Tackling Impunity.We are slowly but gradually moving towards ensuring full media freedom in Sri Lanka, He added.Several legal cases have already begun against perpetrators who attacked media practitioners and all possible measures will be taken to investigate all possible cases relating to media safety, he said.\"What we wanted first was a government that respects democratic principles and values and we have achieved that in Sri Lanka. With that objective being achieved, we are stepping towards ensuring media freedom of which safety of journalists is a cardinal element.\"Citing the investigation on the slain editor Lasantha Wickramatunga, the deputy minister said that there are delays in the legal procedures but the government is determined to bring culprits to the books. Many such investigations have already started and many suspects are behind bars now, he said.Equally the quality of journalism must be up held by all stakeholders. The government is now working on establishing an independent media commission through a consultative process and many more steps will be taken to ensure high standards of Sri Lanka media, he said.The government was successful in implementing RTI laws in Sri Lanka and the same inclusive procedures will be adopted in bringing in laws on media regulation, added the Deputy Minister.", 
  "title": "High media standards expected through the independent commission - Dep. Min. Paranawithana", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1061-high-media-standards-expected-through-the-independent-commission-dep-min-paranawithana"
}