{
  "date": "May 04, 2017", 
  "text": "During her committed and distinguished service here with her fondly attached handler, Corporal T.K.D Rajapaksha of the Corps of Engineers, the dog, Zira-Yankee performed her risky, but the most accurate duty in Manthuvil, and Ananthapuram at Puthukkudirippu, Vellamullivaikkal, Mahamilankulama, Kumburumulla and Komanthurai areas and managed to recover 16 anti personnel mines, one hand grenade, 01 un-exploded explosive ordnance and 03 Rocket Propeller Grenades (RPGs).At the meeting held at the Chief Field Engineers Headquarters in Mattegoda she was officially delivered back to Ms Kimberly McCasland of the US-based Marshal Legacy Institute (MLI) by Major General Sudantha Ranasinghe and other officers.Joining back home with the MLI in the US, Zira-Yankee has been selected to spearhead another world-wide promotional campaign in the US on Global Landmine Issue, expected to be launched shortly by the MLI. Zira-Yankee, along with the MLI representative left for the US on Tuesday (2nd May).Sri Lanka Engineers (SLE) of the Army on 30th April bade adieu to their mine-detecting German shepherd, Zira-Yankee during a fond farewell on the eve of the dogs departure back to the US after a distinguished service of more than six years in Sri Lanka, having cleared over 62,680 sq meters of heavily mine-infested land area in the war-affected North. During her committed and distinguished service here with her fondly attached handler, Corporal T.K.D Rajapaksha of the Corps of Engineers, the dog, Zira-Yankee performed her risky, but the most accurate duty in Manthuvil, and Ananthapuram at Puthukkudirippu, Vellamullivaikkal, Mahamilankulama, Kumburumulla and Komanthurai areas and managed to recover 16 anti personnel mines, one hand grenade, 01 un-exploded explosive ordnance and 03 Rocket Propeller Grenades (RPGs).At the meeting held at the Chief Field Engineers Headquarters in Mattegoda she was officially delivered back to Ms Kimberly McCasland of the US-based Marshal Legacy Institute (MLI) by Major General Sudantha Ranasinghe and other officers.Joining back home with the MLI in the US, Zira-Yankee has been selected to spearhead another world-wide promotional campaign in the US on Global Landmine Issue, expected to be launched shortly by the MLI. Zira-Yankee, along with the MLI representative left for the US on Tuesday (2nd May).", 
  "title": "Mine Detector Zira Flies Home", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1065-mine-detector-zira-flies-home"
}