{
  "date": "May 05, 2017", 
  "text": "New companies born in Sri Lanka last year surged by 7 percent while the Department of Registrar of Companies itself reporting an enormous revenue in 2016. I am pleased to inform the House that as part of changes in fees we have reduced the fee of registration of a Private Limited Company under Form 1 by as much as Rs 11000. In that we reduced this fee from Rs 15000.00 to 4000.00 to develop entrepreneurship in Sri Lanka. All fee changes are effective from January 1, 2017, said Minister of Industry and Commerce Rishad Bathiudeen yesterday (4th May) in Parliament.Minister Bathiudeen was making a statement on the increase of Company registration fees by thes Registrar of Companies (RoC) as a follow-up to the proposal made in 2016 Budget as well as reporting the performance of RoC.The Minister said In 2016, the income of the Department of Registrar of Companies increased by 182% to Rs 1.78 Billion from 2015s Rs 632 million. Also 8,289 new companies were registered in Sri Lanka in 2016. The registration of foreign companies in Sri Lanka was also increased by 17% to 41 in 2016.For the first time in Sri Lankas corporate history, heavy fees levied for registering a new Company, has been reduced by the government by 73 percent. New companies born in Sri Lanka last year surged by 7 percent while the Department of Registrar of Companies itself reporting an enormous revenue in 2016. I am pleased to inform the House that as part of changes in fees we have reduced the fee of registration of a Private Limited Company under Form 1 by as much as Rs 11000. In that we reduced this fee from Rs 15000.00 to 4000.00 to develop entrepreneurship in Sri Lanka. All fee changes are effective from January 1, 2017, said Minister of Industry and Commerce Rishad Bathiudeen yesterday (4th May) in Parliament.Minister Bathiudeen was making a statement on the increase of Company registration fees by thes Registrar of Companies (RoC) as a follow-up to the proposal made in 2016 Budget as well as reporting the performance of RoC. The Minister said In 2016, the income of the Department of Registrar of Companies increased by 182% to Rs 1.78 Billion from 2015s Rs 632 million. Also 8,289 new companies were registered in Sri Lanka in 2016. The registration of foreign companies in Sri Lanka was also increased by 17% to 41 in 2016.", 
  "title": "Sri Lanka reduces fee for new company registration", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1069-sri-lanka-reduces-fee-for-new-company-registration"
}