{
  "date": "2017-05-07", 
  "text": "According to the ONUR, this is the first-ever National Reconciliation Policy to have adopted by Sri Lanka.The process of formulating a National Policy on Reconciliation began in September 2015, followed by a series of stakeholder consultations and multiple briefings to related Ministries, under the guidance the Chairperson of ONUR.                                                                                                         The stakeholders included the Ministry of National Integration and Reconciliation, Secretariat for Coordinating Reconciliation Mechanisms, Ministries of Justice, Education, Women's Affairs, National Dialogue, Coexistence & Official Languages, other ministries, departments, senior provincial council officials, academics and civil society representatives including youth, women and grass-root activists.In order to ensure continuity of state initiatives, the policy also draws on findings of previous national initiatives including the LLRC Report, Udalagama Commission, Paranagama Commission Reports and others, the ONUR said in a release.The National Reconciliation Policy includes an Implementation Strategy which would mainstream the values defined in the Policy, within government institutions and existing national initiatives through annual work plans; a National Program and Action Plan for Reconciliation; and public awareness and education campaigns on the Policy, Programs and Action Plans on Reconciliation to ensure a coordinated effort from all stakeholders by using the Policy as a guiding framework.                                                                                          President Maithripala Sirisena, in his accompanying note to the Cabinet in 2016 September, stated that the Office for National Unity and Reconciliation (ONUR) chaired by former president Chandrika Kumaratunga had drafted the National Policy in a \"manner that reflects that reconciliation is a whole-of-government effort and a multi-stakeholder endeavour.\" Following further discussions and revisions, the final draft of National Reconciliation Policy was presented to the Cabinet by President Sirisena this week, with the endorsement of Minister Mano Ganeshan, Minister of National Dialogue, Coexistence and Official Languages.                                                                                                The National Reconciliation Policy declares that it will \"serve as the State policy on reconciliation\" and \"provide direction to the process of national reconciliation in Sri Lanka.\" Further, it says that it will \"provide a guiding framework to all stakeholders working on reconciliation in order to achieve coherence in reconciliation initiatives.\"The Cabinet of Ministers on Tuesday (2nd May) approved the proposal made by President Maithripala Sirisena to implement the National Reconciliation Policy drafted by Office for National Unity and Reconciliation (ONUR), Chaired by Former President Chandrika Bandaranaike Kumaratunga. According to the ONUR, this is the first-ever National Reconciliation Policy to have adopted by Sri Lanka.The process of formulating a National Policy on Reconciliation began in September 2015, followed by a series of stakeholder consultations and multiple briefings to related Ministries, under the guidance the Chairperson of ONUR.                                                                                                         The stakeholders included the Ministry of National Integration and Reconciliation, Secretariat for Coordinating Reconciliation Mechanisms, Ministries of Justice, Education, Women's Affairs, National Dialogue, Coexistence & Official Languages, other ministries, departments, senior provincial council officials, academics and civil society representatives including youth, women and grass-root activists.In order to ensure continuity of state initiatives, the policy also draws on findings of previous national initiatives including the LLRC Report, Udalagama Commission, Paranagama Commission Reports and others, the ONUR said in a release.The National Reconciliation Policy includes an Implementation Strategy which would mainstream the values defined in the Policy, within government institutions and existing national initiatives through annual work plans; a National Program and Action Plan for Reconciliation; and public awareness and education campaigns on the Policy, Programs and Action Plans on Reconciliation to ensure a coordinated effort from all stakeholders by using the Policy as a guiding framework.                                                                                            President Maithripala Sirisena, in his accompanying note to the Cabinet in 2016 September, stated that the Office for National Unity and Reconciliation (ONUR) chaired by former president Chandrika Kumaratunga had drafted the National Policy in a \"manner that reflects that reconciliation is a whole-of-government effort and a multi-stakeholder endeavour.\" Following further discussions and revisions, the final draft of National Reconciliation Policy was presented to the Cabinet by President Sirisena this week, with the endorsement of Minister Mano Ganeshan, Minister of National Dialogue, Coexistence and Official Languages.                                                                                                   The National Reconciliation Policy declares that it will \"serve as the State policy on reconciliation\" and \"provide direction to the process of national reconciliation in Sri Lanka.\" Further, it says that it will \"provide a guiding framework to all stakeholders working on reconciliation in order to achieve coherence in reconciliation initiatives.\"", 
  "title": "Cabinet approves Sri Lanka's first-ever National Reconciliation Policy", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1073-cabinet-approves-sri-lanka-s-first-ever-national-reconciliation-policy"
}