{
  "date": "2017-05-08", 
  "text": "Despite spring showers, the Embassy of Sri Lanka in Washington DC was a hive of activity on Saturday as thousands of visitors thronged to the embassy premises for a celebration of Sri Lankan culture.The Embassy opened its doors to the public as part of the annual Passport DC Around the World Embassy Tour, an event organized by Cultural Tourism D.C., which provides embassies in Washington D.C. the opportunity to offer a peak into their cultures and cuisine.Throughout the day visitors to the Sri Lanka Embassy were treated to an array of Sri Lankan food and beverages, including Ceylon tea, while enjoying live traditional music, dances and folk games. As in past years, the sari corner generated much excitement among the visitors, as they tried on the countrys colorful traditional attire and posed for photographs. The visitors were also eager to have their names written in the age-old Sinhalese and Tamil scripts, as a unique souvenir of their visit. Many were also eager to learn what made Sri Lanka such a globally popular tourist destination.Around the World Embassy Tour is Washington D.C.s citywide international cultural awareness program that provides its residents and visitors an opportunity to explore the international culture that is a crucial part of the citys character. Despite spring showers, the Embassy of Sri Lanka in Washington DC was a hive of activity on Saturday as thousands of visitors thronged to the embassy premises for a celebration of Sri Lankan culture.The Embassy opened its doors to the public as part of the annual Passport DC Around the World Embassy Tour, an event organized by Cultural Tourism D.C., which provides embassies in Washington D.C. the opportunity to offer a peak into their cultures and cuisine.Throughout the day visitors to the Sri Lanka Embassy were treated to an array of Sri Lankan food and beverages, including Ceylon tea, while enjoying live traditional music, dances and folk games. As in past years, the sari corner generated much excitement among the visitors, as they tried on the countrys colorful traditional attire and posed for photographs. The visitors were also eager to have their names written in the age-old Sinhalese and Tamil scripts, as a unique souvenir of their visit. Many were also eager to learn what made Sri Lanka such a globally popular tourist destination.Around the World Embassy Tour is Washington D.C.s citywide international cultural awareness program that provides its residents and visitors an opportunity to explore the international culture that is a crucial part of the citys character. ", 
  "title": "A Day of Sri Lankan Culture and Tradition in DC ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1074-a-day-of-sri-lankan-culture-and-tradition-in-dc"
}