{
  "date": "May 10, 2017", 
  "text": "Our historical chronicle which starts with the Nibbana of the Buddha will enter a new path with Sri Lanka hosting the International Vesak Festival this year. With that pride let us determine to commit to rise in the global society by overcoming petty boundaries.I wish the Buddhist population in the entire world a joyful and peaceful Vesak!Maithripala SirisenaPresidentThe year 2561 B.C. dawns, marking the commencement of the golden era in the Buddhist history of Sri Lanka. I believe it is an incomparable prestige that our Motherland, as a place where the Buddha visited on three occasions, receives the opportunity to hold the United Nations International Vesak Festival. This is the foremost gift bestowed on us since Sri Lanka was blessed with the greatest gift, the teachings of the Buddha.Offering the pivotal role for us in the 14th UN International Vesak Festival certainly demonstrates the recent victories we have achieved in the international arena. All the citizens of Sri Lanka, who contributed for this accomplishment, will be added to the history as devotees, who benefitted from this meritorious deed.This years theme for the International Vesak Festival is Buddhist Teachings for Social Justice and Sustainable Peace. The key condition for the social justice is equality. The Buddhist teachings also give prominence to this universal concept of equality. The equality, which is demanded by the contemporary world, had been taken into discussion during the period of the Buddha 2561 years ago. The Buddha said, the peace which is the key factor of the existence of human beings can only be built in a healthy society where equality has been established.Our historical chronicle which starts with the Nibbana of the Buddha will enter a new path with Sri Lanka hosting the International Vesak Festival this year. With that pride let us determine to commit to rise in the global society by overcoming petty boundaries.I wish the Buddhist population in the entire world a joyful and peaceful Vesak!Maithripala Sirisena President", 
  "title": "Presidents Vesak Message ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1086-president-s-vesak-message"
}