{
  "date": "2017-05-10", 
  "text": "Sri Lanka has been a country, home to the tenants of Theravada Buddhism for centuries; for us, it is indeed a blessed occasion to be able to host two significant events in the international Buddhist calendar. The 14th United Nations International Wesak celebrations and the Global Buddhist Forum are due to be held in Sri Lanka to coincide with the sacred period of Wesak.The precepts of Buddhism based on the concept of universal compassion (maithri), should inspire us to include its philosophical application in everyday living, while also reviewing new ways of sharing it with a hurting world. This would indeed be one key opportunity presented to us during the International Wesak Celebrations.May all being be happy and content as we come together to commemorate the blessed Day of Wesak.Ranil WickremesinghePrime MinisterThe thrice blessed day of Wesak dawns with spiritual significance for all Buddhists; in observing Wesak, we find the time to engage in activities of piety and sharing of alms with those in need. Sri Lanka has been a country, home to the tenants of Theravada Buddhism for centuries; for us, it is indeed a blessed occasion to be able to host two significant events in the international Buddhist calendar. The 14th United Nations International Wesak celebrations and the Global Buddhist Forum are due to be held in Sri Lanka to coincide with the sacred period of Wesak.The precepts of Buddhism based on the concept of universal compassion (maithri), should inspire us to include its philosophical application in everyday living, while also reviewing new ways of sharing it with a hurting world. This would indeed be one key opportunity presented to us during the International Wesak Celebrations.May all being be happy and content as we come together to commemorate the blessed Day of Wesak.Ranil Wickremesinghe Prime Minister", 
  "title": "Prime Ministers Vesak Message", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1087-prime-minister-s-vesak-message"
}