{
  "date": "2017-05-15", 
  "text": "Information and Communication Technology Agency (ICTA) says that this system will help to provide a fast an efficient service to patients who come for treatment.This system will be fed with health information, prescriptions, reports and biological details of Out patients. In addition prescriptions of patients will be directly sent to the pharmacy through this system. In additions the HHIMS will direct patients for necessary treatments such as injections, taking blood samples, laboratory testing and identifying of infectious diseases.Once the patients details are fed to the HHIMS a special card will be issued to the patient.When the patient comes again it will help the patient as well as the doctor. It will help the doctor to understand the history of the patient and come to the correct diagnosis.As this system will reduce the use of paper it will contribute to create a green environment. This program which comes under the Digital health programme was launched at the Ampara Hospital under the patronage of Minister of Health,Nutrition and Indigenous medicine Dr Rajitha Senarathna. Plans are underway to introduce this system to about 300 hospitals by 2019.A Hospital Health Information Management System (HHIMS)based on information and communication Technology will be introduced to government hospitals soon. Information and Communication Technology Agency (ICTA) says that this system will help to provide a fast an efficient service to patients who come for treatment.This system will be fed with health information, prescriptions, reports and biological details of Out patients. In addition prescriptions of patients will be directly sent to the pharmacy through this system. In additions the HHIMS will direct patients for necessary treatments such as injections, taking blood samples, laboratory testing and identifying of infectious diseases. Once the patients details are fed to the HHIMS a special card will be issued to the patient.When the patient comes again it will help the patient as well as the doctor. It will help the doctor to understand the history of the patient and come to the correct diagnosis.As this system will reduce the use of paper it will contribute to create a green environment. This program which comes under the Digital health programme was launched at the Ampara Hospital under the patronage of Minister of Health,Nutrition and Indigenous medicine Dr Rajitha Senarathna. Plans are underway to introduce this system to about 300 hospitals by 2019.", 
  "title": "HHIMS for government hospitals ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1104-hhims-for-government-hospitals"
}