{
  "date": "May 17, 2017", 
  "text": "For the first time in centuries, global economic power is again shifting towards Asia. By 2030, Asia will surpass North America and Europe on gross domestic product and investment in technology. Consumer markets are emerging across Asia as the Asian middle class rises sharply, said Ranil Wickremesinghe, Prime Minister of Sri Lanka.He made these comments addressing the 2nd Session of the Leaders Roundtable of the One Belt-One Road Forum for International Co-operation, 15th May in Beijing, China.The Indian Ocean Rim association with its sustained growth and an expanding population will become the fastest growing region. The high rate of growth in South Asia is one of the main drivers of this growth. The One Belt and One Road Initiative will further accelerate this process. Sri Lanka plans to use its strategic location and leverage on our connectivity to become the Hub of the Indian Ocean. The National Unity Government headed by President Maithripala Sirisena brings together the two main political parties in the country, giving us the opportunity to bring about this strategic repositioning, said the Prime Minister.The Government has already commenced the development of the three major ports - Colombo, Hambantota and Trincomalee, and the two international airports - Colombo and Mattala, which are all connected by road and rail to the proposed special Economic Zones. These initiatives will transform Sri Lanka into a shipping, aviation, and a logistics hub. Sri Lanka is also focusing on building the hard infrastructure such as the roads, water supply and power supply. The One Belt and One Road Initiative complements Sri Lankas own initiative as they share the same synergies. Several of these advanced infrastructure projects, including the Hambantota Port, the Mattala airport and the Southern expressway have been carried out with finances from Chinese institutions such as the Exim Bank.Furthermore, Sri Lanka is strengthening financial connectivity by establishing an offshore financial centre in the Port City, which is a Real Estate Development project commenced under the One Belt and One Road Initiative.Sri Lanka is also expanding trade connectivity. Today the EU Journal will grant us the GSP+ Tariff Concessions. The FTA with India is being deepened. We are also negotiating FTAs with China and Singapore, said the Prime Minister. We have undertaken the restructuring of our economy including financial stabilization, reviewing administrative regulations to cut red tape, lowering tariffs and introducing a simpler tax system.These measures will fully integrate us with the Global Value Chain thereby obtaining the maximum benefits of the 4th Industrial Revolution.Prime Minister Wickremesinghe said that the One Belt and One Road Initiative will provide the much needed hard and soft connectivity in the Indian Ocean required for rapid economic and social development. History has shown that peace and Freedom of Navigation in the Indian Ocean always resulted in economic growth and prosperity. Similarly, the success of this Initiative and the Hub will also depend on the maintenance of long-term stability in the Indian Ocean by (i) promoting peaceful and non-military cooperation - the 5 principles of Peaceful Co-existence and (ii) ensuring unimpeded commerce based on the multilateral trading system.The One Belt and One Road Initiative is the first economic cooperation arrangement connecting the Eurasian continents. Combining the high-income economies with the fast growing economies will create new opportunities for the growth of global trade.This initiative is proposed by President Xi Jinping; China is providing the initial funding. But we cannot pass all responsibility to China. I commend the Bretton Woods Institution for coming forward to assist. All of us must take ownership, he said. Let me conclude by recalling your words, Excellency, (Xi Jinping) at the World Economic Forum in Davos earlier this year:Let us boost confidence, take actions and march arm in arm towards a bright future.Speech by Hon. Ranil Wickremesinghe, Prime Minister of the Democratic Socialist Republic of Sri Lanka at the 2nd Session of the Leaders Roundtable of the Belt and Road Forum for International Co-operation, 15th May 2017 in Beijing, China For the first time in centuries, global economic power is again shifting towards Asia. By 2030, Asia will surpass North America and Europe on gross domestic product and investment in technology. Consumer markets are emerging across Asia as the Asian middle class rises sharply, said Ranil Wickremesinghe, Prime Minister of Sri Lanka.He made these comments addressing the 2nd Session of the Leaders Roundtable of the One Belt-One Road Forum for International Co-operation, 15th May in Beijing, China.The Indian Ocean Rim association with its sustained growth and an expanding population will become the fastest growing region. The high rate of growth in South Asia is one of the main drivers of this growth. The One Belt and One Road Initiative will further accelerate this process. Sri Lanka plans to use its strategic location and leverage on our connectivity to become the Hub of the Indian Ocean. The National Unity Government headed by President Maithripala Sirisena brings together the two main political parties in the country, giving us the opportunity to bring about this strategic repositioning, said the Prime Minister.The Government has already commenced the development of the three major ports - Colombo, Hambantota and Trincomalee, and the two international airports - Colombo and Mattala, which are all connected by road and rail to the proposed special Economic Zones. These initiatives will transform Sri Lanka into a shipping, aviation, and a logistics hub. Sri Lanka is also focusing on building the hard infrastructure such as the roads, water supply and power supply. The One Belt and One Road Initiative complements Sri Lankas own initiative as they share the same synergies. Several of these advanced infrastructure projects, including the Hambantota Port, the Mattala airport and the Southern expressway have been carried out with finances from Chinese institutions such as the Exim Bank.Furthermore, Sri Lanka is strengthening financial connectivity by establishing an offshore financial centre in the Port City, which is a Real Estate Development project commenced under the One Belt and One Road Initiative.Sri Lanka is also expanding trade connectivity. Today the EU Journal will grant us the GSP+ Tariff Concessions. The FTA with India is being deepened. We are also negotiating FTAs with China and Singapore, said the Prime Minister. We have undertaken the restructuring of our economy including financial stabilization, reviewing administrative regulations to cut red tape, lowering tariffs and introducing a simpler tax system.These measures will fully integrate us with the Global Value Chain thereby obtaining the maximum benefits of the 4th Industrial Revolution.Prime Minister Wickremesinghe said that the One Belt and One Road Initiative will provide the much needed hard and soft connectivity in the Indian Ocean required for rapid economic and social development. History has shown that peace and Freedom of Navigation in the Indian Ocean always resulted in economic growth and prosperity. Similarly, the success of this Initiative and the Hub will also depend on the maintenance of long-term stability in the Indian Ocean by (i) promoting peaceful and non-military cooperation - the 5 principles of Peaceful Co-existence and (ii) ensuring unimpeded commerce based on the multilateral trading system.The One Belt and One Road Initiative is the first economic cooperation arrangement connecting the Eurasian continents. Combining the high-income economies with the fast growing economies will create new opportunities for the growth of global trade. This initiative is proposed by President Xi Jinping; China is providing the initial funding. But we cannot pass all responsibility to China. I commend the Bretton Woods Institution for coming forward to assist. All of us must take ownership, he said. Let me conclude by recalling your words, Excellency, (Xi Jinping) at the World Economic Forum in Davos earlier this year:Let us boost confidence, take actions and march arm in arm towards a bright future.", 
  "title": "Connectivity Co-operation for Inter-connected Development", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1109-connectivity-co-operation-for-inter-connected-development"
}