{
  "date": "May 17, 2017", 
  "text": "Association of Sri Lanka Immigration and Emigration Officers met President Maithripala Sirisena yesterday (May 16) at the Presidential Secretariat.They drew the Presidents attention to some of the issues faced by them. The President directed them to hand over a report on the issues raised by them and their proposals to find solutions for them.They discussed about the Service Regulations Act of Immigration and Emigration, immigration and emigration regulatory service, recruiting of authorized officers and promotions for them, attaching authorized officers for diplomatic missions and the use of training and development opportunities effectively.The officers presented several proposals on further development of Sri Lanka immigration and emigration service, to the President.Minister S. B. Nawinna, Secretary to the Ministry of public Administration and Management J. J. Rathnasiri, Controlling General of the Department of Immigration and Emigration M. N. Ranasinghe and the Director General W. D. Somadasa were among those participated in this occasionAssociation of Sri Lanka Immigration and Emigration Officers met President Maithripala Sirisena yesterday (May 16) at the Presidential Secretariat.They drew the Presidents attention to some of the issues faced by them. The President directed them to hand over a report on the issues raised by them and their proposals to find solutions for them.They discussed about the Service Regulations Act of Immigration and Emigration, immigration and emigration regulatory service, recruiting of authorized officers and promotions for them, attaching authorized officers for diplomatic missions and the use of training and development opportunities effectively.The officers presented several proposals on further development of Sri Lanka immigration and emigration service, to the President.Minister S. B. Nawinna, Secretary to the Ministry of public Administration and Management J. J. Rathnasiri, Controlling General of the Department of Immigration and Emigration M. N. Ranasinghe and the Director General W. D. Somadasa were among those participated in this occasion", 
  "title": "Immigration & Emigration Officers meet President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1111-immigration-emigration-officers-meet-president"
}