{
  "date": "2017-05-18", 
  "text": "Trade Union representatives stated that an internal appointment by promoting a senior officer to the position would benefit the governments ongoing program that targeted increased tax revenue.The trade union representatives pointed out that the senior administrative officers were appointed as Commissioner Generals of the Department of Excise on political whims during the last 20 years. The representatives stated that a similar situation prevailed with the Prison Department for years but it has already been changed. They requested the minister therefore, to make an internal appointment in the Department of Excise as well.Responding to the union representatives, Finance Minister Ravi Karunanayake said that a majority of people in this country voted the Good Governance administration to power on 8th January, 2015 expecting vast changes in all sectors of the country. He said that Excise duty has been increased by 400% to Rs.138 billion today from Rs.39 billion in 2014 thereby making it a reality within the Excise Department as well.The minister further said that the prime target of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe is furthering that humble change.Finance Minister Ravi Karunanayake said that he is ready to make the new appointment on the request of Trade Unions with the approval of the President, the Prime Minister, and the Cabinet.A special discussion was held between Finance Minister Ravi Karunanayake and the representatives of Trade Unions on 16th May with regard to the appointment of a new Commissioner General for the Department of Excise. Trade Union representatives stated that an internal appointment by promoting a senior officer to the position would benefit the governments ongoing program that targeted increased tax revenue.The trade union representatives pointed out that the senior administrative officers were appointed as Commissioner Generals of the Department of Excise on political whims during the last 20 years. The representatives stated that a similar situation prevailed with the Prison Department for years but it has already been changed. They requested the minister therefore, to make an internal appointment in the Department of Excise as well.Responding to the union representatives, Finance Minister Ravi Karunanayake said that a majority of people in this country voted the Good Governance administration to power on 8th January, 2015 expecting vast changes in all sectors of the country. He said that Excise duty has been increased by 400% to Rs.138 billion today from Rs.39 billion in 2014 thereby making it a reality within the Excise Department as well.The minister further said that the prime target of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe is furthering that humble change.Finance Minister Ravi Karunanayake said that he is ready to make the new appointment on the request of Trade Unions with the approval of the President, the Prime Minister, and the Cabinet.", 
  "title": "Discussions between Finance Minister and TUs of Excise Department successful", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1116-discussions-between-finance-minister-and-tus-of-excise-department-successful"
}