{
  "date": "2016-07-13", 
  "text": "There have been several attempts by several media recently to create a wrong opinion in society by indiscriminate publication of news violating basic ethics of journalism that require verification of news from its from sources.The most recent example of such an attempt was the publication of a falsehood as the lead story in a weekend newspaper last Sunday titled \"War tribunal in 9 months, foreign judges are coming\" with reference to the Geneva Human Rights Commission. There is no truth at all in thisnews item and it is only a figment of the imagination of the journalist who wrote it. The objective of publishing such imaginary news may be creation of unrest among the people and the disruption of existing reconciliation in the country.It is also apparent that certain media institutions are trying to gain narrow political advantages by highlighting personal level actions of certain individuals and placing them in an anti- Government context through the abuse of mass media. One such example was the news of thedestruction of a plaque in his temple by the Nayake Thera of Mangalaramaya in Batticaloa. The President had nothing to do with it. The publication of such personal news stories in violation of the basic ethical duty of. Verifying from the sources in order to create personal hatred against the Head of State is not a feature of any advanced media tradition.These concocted news stories show that certain media institutions are engaged in hateful conduct disseminating false information against the Government and its leaders including the President in gross violation of media ethics and utilizing the liberal media environment existing in the country.It must be mentioned that the Government may be compelled to take necessary measures against the publication of such false information through existing media regulatory and legal mechanisms.Dr. Ranga KalansooriyaDirector General of Government Information", 
  "title": "Press Release  2016.07.11", 
  "url": "https://www.dgi.gov.lk/news/latest-news/112-press-release-2016-07-11"
}