{
  "date": "2017-05-23", 
  "text": "He was addressing the opening ceremony of the newly built Court Complex at Galagedara yesterday (22nd May).The President said that, since the election of this government to power, it has taken many steps to ensure and protect social justice, human rights, freedom and democracy in the society. The abolition of the 18th Amendment and the adoption of the 19th Amendment to the Constitution is a great victory achieved by the citizens of this country, he said. Commenting on the Independent Commissions established under the 19thAmendment to the Constitution, the President elaborated, that they laid a solid foundation to further strengthen legal justice, social justice, freedom, fundamental rights and human rights of every citizen of this country. He also said that he recently summoned the relevant officers of the Independent Commissions and instructed them to carry out the tasks of Independent Commissions in a more efficient manner. This two storied court complex has been built with an investment of Rs. 76 million, by the Ministry of Justice.Ensuring social justice for the benefit of the people is the prime commitment of this Government, says President Maithripala Sirisena. He was addressing the opening ceremony of the newly built Court Complex at Galagedara yesterday (22nd May).The President said that, since the election of this government to power, it has taken many steps to ensure and protect social justice, human rights, freedom and democracy in the society. The abolition of the 18th Amendment and the adoption of the 19th Amendment to the Constitution is a great victory achieved by the citizens of this country, he said. Commenting on the Independent Commissions established under the 19thAmendment to the Constitution, the President elaborated, that they laid a solid foundation to further strengthen legal justice, social justice, freedom, fundamental rights and human rights of every citizen of this country. He also said that he recently summoned the relevant officers of the Independent Commissions and instructed them to carry out the tasks of Independent Commissions in a more efficient manner. This two storied court complex has been built with an investment of Rs. 76 million, by the Ministry of Justice.", 
  "title": "Govt. is committed to ensure Social Justice President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1138-govt-is-committed-to-ensure-social-justice-president"
}