{
  "date": "2017-05-24", 
  "text": "President Maithripala Sirisena visited National Arboretum in Canberra this morning (May 24). He was received by the Attorney General of Canberra Gordon Ramsay who represented the Chief Minister of Canberra. Mr. Scott Saddler, Acting Executive Manager of the Arboretum was also present on this occasion. The President planted a Mahogany sapling in the Arboretum to mark his visit to Australia.Addressing the gathering, Mr. Ramsay said the visit of President Sirisena, who is also the Minister of Environment, to National Arboretum is indeed an honour.Mr. Saddler elaborated that the arboretum was set up after a bush fires in 2003 which devastated nearly 20,000 acres. Now 44,000 seeds have been planted so far in the arboretum which also serves as the unique centre of environment learning for students.The National Arboretum Canberra features 94 forests of rare, endangered and symbolic trees from around Australia and the world. Many of the trees are still young but two of the forests are nearly 100 hundred years old. Over 44,000 trees from over 100 countries are growing across the 250 hectare (618 acre) site, making it one of the worlds largest living collections of rare, endangered and significant trees.President Sirisena signed the visitors book as the Minister of Environment, highlighting his vision for a green world. Hence he was very glad to visit the arboretum and plant the tree as a symbol of Sri Lanka  Australia cooperation. President Maithripala Sirisena visited National Arboretum in Canberra this morning (May 24). He was received by the Attorney General of Canberra Gordon Ramsay who represented the Chief Minister of Canberra. Mr. Scott Saddler, Acting Executive Manager of the Arboretum was also present on this occasion. The President planted a Mahogany sapling in the Arboretum to mark his visit to Australia.Addressing the gathering, Mr. Ramsay said the visit of President Sirisena, who is also the Minister of Environment, to National Arboretum is indeed an honour.Mr. Saddler elaborated that the arboretum was set up after a bush fires in 2003 which devastated nearly 20,000 acres. Now 44,000 seeds have been planted so far in the arboretum which also serves as the unique centre of environment learning for students.The National Arboretum Canberra features 94 forests of rare, endangered and symbolic trees from around Australia and the world. Many of the trees are still young but two of the forests are nearly 100 hundred years old. Over 44,000 trees from over 100 countries are growing across the 250 hectare (618 acre) site, making it one of the worlds largest living collections of rare, endangered and significant trees.President Sirisena signed the visitors book as the Minister of Environment, highlighting his vision for a green world. Hence he was very glad to visit the arboretum and plant the tree as a symbol of Sri Lanka  Australia cooperation. ", 
  "title": "President visits National Arboretum in Canberra", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1146-president-visits-national-arboretum-in-canberra"
}