{
  "date": "2016-07-15", 
  "text": "The State Bank of Pakistan (SBP) will issue a special coin in honour of celebrated humanitarian Abdul Sattar Edhi who passed away last week.The denomination, shape and other details regarding the coin will be announced on Saturday at a special condolence reference for Edhi, SBP Spokesman Abid Qamar told Dawn News.Revered by many as a national hero, Abdul Sattar Edhi created a charitable empire out of nothing. He masterminded Pakistans largest welfare organisation almost single-handedly, entirely with private donations.He was diagnosed with kidney failure in 2013 but had been unable to get a transplant due to frail health and was receiving treatment at the Sindh Institute of Urology and Transplantation. While undergoing a scheduled dialysis on Friday, Edhi felt difficulty breathing after which doctors decided to shift him onto a ventilator.The humanitarian passed away at the age of 88 in Karachi on Friday night.Thousands of people, including high-profile politicians and government officials, gathered at the National Stadium to attend Edhi's funeral prayers on Saturday.The State Bank of Pakistan (SBP) will issue a special coin in honour of celebrated humanitarian Abdul Sattar Edhi who passed away last week.The denomination, shape and other details regarding the coin will be announced on Saturday at a special condolence reference for Edhi, SBP Spokesman Abid Qamar told Dawn News.Revered by many as a national hero, Abdul Sattar Edhi created a charitable empire out of nothing. He masterminded Pakistans largest welfare organisation almost single-handedly, entirely with private donations.He was diagnosed with kidney failure in 2013 but had been unable to get a transplant due to frail health and was receiving treatment at the Sindh Institute of Urology and Transplantation. While undergoing a scheduled dialysis on Friday, Edhi felt difficulty breathing after which doctors decided to shift him onto a ventilator.The humanitarian passed away at the age of 88 in Karachi on Friday night.Thousands of people, including high-profile politicians and government officials, gathered at the National Stadium to attend Edhi's funeral prayers on Saturday.The iconic social worker was given a guard of honour and a 19-gun salute by the Pakistan Army as his body was taken away from the National Stadium after a state funeral. His body was then taken to Edhi village, where he was laid to rest.", 
  "title": " Special Edhi coin to be issued by State Bank of Pakistan", 
  "url": "https://www.dgi.gov.lk/news/latest-news/116-special-edhi-coin-to-be-issued-by-state-bank-of-pakistan"
}