{
  "date": "2017-05-31", 
  "text": "Army troops were engaged in road clearance roles along Kalawana - Agalawatta - Ratnapura road, Ayagama - Gawaragiri road and Nivithigala areas,Army troops by late Monday (29thMay) afternoon succeeded in clearing all impediments along a stretch of about 500 ft in Athweltota on Kalawana - Agalawatta - Ratnapura main road using Army machinery, including an excavator, one backhoe loader and one high bed. Clearance of this road patch undertaken by 5 Field Engineers, Sri Lanka Engineers (SLE), has now been restored for traffic movements as usual.Another patch along Eheliyagoda - Dehiowita road near Baduwatta junction and Ambalanpitiya village has also been cleared by the 12 Field Engineers troops, using one air compressor, one excavator and one high bed. Engineer Brigade Commander closely supervises those clearing operations.Similarly, 5 Field Engineers and 583 Brigade troops have been currently busy clearing a large pile of earth, boulders, fallen trees and other impediments along Ayagama - Gawaragiri road for the last nine hours with other stakeholders since movements along this road had come to a standstill, disconnecting connections between those destinations.Civilians also supported the Army in the clearing work Major General Dananjith Karunaratne, Chief Field Engineer, 583 Brigade Commander, Commanding Officers of 5 Field Engineers and 12 Field Engineers and a few Senior Officers were associated with the Commanders surprise visit to those flood-affected areas.Army has started road clearance work in several areas of the Ratnapura District, together with a few Senior Officers, including Major General Sudantha Ranasinghe, Commander, Security Forces - West who is also in charge of overall rescue and relief operations of the Army. Army troops were engaged in road clearance roles along Kalawana - Agalawatta - Ratnapura road, Ayagama - Gawaragiri road and Nivithigala areas,Army troops by late Monday (29thMay) afternoon succeeded in clearing all impediments along a stretch of about 500 ft in Athweltota on Kalawana - Agalawatta - Ratnapura main road using Army machinery, including an excavator, one backhoe loader and one high bed. Clearance of this road patch undertaken by 5 Field Engineers, Sri Lanka Engineers (SLE), has now been restored for traffic movements as usual.Another patch along Eheliyagoda - Dehiowita road near Baduwatta junction and Ambalanpitiya village has also been cleared by the 12 Field Engineers troops, using one air compressor, one excavator and one high bed. Engineer Brigade Commander closely supervises those clearing operations.Similarly, 5 Field Engineers and 583 Brigade troops have been currently busy clearing a large pile of earth, boulders, fallen trees and other impediments along Ayagama - Gawaragiri road for the last nine hours with other stakeholders since movements along this road had come to a standstill, disconnecting connections between those destinations.Civilians also supported the Army in the clearing work Major General Dananjith Karunaratne, Chief Field Engineer, 583 Brigade Commander, Commanding Officers of 5 Field Engineers and 12 Field Engineers and a few Senior Officers were associated with the Commanders surprise visit to those flood-affected areas.", 
  "title": "Army Clear Roads, Make them Motorable", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1196-army-clear-roads-make-them-motorable"
}