{
  "date": "2017-05-31", 
  "text": "She praised the persons who voluntarily came forward forgetting the differences and getting together with state organizations to provide food, clothing and other essential goods to the affected people.Madam Bandaranaike Kumaratunga said that all Sri Lankans respect the Tri Forces, police and the state for the services rendered by them during this time.She further said that we as Sri Lankans should ensure that such incidents dont happen in the future, while facing the challenges and ensuring that illegal structures are not constructed, stop the illegal deforestation which result in landslides. In addition, the release says that we all should support the efforts and the programs by the government headed by the President.  Former President Chandrika Bandaranaike Kumaratunga Chairperson of Office for National Unity and Reconciliation(ONUR) issuing a statement said that we Sri Lankans have got together leaving differences aside to support the victims of floods and landslides the worst in the recent history. She praised the persons who voluntarily came forward forgetting the differences and getting together with state organizations to provide food, clothing and other essential goods to the affected people.Madam Bandaranaike Kumaratunga said that all Sri Lankans respect the Tri Forces, police and the state for the services rendered by them during this time.She further said that we as Sri Lankans should ensure that such incidents dont happen in the future, while facing the challenges and ensuring that illegal structures are not constructed, stop the illegal deforestation which result in landslides. In addition, the release says that we all should support the efforts and the programs by the government headed by the President.  ", 
  "title": "The efforts of Tri forces, officials, public praised by Former President Kumaratunga", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1198-the-efforts-of-tri-forces-officials-public-praised-by-former-president-kumaratunga"
}