{
  "date": "2016-08-02", 
  "text": "Passengers purchasing items from SriLankan Airlines Serendib Treasures on-board duty-free collection will from August 1 enjoy enhanced convenience and purchasing power, thanks to a new electronic credit and debit card system developed in partnership with the Bank of Ceylon to provide real-time processing of transactions.Captain Suren Ratwatte, CEO of SriLankan Airlines, said: At SriLankan Airlines, we take customer service very seriously indeed, and this is yet another innovation by our talented team in partnership with the countrys largest bank, to provide more value addition to our passengers, giving them a more complete journey by providing seamless card transactions for duty free purchases.D.M. Gunasekara, General Manager of the Bank of Ceylon, said: The In-flight online / real-time POS Transaction System, the first of its kind in Sri Lanka, is being launched on 1st August 2016, to celebrate the 77th anniversary of Bank of Ceylon, which is focusing on sophisticated technology in line with BOCs digital transformation.The new system gives passengers a purchasing power that is equal to their card limit, and eliminates the possibility of fraudulent transactions. It also assures passengers that they are not vulnerable to card duplication or identity theft.Chamara Perera, Head of IT at SriLankan Airlines, said: SriLankan Airlines is one of the first few airlines in the world to use the latest GSM technology over Inmarsats Swift Broadband (SBB) service, operated in its newer I-4 satellites, to establish the connection between on-board POS device and the ground Gateway Server.This fast, reliable and secure system was adapted and integrated in-house by our talented team, and is innovatively designed to provide optimum convenience, security and efficiency for both our passengers and the airline.The Serendib Treasures collection is very popular with travelers as it provides the best prices for a wide range of items including fragrances, cosmetics, liquor, tobacco, watches, jewelry, travel products, and souvenirs of Sri Lanka. The new handheld Point of Sales (POS) machines, supplied by DMS Electronics (Pvt) Ltd, have already been introduced on SriLankans state of the art Airbus A330-300 aircraft, and will shortly be introduced on its A320 and A330-200 fleet as well. In the past, credit and debit card transactions were carried out manually on an offline basis, with no link to check on the validity of cards or transactions, and the airline was obliged to impose a limit of LKR 25,000/- per person in order to prevent fraud. Card validity and credit/debit limits could only be verified with banks after the aircraft landed by which time passengers had left the aircraft. In addition, the previous system only accepted embossed cards while the new system accepts both embossed and printed cards.The system was introduced by SriLankan Airlines IT, Inflight Service and Engineering departments in partnership with Bank of Ceylon, Card Centre which is providing the point of sales machines and technical infrastructure. It operates through the new Internet connectivity on board SriLankans fleet which also provides passengers with mobile roaming and Internet/e-mail facilities.Items from the Serendib Treasures collection can be pre-ordered on the airlines website www.srilankan.com 72 hours in advance of a flight in order to guarantee availability of ones preferred items and take advantage of significant discounts on many products for on-line pre-orders.", 
  "title": "SriLankan Airlines and BOC launch real-time card transactions for on-board duty free purchases", 
  "url": "https://www.dgi.gov.lk/news/latest-news/120-srilankan-airlines-and-boc-launch-real-time-card-transactions-for-on-board-duty-free-purchases"
}