{
  "date": "2017-06-02", 
  "text": "The minister made these comments addressing the staff of Ministry of Mass Media, Department of Government Information and other representatives from the affiliated institutions today (2nd June).He requested the support of every media for the successful implementation of governments development drive despite the differences in race, religion and politics. Sri Lanka has one of the most active media in the region, he added.He said that they have already started the process of giving the executive powers to the parliament. The government always listens to the voice of every community and no country can go forward if it is divided.Although Sri Lanka was a country which could become developed after winning the independence in 1948, not taking the right decisions at right time due to various divisions disturbed it.The Minister said that they are planning to establish an Education Authority and by establishing private universities the children of the country will get education while about 30 -40% will win scholarships too.The minister further said that many powerful countries in the world extend invitations to President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe as they are maintaining a friendly foreign policy with all countries and Sri Lanka should use this opportunity for the development of the country.The governments policies are being implemented on three main pillars, Democracy, Reconciliation, and Development, said Newly Appointed Finance and Mass Media Minister Mangala Samaraweera. The minister made these comments addressing the staff of Ministry of Mass Media, Department of Government Information and other representatives from the affiliated institutions today (2nd June).He requested the support of every media for the successful implementation of governments development drive despite the differences in race, religion and politics. Sri Lanka has one of the most active media in the region, he added.He said that they have already started the process of giving the executive powers to the parliament. The government always listens to the voice of every community and no country can go forward if it is divided.Although Sri Lanka was a country which could become developed after winning the independence in 1948, not taking the right decisions at right time due to various divisions disturbed it.The Minister said that they are planning to establish an Education Authority and by establishing private universities the children of the country will get education while about 30 -40% will win scholarships too.The minister further said that many powerful countries in the world extend invitations to President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe as they are maintaining a friendly foreign policy with all countries and Sri Lanka should use this opportunity for the development of the country.", 
  "title": "Media minister requests everyones support without divisions", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1208-media-minister-requests-everyone-s-support-without-divisions"
}