{
  "date": "2017-06-02", 
  "text": "This contribution from the EU will allow our partners on the ground to provide relief to the most-impacted families. This is an expression of solidarity from the European people to the people of Sri Lanka, said Christos Stylianides, Commissioner for Humanitarian Aid and Crisis Management.The EU-funded assistance will focus on the most pressing needs of the affected families in the immediate aftermath of the floods, including access to clean water and sanitation facilities, the provision of essential household items, as well as emergency shelter.The EU funding is being made available via the European Civil Protection and Humanitarian Aid Operations (ECHO) through its Small Scale Response mechanism. Additionally, the Commission's Emergency Response Coordination Centre has activated its Copernicus mapping service upon request from the World Food Program. The Copernicus maps will focus on the Southern and Western areas of Sri Lanka that have been affected by the rains.The European Commission is allocating Euro 300,000 (LKR 51 million approx.) in humanitarian funding to Sri Lanka to bring emergency assistance to communities affected by the recent floods. This contribution from the EU will allow our partners on the ground to provide relief to the most-impacted families. This is an expression of solidarity from the European people to the people of Sri Lanka, said Christos Stylianides, Commissioner for Humanitarian Aid and Crisis Management.The EU-funded assistance will focus on the most pressing needs of the affected families in the immediate aftermath of the floods, including access to clean water and sanitation facilities, the provision of essential household items, as well as emergency shelter.The EU funding is being made available via the European Civil Protection and Humanitarian Aid Operations (ECHO) through its Small Scale Response mechanism. Additionally, the Commission's Emergency Response Coordination Centre has activated its Copernicus mapping service upon request from the World Food Program. The Copernicus maps will focus on the Southern and Western areas of Sri Lanka that have been affected by the rains.", 
  "title": "EU provides Euro 300 000 as flood donations", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1209-eu-provides-euro-300-000-as-flood-donations"
}