{
  "date": "June 05, 2017", 
  "text": "Even though human civilizations, from its origin, made efforts to change the natural environment to suit their needs, at present, due to the frequently occurring of natural disasters, we have to admit that humans cannot survive without a sustainable environment. Nature reminds us its message through landslides, devastating floods and drought.Nevertheless, it is not too late to understand the message of nature comprehensively, as well as to live in harmony with nature.The 'Connecting people to nature', the theme for World Environment day 2017, invites all of us to unite to build that kind of nature friendly relationship.This years World Environment Day expects to bring knowledge and awareness to the people about the need to sustain environment in their activities and daily lifestyle. Avoiding lifestyle habits unfavorable to nature and engaging in appropriate nature friendly lifestyle habits is directly inter-connected with human survival.I wish every success for all the World Environment Day programmes carried out to achieve these goals, and join with all those who contribute for the sustainability of the environment.Maithripala SirisenaPresidentIt took several centuries for the human beings to be modest enough to accept the fact that they are only one of creations of the nature. Even though human civilizations, from its origin, made efforts to change the natural environment to suit their needs, at present, due to the frequently occurring of natural disasters, we have to admit that humans cannot survive without a sustainable environment. Nature reminds us its message through landslides, devastating floods and drought.Nevertheless, it is not too late to understand the message of nature comprehensively, as well as to live in harmony with nature.The 'Connecting people to nature', the theme for World Environment day 2017, invites all of us to unite to build that kind of nature friendly relationship.This years World Environment Day expects to bring knowledge and awareness to the people about the need to sustain environment in their activities and daily lifestyle. Avoiding lifestyle habits unfavorable to nature and engaging in appropriate nature friendly lifestyle habits is directly inter-connected with human survival.I wish every success for all the World Environment Day programmes carried out to achieve these goals, and join with all those who contribute for the sustainability of the environment.Maithripala Sirisena President", 
  "title": "Presidents World Environment Day message", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1214-president-s-world-environment-day-message"
}