{
  "date": "June 07, 2017", 
  "text": "President Maithripala Sirisena says Sri Lankans have become more generous and humanitarian than many others in the world because of the lifestyle nourished with the Buddhist philosophy.The President further said that the people joined together with love, compassion and generosity to assist the affected people by the recently occurred calamity because the hearts of the Sri Lankan people are rich with the noble teachings of the Buddha.He made these remarks participating in a religious ceremony to offer Sannas Pathraya to the Chief Incumbent of the Benthara Udakotuwa Bodhi Sameepa Bhimathiththa Raja Maha Viharaya, Most Venerable Bentara Jinananda Thera, who was conferred the title of Chief Sanga Nayaka of Galle Korale and to unveil the newly constructed Buddha statue at the temple, today (06). The President made the first offering to the newly constructed Buddha statue.The Kalyanikaraka Sangha Sabha appreciating the religious and social service rendered by the Most Venerable Bentara Jinananda Thera conferred the honour title of Saddharma Keerthi Sri Aththadassi of the Chief Sanga Nayaka of Galle Korale.President Sirisena also presented a memento to the newly appointed Maha Nayaka Thero.Anu Nayaka Thero of Kotte Sri Kalyani Smagri Dharma Maha Sangha Sabha Ven. Prof. Kotapitiye Sri Rahula Thero delivered the main dhamma sermon. Venerable Maha Sangha, Ministers Gayantha Karunathilaka, Mahinda Amaraweera and Chandima Weerakkody were among those participated in this occasionPresident Maithripala Sirisena says Sri Lankans have become more generous and humanitarian than many others in the world because of the lifestyle nourished with the Buddhist philosophy.The President further said that the people joined together with love, compassion and generosity to assist the affected people by the recently occurred calamity because the hearts of the Sri Lankan people are rich with the noble teachings of the Buddha.He made these remarks participating in a religious ceremony to offer Sannas Pathraya to the Chief Incumbent of the Benthara Udakotuwa Bodhi Sameepa Bhimathiththa Raja Maha Viharaya, Most Venerable Bentara Jinananda Thera, who was conferred the title of Chief Sanga Nayaka of Galle Korale and to unveil the newly constructed Buddha statue at the temple, today (06). The President made the first offering to the newly constructed Buddha statue.The Kalyanikaraka Sangha Sabha appreciating the religious and social service rendered by the Most Venerable Bentara Jinananda Thera conferred the honour title of Saddharma Keerthi Sri Aththadassi of the Chief Sanga Nayaka of Galle Korale.President Sirisena also presented a memento to the newly appointed Maha Nayaka Thero.Anu Nayaka Thero of Kotte Sri Kalyani Smagri Dharma Maha Sangha Sabha Ven. Prof. Kotapitiye Sri Rahula Thero delivered the main dhamma sermon. Venerable Maha Sangha, Ministers Gayantha Karunathilaka, Mahinda Amaraweera and Chandima Weerakkody were among those participated in this occasion", 
  "title": "Sri Lankans are more generous & humanitarian because of Buddhist philosophy- President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1230-sri-lankans-are-more-generous-humanitarian-because-of-buddhist-philosophy-president"
}