{
  "date": "2017-06-08", 
  "text": "Madame President - Mr. Secretary GeneralAllow me to express my appreciation to those who have been responsible for organizing this conference  notably Mr. Peter Thomson - President of the General Assembly, the Governments of Fiji and Sweden - co-hosts of the Conference, the Permanent Representatives of Portugal and Singapore - facilitators of preparatory meetings and to the Secretary General of the Conference.This assembly is part of a historic process  The collective international efforts to define and correct the depredations of humankind on the Planet Earth. It is a relatively recent effort, beginning with the United Nations Conference on the Human Environment in Stockholm and the Stockholm Declaration in 1972. Since then we have made much progress in recognizing the environment and its protection as the responsibility of all nations. We have largely accepted the connection between ecological management and the human condition. We have had many conferences, created many institutions. Public awareness and concern about the environment is wider than at any time in history. Yet with all these developments, we have still a long way to go to reach the optimum level of global environmental sustainability.This is why the work and outcome of this conference is so important. The oceans constitute about 70 percent of the earths surface and contain 97 percent of the earths water. If we do not make more progress on the oceans, the seas and maritime resources, all our other environment efforts will be difficult, if not impossible to achieve. In many ways then, this has vital significance for the future of humankind. The condition of the oceans, so well described in the concept papers and the discussions of delegates, enhance the urgency of our task.As we proceed with our deliberations, there is an area which my government believes needs more attention. This is the organization of funding sources. For commitments to become reality requires not only sustainable programmes but also sustainable financing. Alongside corrective measures and technical developments, we need to create a sustainable ocean economy, new blue -industries including off-shore renewables, marine technologies, aqua cultures, clean-up and transition activities. Government financing and philanthropic support will probably be insufficient and we will have to encourage creative private public partnerships and other means to unlock commercial capital. These are ways in which we can mobilize new stakeholders and collaborators whose support will help ensure broader constituency for our endeavors.The outcome of this conference and several like gatherings scheduled in the near future also must link to parallel concerns  notably the institutional legal framework contained in UNCLOS and its implementing agreements and institutions. My government and I personally have urged the adoption of measures related to the freedom of navigation in the Indian Ocean. We strongly believe that such measures will help to initiate a stable zone of economic progress that can eventually embrace larger ocean areas and will provide the stability that accelerates rapid environment improvement.Environmental interconnectivity can provide an opportunity for peacekeeping, peacemaking and development that will bring multiple benefits to several regions in and around South and Southeast Asia and the Eastern Pacific Ocean.Madame President,Island nations like my own, are particularly vulnerable to the impact of ocean environments and climate change. In the past decade or so, Sri Lanka has been devastated by nature driven tragedies. Floods and landslides of 2003, the massive Tsunami of 2004 and other disasters have wrecked my country. Right now, as I speak, we are inundated with savage floods causing hundreds of deaths and hundreds of thousands of displaced people. Human misery is unbelievable. We are grateful to the international community, the United Nations and its agencies and the Secretary General, and so many generous contributions of assistance. But, all this underlines how helpless we are in the face of environmentally sourced disasters.For nations like my own, the oceans are life and death. The Indian Ocean, in which we are located, provides employment, food, avenues of trade and commerce. Our large coastal communities survive at ocean level. For us, rise of the seas, pollution of the oceans, depletion of fish, good coastal eco systems are not abstractions  they are the core of our existence. Parenthetically, I might mention that the Indian Ocean around us now has the second largest accumulation of floating plastic waste in the world. Cleansing the oceans, assuring maritime sustainability is our future  and we increasingly ask: What is our future unless this is done?We are deeply conscious that our fate is not in our hands alone. This is especially why we are so supportive of international environment actions. We strongly endorse the Paris Climate Agreement which was ratified on our behalf by Sri Lankas President His Excellency Maithripala Sirisena. We affirm our commitment to the FAO International Plan of Action and are implementing the Sri Lanka National Plan of Action on Illegal, Unreported and Unregulated Fishing. We consistently stand behind every significant international environmental agreement, especially the Sustainable Development goals and the UN Framework Convention on Climate Change. It is our hope that the collective interest embodied in these instruments will be the basis for a new consensus.Madame PresidentI come from a culture, a country where our philosophic heritage cherished the sanctity of the environment. The Lord Buddha, widely venerated in our part of the world, enjoined people to preserve it for prosperity. The passage of time, the exigencies of modernization and the separation of individuals from their natural habitat have undercut that message. But the wisdom of such sage advice, which nurtured our ancestors, is now starkly evident. And conferences such as this, remind us that we must reclaim our heritage or perish.Madame President,For 72 years, the United Nations has worked, with varying degrees of success, on the global agenda as it has evolved. The here and now, the immediacies of the world, largely engage the attention of the UN. Although it tries, there is understandably not much space available to focus on the future. But surely, part of our task is also to shape Planet Earth so that we will leave a heritage that generations to come will welcome.Our efforts in the environmental area fulfill that obligation. That is why I strongly endorse the objectives of this Conference and hope that your deliberations will create practical, prompt and inclusive results. Todays urgencies and our legacy for the future demand no less.Thank YouAddress by Prime Minister Ranil Wickremesinghe to the UN Conference to Support the Implementation of Sustainable Development Goal 14: Conserve and sustainably use the oceans, seas and marine resources for Sustainable Development, United Nations, New York, 5th June 2017. Madame President - Mr. Secretary GeneralAllow me to express my appreciation to those who have been responsible for organizing this conference  notably Mr. Peter Thomson - President of the General Assembly, the Governments of Fiji and Sweden - co-hosts of the Conference, the Permanent Representatives of Portugal and Singapore - facilitators of preparatory meetings and to the Secretary General of the Conference.This assembly is part of a historic process  The collective international efforts to define and correct the depredations of humankind on the Planet Earth. It is a relatively recent effort, beginning with the United Nations Conference on the Human Environment in Stockholm and the Stockholm Declaration in 1972. Since then we have made much progress in recognizing the environment and its protection as the responsibility of all nations. We have largely accepted the connection between ecological management and the human condition. We have had many conferences, created many institutions. Public awareness and concern about the environment is wider than at any time in history. Yet with all these developments, we have still a long way to go to reach the optimum level of global environmental sustainability.This is why the work and outcome of this conference is so important. The oceans constitute about 70 percent of the earths surface and contain 97 percent of the earths water. If we do not make more progress on the oceans, the seas and maritime resources, all our other environment efforts will be difficult, if not impossible to achieve. In many ways then, this has vital significance for the future of humankind. The condition of the oceans, so well described in the concept papers and the discussions of delegates, enhance the urgency of our task.As we proceed with our deliberations, there is an area which my government believes needs more attention. This is the organization of funding sources. For commitments to become reality requires not only sustainable programmes but also sustainable financing. Alongside corrective measures and technical developments, we need to create a sustainable ocean economy, new blue -industries including off-shore renewables, marine technologies, aqua cultures, clean-up and transition activities. Government financing and philanthropic support will probably be insufficient and we will have to encourage creative private public partnerships and other means to unlock commercial capital. These are ways in which we can mobilize new stakeholders and collaborators whose support will help ensure broader constituency for our endeavors.The outcome of this conference and several like gatherings scheduled in the near future also must link to parallel concerns  notably the institutional legal framework contained in UNCLOS and its implementing agreements and institutions. My government and I personally have urged the adoption of measures related to the freedom of navigation in the Indian Ocean. We strongly believe that such measures will help to initiate a stable zone of economic progress that can eventually embrace larger ocean areas and will provide the stability that accelerates rapid environment improvement.Environmental interconnectivity can provide an opportunity for peacekeeping, peacemaking and development that will bring multiple benefits to several regions in and around South and Southeast Asia and the Eastern Pacific Ocean.Madame President,Island nations like my own, are particularly vulnerable to the impact of ocean environments and climate change. In the past decade or so, Sri Lanka has been devastated by nature driven tragedies. Floods and landslides of 2003, the massive Tsunami of 2004 and other disasters have wrecked my country. Right now, as I speak, we are inundated with savage floods causing hundreds of deaths and hundreds of thousands of displaced people. Human misery is unbelievable. We are grateful to the international community, the United Nations and its agencies and the Secretary General, and so many generous contributions of assistance. But, all this underlines how helpless we are in the face of environmentally sourced disasters.For nations like my own, the oceans are life and death. The Indian Ocean, in which we are located, provides employment, food, avenues of trade and commerce. Our large coastal communities survive at ocean level. For us, rise of the seas, pollution of the oceans, depletion of fish, good coastal eco systems are not abstractions  they are the core of our existence. Parenthetically, I might mention that the Indian Ocean around us now has the second largest accumulation of floating plastic waste in the world. Cleansing the oceans, assuring maritime sustainability is our future  and we increasingly ask: What is our future unless this is done?We are deeply conscious that our fate is not in our hands alone. This is especially why we are so supportive of international environment actions. We strongly endorse the Paris Climate Agreement which was ratified on our behalf by Sri Lankas President His Excellency Maithripala Sirisena. We affirm our commitment to the FAO International Plan of Action and are implementing the Sri Lanka National Plan of Action on Illegal, Unreported and Unregulated Fishing. We consistently stand behind every significant international environmental agreement, especially the Sustainable Development goals and the UN Framework Convention on Climate Change. It is our hope that the collective interest embodied in these instruments will be the basis for a new consensus.Madame PresidentI come from a culture, a country where our philosophic heritage cherished the sanctity of the environment. The Lord Buddha, widely venerated in our part of the world, enjoined people to preserve it for prosperity. The passage of time, the exigencies of modernization and the separation of individuals from their natural habitat have undercut that message. But the wisdom of such sage advice, which nurtured our ancestors, is now starkly evident. And conferences such as this, remind us that we must reclaim our heritage or perish.Madame President,For 72 years, the United Nations has worked, with varying degrees of success, on the global agenda as it has evolved. The here and now, the immediacies of the world, largely engage the attention of the UN. Although it tries, there is understandably not much space available to focus on the future. But surely, part of our task is also to shape Planet Earth so that we will leave a heritage that generations to come will welcome.Our efforts in the environmental area fulfill that obligation. That is why I strongly endorse the objectives of this Conference and hope that your deliberations will create practical, prompt and inclusive results. Todays urgencies and our legacy for the future demand no less.Thank You", 
  "title": "Prime Ministers Speech at UN Ocean Conference", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1238-prime-minister-s-speech-at-un-ocean-conference"
}