{
  "date": "2017-06-10", 
  "text": "The support will be channeled through United Nations Children's Fund (UNICEF) and International Federation of Red Cross (IFRC). The Foreign Minister stressed the importance of mitigation and prevention of destruction caused by natural disaster and climate change. Human life can be saved, and the cost of prevention is significantly lower than the price of reparation, Brende stated.UNICEF will assist children, women and their families affected by the flood and landslides. Norwegian support will also be provided in the areas of water, sanitation, hygiene, child protection and education.The Norwegian support to IFRC will help to improve the condition in collective centers with water and sanitation. It will also contribute to clean up the wells and give the people basic household items to restart their lives.The Norwegian Embassy in Colombo is funding an ongoing technical cooperation between the National Building Research Organization (NBRO) and the Norwegian Geotechnical Institute (NGI), for capacity building and advanced equipment to NBRO on landslide prevention, analysis and early warning systems. The support to NBRO aims to save lives and property by early warning systems and comprehensive mapping. The Embassy is in dialogue with NBRO on their needs for increased support.Norway is among the top four donor countries supporting the UN Central Emergency Response Fund (CERF) which provide time-critical assistance to UN agencies responding to natural disasters. Norway has contributed with USD 44 million to CERF in 2017.The Norwegian Foreign Minister, Brge Brende, has announced that Norway will contribute with NOK 10 million (LKR 180 million/USD 1.2 million) to the humanitarian relief effort due to floods and landslides in Sri Lanka. The support will be channeled through United Nations Children's Fund (UNICEF) and International Federation of Red Cross (IFRC). The Foreign Minister stressed the importance of mitigation and prevention of destruction caused by natural disaster and climate change. Human life can be saved, and the cost of prevention is significantly lower than the price of reparation, Brende stated.UNICEF will assist children, women and their families affected by the flood and landslides. Norwegian support will also be provided in the areas of water, sanitation, hygiene, child protection and education.The Norwegian support to IFRC will help to improve the condition in collective centers with water and sanitation. It will also contribute to clean up the wells and give the people basic household items to restart their lives.The Norwegian Embassy in Colombo is funding an ongoing technical cooperation between the National Building Research Organization (NBRO) and the Norwegian Geotechnical Institute (NGI), for capacity building and advanced equipment to NBRO on landslide prevention, analysis and early warning systems. The support to NBRO aims to save lives and property by early warning systems and comprehensive mapping. The Embassy is in dialogue with NBRO on their needs for increased support.Norway is among the top four donor countries supporting the UN Central Emergency Response Fund (CERF) which provide time-critical assistance to UN agencies responding to natural disasters. Norway has contributed with USD 44 million to CERF in 2017.", 
  "title": "Norway contributes USD 1.2 million for flood and landslide relief ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1248-norway-contributes-usd-1-2-million-for-flood-and-landslide-relief-2"
}