{
  "date": "2017-06-12", 
  "text": "He was warmly received by the Commander of the Navy, Vice Admiral Ravindra Wijegunaratne at the Bandaranaike International Airport, Colombo.Admiral Muhammad Zakaullah was accompanied by Principal Secretary to the Chief of the Naval Staff, Commodore Javaid Iqbal, Commandant Pakistan Naval Academy, Commodore Adnan Ahmed. The occasion was also attended by the Defence Attach to the Pakistan High Commission in Sri Lanka Colonel Irshad Khan.Admiral Muhammad Zakaullah, as the Chef Guest graced the Passing Out Parade (POP) of the Midshipmen belonging to the 30th,31st KDU and 55th Cadet Entry intakes together with Service Entry 01/2016 candidates held at the Naval and Maritime Academy, Trincomalee yesterday (11th June).Admiral Muhammad Zakaullah joined Pakistan Naval Academy in 1975 and was commissioned in the Operations Branch in 1978. He specialized as Principal Warfare Officer from UK and Navigation and Direction Officer from Pakistan. He was appointed to the highest seat of the Pakistan Navy in 2014.Chief of the Naval Staff - Pakistan Navy, Admiral Muhammad Zakaullah arrived in Sri Lanka on 10th June. He was warmly received by the Commander of the Navy, Vice Admiral Ravindra Wijegunaratne at the Bandaranaike International Airport, Colombo.Admiral Muhammad Zakaullah was accompanied by Principal Secretary to the Chief of the Naval Staff, Commodore Javaid Iqbal, Commandant Pakistan Naval Academy, Commodore Adnan Ahmed. The occasion was also attended by the Defence Attach to the Pakistan High Commission in Sri Lanka Colonel Irshad Khan.Admiral Muhammad Zakaullah, as the Chef Guest graced the Passing Out Parade (POP) of the Midshipmen belonging to the 30th,31st KDU and 55th Cadet Entry intakes together with Service Entry 01/2016 candidates held at the Naval and Maritime Academy, Trincomalee yesterday (11th June).Admiral Muhammad Zakaullah joined Pakistan Naval Academy in 1975 and was commissioned in the Operations Branch in 1978. He specialized as Principal Warfare Officer from UK and Navigation and Direction Officer from Pakistan. He was appointed to the highest seat of the Pakistan Navy in 2014.", 
  "title": "Chief of the Naval Staff - Pakistan Navy arrives in Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1251-chief-of-the-naval-staff-pakistan-navy-arrives-in-sri-lanka"
}