{
  "date": "August 08, 2016", 
  "text": "Prime Minister Nawaz Sharif has declared that Pakistan is committed to jointly working with SAARC member states in fighting terrorism, corruption and organized crimes.He was addressing inaugural session of the SAARC Interior Ministers' Conference in Islamabad this morning. The Prime Minister said at national level, Pakistan has made remarkable gains against terrorism through operation Zarb-e-Azb and effective implementation of National Action Plan. These reflect the Government's determination to eliminate the scourge of terrorism from our soil for good.He pointed out that SAARC region is blessed with tremendous human and natural resources. So, SAARC can and should provide a platform to optimally harness the regional potential for peace and prosperity of our people.Nawaz Sharif said such an approach is in sync with his Government's vision of peace for development and peaceful neighbourhood.He said Pakistan has always been supportive of initiatives taken by SAARC to advance its ideals and objectives as enshrined in its charter.He said Pakistan has also been strong advocate of stepping up regional efforts to ensure energy security through sharing of indigenous sources.The Prime Minister said Pakistan shares the perception that connectivity is critical to the progress and prosperity of the region and supports, in principle, road, air, rail and water connectivity within the region.Nawaz Sharif said realization of the goals and objectives envisaged in SAARC charter is our collective responsibility. Addressing the ceremony, SAARC Secretary General Arjun Bahadur Thapa said there is a need to take effective measures to tackle the menace of narcotics, terrorism, cyber crimes and other transnational crimes.He said SAARC condemns terrorism in all its forms and manifestations. He said there is a need for effective cooperation among member countries to combat this menace.The Secretary General said the 7th SAARC meeting will review progress on decisions taken in previous meetings.(PBC)", 
  "title": "Pak Premier calls for joint efforts to combat regional challenges in SAARC meeting", 
  "url": "https://www.dgi.gov.lk/news/latest-news/126-pak-premier-calls-for-joint-efforts-to-combat-regional-challenges-in-saarc-meeting"
}