{
  "date": "June 14, 2017", 
  "text": "Mr. Mahinda Rajapaksa and his advisors, instead of working to take our country to the heights that our country could have achieved soon after the conclusion of the conflict in 2009, chose to run our country to the ground. He made our country heavily indebted on the one hand, having borrowed at exorbitantly high, commercial rates; while taking decisions that made Sri Lanka withdraw from the international stage, on the other, thus making our country and our people isolated and shunned by the world. He hides the fact that time after time, major donor countries voted against Sri Lanka at the time, in international financial institutions.Having eventually lost an election which he himself called for, ahead of time, he appears to still not be able to come to terms with that loss. His hunger for power makes him and his advisors continue to indulge in the lies, tricks and games that were so much a part of his regime and so much a part of his personality. Just recently we saw how he lied to the people about his travel to Japan. He said that he was travelling to Japan at the invitation of the Emperor of Japan! The Embassy of Japan responded to a question from a journalist denying this. Why resort to this kind of lying to hoodwink the people, Mr. Rajapaksa? If you are in fact a follower of the teachings of Gautama Buddha as you try to show the people, isnt it about time, at least at this stage of your life, to try to abide by even one of the five precepts, and refrain from indulging in lies.Mr. Rajapaksa, in a statement titled Government should not create unrealistic expectations about GSP Plus says that obtaining the GSP Plus facility is trivial, since Sri Lanka is very close to passing the threshold of an upper middle income country.He conveniently hides a fundamental issue. A country has to be classified as \"upper middle income\" by the World Bank for three consecutive years in order to be no longer eligible for the GSP Plus. Even if Sri Lanka were to reach that threshold tomorrow, we would still have access to the advantages of GSP Plus for three years, and for one additional year after the decision is taken to withdraw the benefit. This shows that Mr. Rajapaksa is clearly trying to distort facts because he cant acknowledge the fact that the National Unity Government has in fact managed to obtain a formidable boost to Sri Lankas economy, in application of Article 4(1) of the GSP Regulation of 2012, for at least four years.This period of, at the very least four years, comes just when the European economy starts to show signals of growth recovery. With less unemployment and more consumer demand, this is the moment to join in enhanced partnershipwith the European Union!But let me add a point. Mr. Rajapaksas reasoning that we shouldn't aspire to a better deal, because some time in the future the economy will grow is callous and insensitive to the workers of our country and their families. It reflects a complete lack of concern for our workers who expect progress in the immediate present, and they deserve progress in the immediate present. So what if Sri Lanka, thanks to the ingenuity and hard work of its entrepreneurs and workers looks poised to cross a certain threshold of average income? Does it mean that we, as a government, should sit on our hands without giving them the opportunity for a better deal that they deserve now in the present? Shouldn't we help them to reach our national goals sooner rather than later?The idea that GSP Plus puts Sri Lanka \"under the supervision\" of the EU is simply absurd. By committing to a number of universal human rights principles, we do nothing that was not already recommended by Sri Lankan people who came before the Lessons Learned and Reconciliation Commission (LLRC) to give their input and views. Protecting every citizen from torture is not an alien imposition. It is a sovereign decision from a humanistic nation, towards its own citizens, inspired by the most sacred human values and principles. How ironic that Mr. Rajapaksa who claims to be not just a follower but a guardian of Buddhism in Sri Lanka, does not advocate granting the very basic human rights principles and rights and freedoms to the citizens of this country! Dont our citizens deserve the highest standards of protection? Dont our citizens deserve the highest standards of human rights and freedoms?It was incompetence and arrogance of Mr. Rajapaksa and his advisors, and their determination to deny the people of this country their rightsthat resulted in Mr. Rajapaksa failing to retain the GSP Plus facility. It was ill-advised to not implement the 2011 recommendations of the LLRC, a Commission which he himself appointed, to protect citizens from torture, criminalize disappearances, and fully investigate cases of human rights violations. In fact it was an injustice caused to the law abiding soldiers of this country as well. Having failed himself, and the people of our country, now in 2017, it is simply invidious to criticize a successful measure that the Government seeks to implement for the benefit of the people of our country.We know very well how Mr. Rajapaksa and his advisors tried until the last minute to retain the GSP Plus facility in 2010, and lost. Licking their wounds, they then sought to lie to the people by saying that he decided to not pursue the facility, to avoid damage to the countrys political, legal and institutional framework. He probably still cant get over those lies. So he keeps repeating them in different formulations and words even seven years later in 2017.For this government, the GSP Plus system is a partnership that helps our nation and our people regain their due place once again on the international stage as a respected nation and a respected people standing shoulder to shoulder with the international community, shedding the pariah tatters that the former government chose to put on our nation and our people. Sri Lanka and the Sri Lankan people deserve the best in the world. Sri Lanka is a proud nation and the Sri Lankan people are a proud people with the self-confidence to speak and act as equals with every country or group of countries in the world. We don't need to hide from global dialogue in order to feel better. On the contrary, we feel stronger when our laws reflect the best of global humanism, when our citizens benefit from the best law enforcement, when our workers and entrepreneurs see the ports of the world open to the fruit of their efforts.", 
  "title": "Minister Mangala Samaraweera responds to MRs statement on GSP+ concession", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1267-minister-mangala-samaraweera-responds-to-mr-s-statement-on-gsp-concession"
}