{
  "date": "2016-08-08", 
  "text": "Sri Lankas premier annual international athletic showpiece, the LSR Colombo Marathon (www.srilankamarathon.org), will celebrate its 16thyear with more than 7,500 runners of all ages expected to be seen on the picturesque route from Colombo to Negombo on 2nd October 2016.The LSR Colombo Marathon is a major event on the global distance running calendar, being one of just 56 race organisationsout of over 110 worldwide which have voting rights in the Association of International Marathons and Distance Races (www.aimsworldrunning.org), of which it is a permanent member. It is also recognised by the International Association of Athletic Federations (IAAF).Captain SurenRatwatte, CEO of SriLankan Airlines, said: The LSR Colombo Marathon is a global sporting event which SriLankan Airlines is very proud to be part of. We have no doubt that we will once again have a successful event and wish all participants the best of luck and an enjoyable tour of our island of Paradise.ThilakWeerasinghe, Founder and Chairman of Lanka Sportreizen who launched the event in 1998, said: We at LSR are delighted to once again welcome thousands of runners to take part in this major sporting event, which has grown in strength and stature from year to year. We are happy to see a large number of returnees among our foreign participants.The LSR Colombo Marathon is organised by Lanka Sportreizen (www.LSRtravel.com), one of Sri Lankas best known tour operators, closely supported once again by Sri Lankas national carrier SriLankan Airlines(www.srilankan.com) and the Sri Lanka Tourism Promotions Bureau (www.srilanka.travel).More than 200 foreign runners from over 40 countries are expected at this years LSR Colombo Marathon. The event will be flagged off at 6 a.m. from the Independence Square in Colombo and proceed towards the Negombo Beach Park via Borella, Dematagoda, Peliyagoda, Wattala, and around the breathtakingMuthurajawela Marshes along the Hamilton Canal, Pamunugama, Thalahena, Pitipana and Duwa. Registration will be on 1st October 2016 from 9 a.m. to 4 p.m. Those interested should visit http://colombomarathon.com/cm_2015/RegistrationAs always, the race will have several sub-categories which are open to both men and women: Full Marathon - 18 and above; Full Marathon - 50 and above (Veterans); Half Marathon - 17 and above; Half Marathon - 50 and above (Veterans); Fun Run 10km - 15 and above (Schools / Other); and Fun Run 5km - 15 and above (Schools / Other). The winners in the Mens and Womens Full Marathons will receive prize money of USD 2,500 each, with many other prizes also on offer.It is also supported by the Western Provincial Council, Ministry Of Sports, the Athletic Association, the Colombo Municipal Council, the Negombo Municipal Council, the Sri Lanka Police, the Tri Forces, and Print and Electronic Media organizations.Originally known as the LSR International Marathon, the first five editions were held in Galle, Negombo, Kandy and Dambulla, before it was renamed the LSR Colombo Marathon and moved permanently to the capital city in 2004.The 2015 edition of the LSR Colombo Marathon witnessed the participation of more than 6,400 runners including over 200 foreigners from 39 countries. The Mens Full Marathon of the 2015 LSR Colombo Marathon was won by Antony Mugoof Kenya and the Womens Full Marathon by Sri Lankas B.G.L.A. Bogahawaththa. The Mens Veterans Full Marathon was won by Sunil Premarathne of Sri Lanka with the Womens Veterans Full Marathon was won by Yen Nguyen of the United States.In 2014, Sri Lankas GeethaniRajasekara qualified for the 2016 Olympic Games by establishing a new Sri Lanka Record at the LSR Colombo Marathon.", 
  "title": "16th LSR Colombo Marathon expects 7,500 runners from 40 countries", 
  "url": "https://www.dgi.gov.lk/news/latest-news/127-16thlsr-colombo-marathon-expects-7-500-runners-from-40-countries"
}