{
  "date": "June 14, 2017", 
  "text": "Following is the full statement issued by the Cabinet of Ministers-:The National Unity Government, headed by President Maithripala Sirisena reaffirm commitment, in accordance with the mandates received from the people at the Presidential elections in January and Parliamentary elections of August 2015, to ensure that our nation never again returns to a conflict-ridden past, and instead resolve to guide our nation towards reconciliation, sustainable peace, and economic progress. Communal, ethnic and religious hatred and violence, and impunity have no place in the society that we strive to build.In this context, we are deeply concerned by the recent incidents of violence targeting places of religious worship, shops and business enterprises, and houses. We denounce in the strongest terms, these acts of violence and hatred, including incidents of hate speech by certain individuals and groups aimed at inciting violence against the different ethnic and religious communities in our country.We are deeply saddened by the destruction of property and loss of livelihoods as a result of recent incidents, and the pain of mind and fear caused to individuals.We affirm that hate filled expressions and actions by individuals and groups with vested interests, resulting in demeaning, denigrating and inciting violence against fellow citizens of various ethnic, religious backgrounds has no place in Sri Lankan society.While reaffirming the Governments commitment to reconciliation, peace building, peaceful co-existence, and the rule of law, we direct the law enforcement authorities to immediately take all necessary steps in accordance with the law of the land, against instigators and perpetrators of violence and hate speech targeting any religious and ethnic groups in the country. The strictest action must be taken without delay, in accordance with the law, against all persons or groups who act to incite violence, and engage in acts of violence. The law must be applied to all regardless of social status, ethnic or religious background or political affiliations of perpetrators of such acts. We also direct the law enforcement authorities and the Hon. Attorney General to expedite action against those responsible for all atrocities committed, as impunity holds the dangerous possibility of our country receding into conflict. We express our deep appreciation to civil society and religious leaders who have stepped up to counter the attempts of a few to spread hate in our country, and who have called for calm and peaceful co-existence at this time.We take this opportunity to urge the active participation and leadership of all Sri Lankans in efforts aimed at reconciliation and fostering peaceful co-existence in our country, without which, the stability and economic growth and progress that our nation so richly deserves will continue to elude us.Gautama Buddhas Teachings emphasize the importance of co-existence, tolerance, respect and compassion. This nation is blessed by the teachings of the four great religious traditions in the world  Buddhism, Hinduism, Christianity, and Islam  which provide us the guidance required for peaceful co-existence, upholding human values, and honest and hard work required to rebuild our nation as one of the most progressive in the region.We urge all the citizens of this nation, young and old, to contribute their best to our country as patriotic citizens to build a nation that is stable, peaceful, and progressive; a society where the dignity of each individual is upheld; where diversity is respected; and where every individual has the opportunity to enjoy the freedoms that are the rights of equal citizenship.We must all stand united to strive to eliminate this dangerous affliction of hatred towards each other, and resolve that we will never allow ourselves in the present or in the future, to once again be dragged into conflict as in the past.Cabinet of MinistersColombo, 13 June 2017The Cabinet of Ministers issuing a statement said that it directed law enforcement authorities and the Attorney General to take immediate action against instigators and perpetrators of violence and hate speech against religious and ethnic groups. Following is the full statement issued by the Cabinet of Ministers-:The National Unity Government, headed by President Maithripala Sirisena reaffirm commitment, in accordance with the mandates received from the people at the Presidential elections in January and Parliamentary elections of August 2015, to ensure that our nation never again returns to a conflict-ridden past, and instead resolve to guide our nation towards reconciliation, sustainable peace, and economic progress. Communal, ethnic and religious hatred and violence, and impunity have no place in the society that we strive to build.In this context, we are deeply concerned by the recent incidents of violence targeting places of religious worship, shops and business enterprises, and houses. We denounce in the strongest terms, these acts of violence and hatred, including incidents of hate speech by certain individuals and groups aimed at inciting violence against the different ethnic and religious communities in our country.We are deeply saddened by the destruction of property and loss of livelihoods as a result of recent incidents, and the pain of mind and fear caused to individuals.We affirm that hate filled expressions and actions by individuals and groups with vested interests, resulting in demeaning, denigrating and inciting violence against fellow citizens of various ethnic, religious backgrounds has no place in Sri Lankan society.While reaffirming the Governments commitment to reconciliation, peace building, peaceful co-existence, and the rule of law, we direct the law enforcement authorities to immediately take all necessary steps in accordance with the law of the land, against instigators and perpetrators of violence and hate speech targeting any religious and ethnic groups in the country. The strictest action must be taken without delay, in accordance with the law, against all persons or groups who act to incite violence, and engage in acts of violence. The law must be applied to all regardless of social status, ethnic or religious background or political affiliations of perpetrators of such acts. We also direct the law enforcement authorities and the Hon. Attorney General to expedite action against those responsible for all atrocities committed, as impunity holds the dangerous possibility of our country receding into conflict. We express our deep appreciation to civil society and religious leaders who have stepped up to counter the attempts of a few to spread hate in our country, and who have called for calm and peaceful co-existence at this time.We take this opportunity to urge the active participation and leadership of all Sri Lankans in efforts aimed at reconciliation and fostering peaceful co-existence in our country, without which, the stability and economic growth and progress that our nation so richly deserves will continue to elude us.Gautama Buddhas Teachings emphasize the importance of co-existence, tolerance, respect and compassion. This nation is blessed by the teachings of the four great religious traditions in the world  Buddhism, Hinduism, Christianity, and Islam  which provide us the guidance required for peaceful co-existence, upholding human values, and honest and hard work required to rebuild our nation as one of the most progressive in the region.We urge all the citizens of this nation, young and old, to contribute their best to our country as patriotic citizens to build a nation that is stable, peaceful, and progressive; a society where the dignity of each individual is upheld; where diversity is respected; and where every individual has the opportunity to enjoy the freedoms that are the rights of equal citizenship.We must all stand united to strive to eliminate this dangerous affliction of hatred towards each other, and resolve that we will never allow ourselves in the present or in the future, to once again be dragged into conflict as in the past. Cabinet of MinistersColombo, 13 June 2017", 
  "title": "Statement by Cabinet of Ministers on recent attacks on religious places", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1271-statement-by-cabinet-of-ministers-on-recent-attacks-on-religious-places"
}