{
  "date": "2017-06-15", 
  "text": "He expressed the deep condolences of the people of Sri Lanka, to the families and loved ones of those who passed away as a result of this tragedy and conveyed the hope that those who are injured would soon recover.He added that the thoughts and prayers of the people of Sri Lanka are with all those affected by this tragic incident at this time.While there are no reports of any Sri Lankans having been affected by this incident, Minister Karunanayake informed that the Sri Lanka High Commission in London has been instructed to remain alert and assist anyone who may be in need of help. The London Metropolitan Police has set up and emergency number to contact for those that may require help at 08000961233.The following officers at the Sri Lanka High Commission in London have been entrusted with the task of rendering assistance to any Sri Lankans who may need help in connection with this incident:Mr. Priyanka Fernando (Minister Counsellor) -   Mobile: +4474 66779693Mr. Vithurson Vincendrarajan (Third Secretary) -   Mobile: +447538200462Responding to media queries, the Minister of Foreign Affairs Ravi Karunanayake, expressed shock and grief at the tragic loss of life and injury as a result of the devastating fire at Grenfell Tower in London yesterday (14th June). He expressed the deep condolences of the people of Sri Lanka, to the families and loved ones of those who passed away as a result of this tragedy and conveyed the hope that those who are injured would soon recover.He added that the thoughts and prayers of the people of Sri Lanka are with all those affected by this tragic incident at this time.While there are no reports of any Sri Lankans having been affected by this incident, Minister Karunanayake informed that the Sri Lanka High Commission in London has been instructed to remain alert and assist anyone who may be in need of help. The London Metropolitan Police has set up and emergency number to contact for those that may require help at 08000961233.The following officers at the Sri Lanka High Commission in London have been entrusted with the task of rendering assistance to any Sri Lankans who may need help in connection with this incident:Mr. Priyanka Fernando (Minister Counsellor) -   Mobile: +4474 66779693 Mr. Vithurson Vincendrarajan (Third Secretary) -   Mobile: +447538200462", 
  "title": "Foreign Minister condoles over the Fire at Grenfell Tower, London", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1274-foreign-minister-condoles-over-the-fire-at-grenfell-tower-london"
}