{
  "date": "2016-08-08", 
  "text": "The High Commission of Canada, as Patron of the Sri Lanka Canada Business Council (SLCBC), is pleased to have hosted the 25th Annual General Meeting (AGM) of the SLCBC on 4 August 2016.A key stakeholder in strengthening the existing bilateral relations between Sri Lanka and Canada, this marks the silver year of the SLCBCs presence in Sri Lanka under the aegis of the Ceylon Chamber of Commerce as well as engaging with the High Commission of Canada to further enhance trade ties between the two countries. The High Commissioner of Canada, Her Excellency Shelley Whiting, speaking at the event expressed delight that the Sri Lanka Canada Business Council is celebrating 25 years of service to the Sri Lankan business community and was encouraged at the growing interest shown by Canadian companies in Sri Lanka across a multitude of sectors especially in infrastructure, aviation, education and renewable energy with 25% total merchandise trade growth in 2015. She further stated that the AGM was being held shortly after the Official Visit of Canadian Foreign Minister Honorable Stphane Dion to Sri Lanka  the first such visit in 13 years, and noted that in his engagements with the political leadership in Sri Lanka, Minister Dion commented on the growing opportunities for increased bilateral trade and called for stronger commercial ties between Canada and Sri Lanka. The AGM was followed by a networking reception for the local business community, stakeholders in the government and international organizations. The key note address of the evening was delivered by Mr. Rashmika Peiris, Business Director of MAS Holdings, manufacturers of sportswear for Canadian clothing giant Lululemon. The company is a success story of a Canada - Sri Lanka business connection and the speaker shared their experience on positive outcomes of their investment. The membership of the Sri Lanka Canada Business Council is comprised of approximately 60 companies across diverse sectors such as logistics and tourism, imports, exports, manufacturing and services amongst many others. The primary focus of the Council is to facilitate trade between Sri Lanka and Canada, encourage partnerships, exchange of information between the two countries and promote investments. The Business Council also engages with partner organizations in Canada to promote the socio-economic conditions in Sri Lanka.The event is supported by the Trade Commissioner Service (TCS) of the Canadian High Commission in Sri Lanka. The TCS is the Canadian governments network of Trade professionals that promotes Canadian goods and services, facilitates innovation and R&D, as well as builds networks between Sri Lanka and Canada.", 
  "title": "High Commission of Canada hosts the 25th AGM of Sri Lanka  Canada Business Council", 
  "url": "https://www.dgi.gov.lk/news/latest-news/128-high-commission-of-canada-hosts-the-25th-agm-of-sri-lanka-canada-business-council"
}