{
  "date": "June 17, 2017", 
  "text": "The President held a special discussion regarding maintaining rice stocks at warehouses and to look into the demand for rice in the coming months at the Presidential Secretariat, yesterday (16th June).President Sirisena summoned this discussion as he received information that there is a shortage of rice in the market. He also asked the officials regarding the rice stocks at warehouses.The President emphasized the need of maintaining rice stocks at warehouses consistent with the demand for it and said that the Ministry of trade should continuously scrutinize the stocks and the demand.Furthermore, the attention of the President was drawn towards the difficulties faced by the consumers due to selling of rice at prices exceeding the maximum prices set by the Government. He also inquired the officials regarding enforcing the laws against the retailers selling rice at high prices.It was also discussed in detail regarding the ways how to prepare the private sector to import rice according to the demand in the future.President Maithripala Sirisena emphasized that under any circumstance, there should not be a shortage of rice in the market. The President held a special discussion regarding maintaining rice stocks at warehouses and to look into the demand for rice in the coming months at the Presidential Secretariat, yesterday (16th June).President Sirisena summoned this discussion as he received information that there is a shortage of rice in the market. He also asked the officials regarding the rice stocks at warehouses.The President emphasized the need of maintaining rice stocks at warehouses consistent with the demand for it and said that the Ministry of trade should continuously scrutinize the stocks and the demand.Furthermore, the attention of the President was drawn towards the difficulties faced by the consumers due to selling of rice at prices exceeding the maximum prices set by the Government. He also inquired the officials regarding enforcing the laws against the retailers selling rice at high prices.It was also discussed in detail regarding the ways how to prepare the private sector to import rice according to the demand in the future.", 
  "title": "There should be no shortage of rice in the market- President emphasizes", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1282-there-should-be-no-shortage-of-rice-in-the-market-president-emphasizes"
}