{
  "date": "2017-06-19", 
  "text": "He made these remarks participating at the Board of Governors meeting of the Asian Infrastructure Investment Bank which was held in Jeju Island in Republic of Korea from the 16th to the 17th of June 2017. The Minister took part in the Governor's round table discussion on financing Asia's infrastructure priorities.During the discussion the Minister spoke about Sri Lanka's economic growth which has been driven by large infrastructure projects. Developing physical infrastructure must be done along with administrative and legal frameworks to ensure required policy or regulatory support to streamline and boost public and private investments.He also said that the Government's plan is to make Sri Lanka an export driven economic and financial hub of the Indian Ocean, while creating unprecedented opportunities in many sectors. In order to achieve these objectives, the government has set out a high-level reform agenda in several key sectors of the economy, facilitating and empowering the private sector as the principle engine of growth.Formulation of a new trade and investment policy, tax reforms, and various other measures to improve investor climate are also being implemented.Given the rapid increase in climate related disasters in many countries, like the floods Sri Lanka faced two weeks ago, the building of climate/disaster resilient infrastructure will be of paramount importance for the future. If we are to meet this challenge, we must incorporate climate resilient concepts into all future infrastructure development projects.Minister Samaraweera also had the opportunity to meet Kim Dong-yeon, the Deputy Prime Minister and the Minister for Strategy and Finance of Republic of Korea, Arun Jaitley, Finance Minister of India and Sri Mulyani Indrawati, Finance Minister of Indonesia for bilateral discussions on the sidelines of the AIIB Conference.Government's plan is to make Sri Lanka an export driven economic and financial hub of the Indian Ocean, Minister of Finance and Media Mangala Samaraweera said. He made these remarks participating at the Board of Governors meeting of the Asian Infrastructure Investment Bank which was held in Jeju Island in Republic of Korea from the 16th to the 17th of June 2017. The Minister took part in the Governor's round table discussion on financing Asia's infrastructure priorities.During the discussion the Minister spoke about Sri Lanka's economic growth which has been driven by large infrastructure projects. Developing physical infrastructure must be done along with administrative and legal frameworks to ensure required policy or regulatory support to streamline and boost public and private investments.He also said that the Government's plan is to make Sri Lanka an export driven economic and financial hub of the Indian Ocean, while creating unprecedented opportunities in many sectors. In order to achieve these objectives, the government has set out a high-level reform agenda in several key sectors of the economy, facilitating and empowering the private sector as the principle engine of growth.Formulation of a new trade and investment policy, tax reforms, and various other measures to improve investor climate are also being implemented.Given the rapid increase in climate related disasters in many countries, like the floods Sri Lanka faced two weeks ago, the building of climate/disaster resilient infrastructure will be of paramount importance for the future. If we are to meet this challenge, we must incorporate climate resilient concepts into all future infrastructure development projects.Minister Samaraweera also had the opportunity to meet Kim Dong-yeon, the Deputy Prime Minister and the Minister for Strategy and Finance of Republic of Korea, Arun Jaitley, Finance Minister of India and Sri Mulyani Indrawati, Finance Minister of Indonesia for bilateral discussions on the sidelines of the AIIB Conference.", 
  "title": "SL to be export driven economic financial hub  Finance Minister", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1285-sl-to-be-export-driven-economic-financial-hub-finance-minister"
}