{
  "date": "August 11, 2016", 
  "text": "Pakistans Chief of Air Staff, Air Chief Marshal Sohail Aman (NI, HI, SI, TI) called on Hon President of Sri Lanka H.E Maithripala Sirisena at his official residence in Colombo today (August 9).During the meeting, Air Chief Marshal Sohail Aman conveyed best wishes and warm regards from the President and Prime Minister of Pakistan, to President H.E Maithripala Sirisena, as well as Government and people of Sri Lanka.Pakistans Air Chief said that Pakistan and Sri Lanka are historically bonded in a relationship of trust, mutual respect and deep friendship, which is reflected in the strong multifaceted relationship between the two countries. He added that the two brotherly countries have an excellent record of defense sector cooperation.He appreciated the efforts of the Sri Lankan government in defeating the menace of terrorism from Sri Lankan Soil and reiterated Pakistans continuous and unflinching support to Sri Lanka at all forums. H.E Maithripala Sirisena thanked Pakistan for the continuous assistance given to Sri Lanka for training of air force personnel. He also strongly appreciated the all-out support extended by the Government of Pakistan to Sri Lanka at the international forums.The President said Pakistan has proved to be a true friend of Sri Lanka and the Sri Lankan government as well as the people has deep affection for Pakistan.The President said that he is determined to call for regional cooperation for prevention of drugs and narcotics smuggling as the drug menace is harming the youths of our region. He added that he would call for such cooperation at the next Summit of the South Asian Association for Regional Cooperation (SAARC).Air Force Commander Gagana Bulathsinhala and Pakistan High Commissioner Syed Shakeel Hussain were also present on this occasion.Air Chief Marshal Sohail Aman is in Sri Lanka on a two day official visit on the invitation of the Commander of the Sri Lanka Air Force Air Marshal G.P Bulattsinghala.", 
  "title": "Pakistans Air Chief meets Sri Lankan President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/129-pakistan-s-air-chief-meets-sri-lankan-president"
}