{
  "date": "2017-06-21", 
  "text": "He made these remarks addressing the Colombo District Special Environment Conference held at the Maharagama Youth Centre Auditorium, yesterday (20th June).President Sirisena said that many issues have arisen due to the irresponsible involvement of the Ministers and MPs in public protests against disposal of garbage. He added that everybody should fulfill their respective duties towards the country and themselves in the process of the waste management and preventing the spread of Dengue.He also said that a national programme on apprising the public regarding the importance of waste management and recycling will be implemented shortly.The President recalled a recent media report, which stated that the Army Media Spokesperson had said that the Army will not take the responsibility of collecting garbage, and said that the Army Media Spokesperson had not made such statement and as the Minister of Defence he will not under any circumstances will order the Army to collect garbage.The President said that only the responsibility of scrutinizing whether the relevant institutions for waste management and disposal of garbage fulfill their respective duties, is vested with the Army.The President requested all the Ministers, Heads of Corporations, relevant authorities, departments, public servants as well as the school principals to give priority for waste management and preventing the spread of Dengue menace, and to be a messenger to make the public aware in this regard. He also gave instructions to the heads of institution to establish special units for waste management and prevention of Dengue at their respective institutions, if those were not yet established, and to inspect the tasks of those units.President Sirisena further said that what is more important in this situation is to act according to one's own conscience and in a humane manner rather than do things according to the official guiding instructions, Orders and Circulars. This conference was organized under the theme prevention of dengue menace and waste disposal issue as the first conference of a series of Environmental Conferences to be organized at the district level. The second conference will be held in Gampaha district.Specialist Dr. HasithaTissera delivered a special lecture on prevention and control of dengue disease. Senior Lecturer at the University of Moratuwa Dr. Mahesh Jayaweera also delivered a special lecture on waste management.Health Minister Rajitha Senarathne, Western Provincial Governor K.C Logeswaran, Western Province Minister Gamini Thilakasiri, Secretary to the President. P.B Abeykoon, Tri Forces Commanders, and Inspector General of Police also participated on this occasion.President Maithripala Sirisena emphasized that the politicians as well as the public servants should join hands with the public to find solutions for the waste management issue and the Dengue menace. He made these remarks addressing the Colombo District Special Environment Conference held at the Maharagama Youth Centre Auditorium, yesterday (20th June).President Sirisena said that many issues have arisen due to the irresponsible involvement of the Ministers and MPs in public protests against disposal of garbage. He added that everybody should fulfill their respective duties towards the country and themselves in the process of the waste management and preventing the spread of Dengue.He also said that a national programme on apprising the public regarding the importance of waste management and recycling will be implemented shortly.The President recalled a recent media report, which stated that the Army Media Spokesperson had said that the Army will not take the responsibility of collecting garbage, and said that the Army Media Spokesperson had not made such statement and as the Minister of Defence he will not under any circumstances will order the Army to collect garbage.The President said that only the responsibility of scrutinizing whether the relevant institutions for waste management and disposal of garbage fulfill their respective duties, is vested with the Army.The President requested all the Ministers, Heads of Corporations, relevant authorities, departments, public servants as well as the school principals to give priority for waste management and preventing the spread of Dengue menace, and to be a messenger to make the public aware in this regard. He also gave instructions to the heads of institution to establish special units for waste management and prevention of Dengue at their respective institutions, if those were not yet established, and to inspect the tasks of those units.President Sirisena further said that what is more important in this situation is to act according to one's own conscience and in a humane manner rather than do things according to the official guiding instructions, Orders and Circulars. This conference was organized under the theme prevention of dengue menace and waste disposal issue as the first conference of a series of Environmental Conferences to be organized at the district level. The second conference will be held in Gampaha district.Specialist Dr. HasithaTissera delivered a special lecture on prevention and control of dengue disease. Senior Lecturer at the University of Moratuwa Dr. Mahesh Jayaweera also delivered a special lecture on waste management.Health Minister Rajitha Senarathne, Western Provincial Governor K.C Logeswaran, Western Province Minister Gamini Thilakasiri, Secretary to the President. P.B Abeykoon, Tri Forces Commanders, and Inspector General of Police also participated on this occasion.", 
  "title": "Politicians, public servants should work with public to solve waste management and Dengue issues  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1293-politicians-public-servants-should-work-with-public-to-solve-waste-management-and-dengue-issues-president"
}