{
  "date": "2017-06-21", 
  "text": "Speaking at the event, the President said the government is carrying out a comprehensive plan of action to establish permanent peace in the country by building peace and unity among all communities.Islam religious leaders and large number of Islam devotees participated in this event. They commended the Presidents initiatives towards national reconciliation.The President further stated that the same groups who acted against the Muslim people to divide the government and Muslim people in the past are currently engaged in a political conspiracy. The minority communities voted for me at the Presidential Election on January 08 in 2015, expecting a free environment to live and find solutions to critical problems they had been facing. I will fulfill that responsibility towards them, he said.The President requested the Muslim community to recognize the friend and the enemy and not to get entrapped in political conspiracies.Prime Minister Ranil Wickremesinghe, Ministers Faizer Mustafa, Ravi Karunanayake, Rishad Bathiudeen, State Minister A. H. M. Fawzie and the Secretary to the President P. B. Abeykoon were also present on this occasion.President Maithripala Sirisena hosted an Iftar dinner yesterday (20th June) at the Presidents House in Colombo. Speaking at the event, the President said the government is carrying out a comprehensive plan of action to establish permanent peace in the country by building peace and unity among all communities.Islam religious leaders and large number of Islam devotees participated in this event. They commended the Presidents initiatives towards national reconciliation.The President further stated that the same groups who acted against the Muslim people to divide the government and Muslim people in the past are currently engaged in a political conspiracy. The minority communities voted for me at the Presidential Election on January 08 in 2015, expecting a free environment to live and find solutions to critical problems they had been facing. I will fulfill that responsibility towards them, he said.The President requested the Muslim community to recognize the friend and the enemy and not to get entrapped in political conspiracies.Prime Minister Ranil Wickremesinghe, Ministers Faizer Mustafa, Ravi Karunanayake, Rishad Bathiudeen, State Minister A. H. M. Fawzie and the Secretary to the President P. B. Abeykoon were also present on this occasion.", 
  "title": "President hosts Iftar reception", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1294-president-hosts-iftar-reception"
}