{
  "date": "June 23, 2017", 
  "text": "Accordingly, Sri Lanka Army - Humanitarian De-mining Unit (SLA-HDU) together with other International Non-Governmental Organizations (INGOs) and Non-Governmental Organizations (NGOs) had successfully cleared minefields in Batticaloa district.SLA - HDU had cleared 312,111,499 Sq m from 377,026,951 Sq m mine - affected area which accounts for 83 percent from the Confirmed Hazardous Area (CHA). Other 17 percent was cleared by the INGOs and NGOs stakeholders, who joined the de-mining drive in 2009 for the 'District by District' program in Batticaloa.SLA-HDU comprises of 450 Army de-miners and conducts their operations according to the internationally-accepted methods of Manual, Mechanical and Mine Detection Dog (MDD).Minister of Prison Reforms, Rehabilitation, Resettlement and Hindu Religious Affairs D.M.Swaminathan, State Minister of Rehabilitation and Resettlement M.L.A.M. Hizbullah, US Ambassador to Sri Lanka and Maldives Atul Keshap, British High Commissioner for Sri Lanka and Maldives James Dauris, Diplomatic envoys from Canada, Japan and Australia, Chief Minister for Eastern Province, Ministry Secretaries, District Secretary for Batticaloa and representatives of INGOs and NGOs, Army Officers and invitees were present at the occasion.With the end of the conflict in year 2009, army de-miners initiated the de-mining process in previous LTTE dominated areas as the only stakeholder. However, Army de-miners have been involved in mine-field clearing in the country since 2002.The formal declaration to mark 'The First Mine-Affected District of Sri Lanka Reaching a Level of Residual Risk' was signed and handed over by stakeholders during a ceremony held at Batticaloa District Secretariat premises on Wednesday (21st June), states army media. Accordingly, Sri Lanka Army - Humanitarian De-mining Unit (SLA-HDU) together with other International Non-Governmental Organizations (INGOs) and Non-Governmental Organizations (NGOs) had successfully cleared minefields in Batticaloa district.SLA - HDU had cleared 312,111,499 Sq m from 377,026,951 Sq m mine - affected area which accounts for 83 percent from the Confirmed Hazardous Area (CHA). Other 17 percent was cleared by the INGOs and NGOs stakeholders, who joined the de-mining drive in 2009 for the 'District by District' program in Batticaloa.SLA-HDU comprises of 450 Army de-miners and conducts their operations according to the internationally-accepted methods of Manual, Mechanical and Mine Detection Dog (MDD).Minister of Prison Reforms, Rehabilitation, Resettlement and Hindu Religious Affairs D.M.Swaminathan, State Minister of Rehabilitation and Resettlement M.L.A.M. Hizbullah, US Ambassador to Sri Lanka and Maldives Atul Keshap, British High Commissioner for Sri Lanka and Maldives James Dauris, Diplomatic envoys from Canada, Japan and Australia, Chief Minister for Eastern Province, Ministry Secretaries, District Secretary for Batticaloa and representatives of INGOs and NGOs, Army Officers and invitees were present at the occasion.With the end of the conflict in year 2009, army de-miners initiated the de-mining process in previous LTTE dominated areas as the only stakeholder. However, Army de-miners have been involved in mine-field clearing in the country since 2002.", 
  "title": "Batticaloa District landmine free", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1304-batticaloa-district-landmine-free"
}