{
  "date": "2017-06-26", 
  "text": "He said when indirect taxes levied on peoples daily essentials are reduced and the prices of goods will come down sharply.The increased income earned from direct taxes will be invested in mass scale projects to promote economic development, Minister Samaraweera said.The Minister expressed these sentiments when he called on the Malwatte Prelate at his temple in Kandy and received his blessings on 24th June.He was accompanied by development strategies and International Trade Minister Malik Samarawickreme and Finance State Minister Eran Wickremaratne.Minister Samaraweera said there was a large number of tax evaders among those liable to pay income tax. Even high income bracket doctors, lawyers and architects were among the tax evaders.He said the country was in deep crisis when the government took over power after the last Presidential Election. On the other hand, there was a severe setback to democracy. Sri Lanka was isolated by the international community because democracy was in danger and media freedom was crushed with killing, abduction and torture of journalists.As a result of the action taken by the President and the Prime Minister to form a new consensus government by bringing together the two main parties, the future course of the country had been rebuilt on three strong edifies of democracy, harmony and development, Minister Samaraweera said.He said no country could march forward in isolation. The government had succeeded in winning over the maximum international confidence for the country within a short period. One of the striking benefits was the restoration of the GSP Plus facility and the removal of the prohibition on fish exports imposed by Europe.The good governance government had been able to re-establish and strengthen diplomatic ties with several counties and enter into free trade agreements with China, Singapore and India.There was high international recognition of the program of work enunciated by the President and the Prime Minister and countries such as Russia and Australia had established enhanced high level diplomatic relations with Sri Lanka, the Minister said.He said Minister Ravi Karunanayake had rendered a great service by accepting the Finance Ministry portfolio at a most difficult time in the countrys history.The country was engulfed in a severe debt trap when the government assumed power and the debt burden was being systematically decreased today, the Minister said. He said 17 essential items were brought under price control as soon as the government assumed power. He said attracting foreign investment was compulsory in order to develop the country.Minister Samaraweera who also called on Ven. Dimbulkumbure Wimaladhamma and Ven. Niyangoda Sri Vijithasiri Anunayake Theras of the Malwatte Chapter, said the government was keeping a close tab on forces trying to take the country backwards.The SAITM Private University was established during the time of former President Mahinda Rajapakse.SAITM had a peaceful existence for five years but all opposition and demonstrations against it started after this government came to power. He said the GMOA staged a strike even without concern for the patients suffering from dengue.Minister Samaraweera also called on the Asgiriya Prelate at his temple and resumed his blessings. (CDN)Indirect taxes account for 80 percent of the governments tax income. This will be brought down to 60 percent within the next two years bringing tangible relief and benefits to the innocent and poor people, Finance and Mass Media Minister Mangala Samaraweera said. He said when indirect taxes levied on peoples daily essentials are reduced and the prices of goods will come down sharply.The increased income earned from direct taxes will be invested in mass scale projects to promote economic development, Minister Samaraweera said.The Minister expressed these sentiments when he called on the Malwatte Prelate at his temple in Kandy and received his blessings on 24th June.He was accompanied by development strategies and International Trade Minister Malik Samarawickreme and Finance State Minister Eran Wickremaratne.Minister Samaraweera said there was a large number of tax evaders among those liable to pay income tax. Even high income bracket doctors, lawyers and architects were among the tax evaders.He said the country was in deep crisis when the government took over power after the last Presidential Election. On the other hand, there was a severe setback to democracy. Sri Lanka was isolated by the international community because democracy was in danger and media freedom was crushed with killing, abduction and torture of journalists.As a result of the action taken by the President and the Prime Minister to form a new consensus government by bringing together the two main parties, the future course of the country had been rebuilt on three strong edifies of democracy, harmony and development, Minister Samaraweera said.He said no country could march forward in isolation. The government had succeeded in winning over the maximum international confidence for the country within a short period. One of the striking benefits was the restoration of the GSP Plus facility and the removal of the prohibition on fish exports imposed by Europe.The good governance government had been able to re-establish and strengthen diplomatic ties with several counties and enter into free trade agreements with China, Singapore and India.There was high international recognition of the program of work enunciated by the President and the Prime Minister and countries such as Russia and Australia had established enhanced high level diplomatic relations with Sri Lanka, the Minister said.He said Minister Ravi Karunanayake had rendered a great service by accepting the Finance Ministry portfolio at a most difficult time in the countrys history.The country was engulfed in a severe debt trap when the government assumed power and the debt burden was being systematically decreased today, the Minister said. He said 17 essential items were brought under price control as soon as the government assumed power. He said attracting foreign investment was compulsory in order to develop the country.Minister Samaraweera who also called on Ven. Dimbulkumbure Wimaladhamma and Ven. Niyangoda Sri Vijithasiri Anunayake Theras of the Malwatte Chapter, said the government was keeping a close tab on forces trying to take the country backwards.The SAITM Private University was established during the time of former President Mahinda Rajapakse.SAITM had a peaceful existence for five years but all opposition and demonstrations against it started after this government came to power. He said the GMOA staged a strike even without concern for the patients suffering from dengue.Minister Samaraweera also called on the Asgiriya Prelate at his temple and resumed his blessings. (CDN)", 
  "title": "Plans to reduce indirect taxes to 60 percent: Minister Mangala", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1314-plans-to-reduce-indirect-taxes-to-60-percent-minister-mangala"
}