{
  "date": "2017-06-26", 
  "text": "According to the press release, a Special gazette notification including the conditions laid down by the government will be issued. By the press release, the government also expects all students will attend lectures for the sake of their future and the free education.\"This is to inform all that the following matters will be operated as the governments position with regard to the boycott of lectures by university students and the strike at the government hospitals.The government will take following actions on the South Asian Institute of Technology and Medicine (SAITM) issue.The conditions laid down by the government will be stated by a special gazette notification. The gazette notification will include following issues.-Admission of students to SAITM and offer of degrees will be stopped until the SAITM will fulfil relevant conditions of the governments gazette.-As the minimum standards of medical education should be ensured under the law and expeditiously gazette the minimum standards of medical education.-No institute and person should influence the autonomy and the impartiality of Sri Lanka Medical Council (SLMC).-Formation of current courses of SAITM according to a method accepted by the SLMC and forming a system to register the degrees which have already been offered.-Informing the governments position about the SAITM, to the Supreme Court.In addition, actions will be taken to change the administrative structure of the SAITM to be operated as a joint project between the government and private sector.Actions are carried out to take over the hospital of the SAITM by the government.A suitable program will be formed to list the SAITM in share market to gain required funds to SAITM or establish a trust with government/private fund through discussions.The government with new approach expects to discuss with related parties to solve any issues which are not mentioned above. The governments objective is to provide solutions to all those issues.As there is a possibility to solve any other problem which is not mentioned above, the government expects all university students who are not attending to lectures will attend their lectures. The government also expects them to think about their personal future and consider the huge expenditure by the government for the free education, and will act to achieve the common goals expected by the government through free education.The matters included in this notice were declared taking the submissions and proposals of the Ministry of Higher Education, Ministry of Health and other relevant institutes, students, lecturers and the parents of students, Government Medical Officers Association, Association of Medical Specialists and other parties which are interested in this matter. The government expects all students will attend lectures by using their intelligence and the conscience for the sake of their future and the free education. The government also thanks all doctors who reported for duty, ending up the strike.\"Secretary to the President P. B. Abeykoon under the directive of President Maithripala Sirisena has issued following press release mentioning the actions will be taken by the government on SAITM issue. According to the press release, a Special gazette notification including the conditions laid down by the government will be issued. By the press release, the government also expects all students will attend lectures for the sake of their future and the free education.\"This is to inform all that the following matters will be operated as the governments position with regard to the boycott of lectures by university students and the strike at the government hospitals.The government will take following actions on the South Asian Institute of Technology and Medicine (SAITM) issue.The conditions laid down by the government will be stated by a special gazette notification. The gazette notification will include following issues.-Admission of students to SAITM and offer of degrees will be stopped until the SAITM will fulfil relevant conditions of the governments gazette.-As the minimum standards of medical education should be ensured under the law and expeditiously gazette the minimum standards of medical education.-No institute and person should influence the autonomy and the impartiality of Sri Lanka Medical Council (SLMC).-Formation of current courses of SAITM according to a method accepted by the SLMC and forming a system to register the degrees which have already been offered.-Informing the governments position about the SAITM, to the Supreme Court.In addition, actions will be taken to change the administrative structure of the SAITM to be operated as a joint project between the government and private sector.Actions are carried out to take over the hospital of the SAITM by the government.A suitable program will be formed to list the SAITM in share market to gain required funds to SAITM or establish a trust with government/private fund through discussions.The government with new approach expects to discuss with related parties to solve any issues which are not mentioned above. The governments objective is to provide solutions to all those issues.As there is a possibility to solve any other problem which is not mentioned above, the government expects all university students who are not attending to lectures will attend their lectures. The government also expects them to think about their personal future and consider the huge expenditure by the government for the free education, and will act to achieve the common goals expected by the government through free education.The matters included in this notice were declared taking the submissions and proposals of the Ministry of Higher Education, Ministry of Health and other relevant institutes, students, lecturers and the parents of students, Government Medical Officers Association, Association of Medical Specialists and other parties which are interested in this matter. The government expects all students will attend lectures by using their intelligence and the conscience for the sake of their future and the free education. The government also thanks all doctors who reported for duty, ending up the strike.\" ", 
  "title": "Press Release issued by Presidents Secretary on SAITM issue", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1315-press-release-issued-by-president-s-secretary-on-saitm-issue"
}