{
  "date": "June 27, 2017", 
  "text": "Journalists serving in recognized electronic and print institutions island-wide on full time or part time basis, freelance journalists, provincial journalists and web journalists, who have completed a three year service period and between 18-55 years of age are eligible to apply for the scholarship.Selected journalists will be granted financial assistance for their training courses directly linked to the field of media to a maximum of Rs. 100, 000. Applicants should not be benefitted from the AsiDisi Scholarship Program earlier.Applications should be sent through registered post to Director (Media), Ministry of Finance and Mass Media, No 163, Kirulapone Avenue, Polhengoda, Colombo 05 before 31st July 2017.For further details contact 011 - 2, 513 645, 011 - 2 513 459 and 011 - 2 513 460 and log on to www.media.gov.lk for the application.Ministry of Finance and Mass Media has called applications from journalists for AsiDisi Media Scholarship Program - 2017, which will provide financial assistance for the training courses of journalists. Journalists serving in recognized electronic and print institutions island-wide on full time or part time basis, freelance journalists, provincial journalists and web journalists, who have completed a three year service period and between 18-55 years of age are eligible to apply for the scholarship.Selected journalists will be granted financial assistance for their training courses directly linked to the field of media to a maximum of Rs. 100, 000. Applicants should not be benefitted from the AsiDisi Scholarship Program earlier.Applications should be sent through registered post to Director (Media), Ministry of Finance and Mass Media, No 163, Kirulapone Avenue, Polhengoda, Colombo 05 before 31st July 2017.For further details contact 011 - 2, 513 645, 011 - 2 513 459 and 011 - 2 513 460 and log on to www.media.gov.lk for the application.", 
  "title": "Application called for AsiDisi media scholarship  2017", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1318-application-called-for-asidisi-media-scholarship-2017"
}