{
  "date": "2017-06-29", 
  "text": "The Government launched this project with the aim of relocating of households presently located in undeserved settlements in the city of Colombo.This housing scheme was constructed under the Urban Regeneration Program by the Urban Development Authority with the guidance of the Ministry of Megapolis and Western Development. The Housing Complex consisted of 192 housing units and built at the cost of Rs 672 million.The Lakhiru Sevana entire project consisted of 768 housing units. Accordingly, another three housing blocks consisting 192 housing units in each will be constructed in the future and those houses will be provided for the families around Maligawatta area and for the Sri Lanka Railway Department to use as quarters for its employees.After unveiling the plaque of the new project, the President made an inspection tour in two houses of Housing Complex.Prime Minister Ranil Wickramasinghe, Ministers Patali Champika Ranawaka, Nimal Siripala de Silva, Sarath Fonseka, State Minister A.H.M. Fauzi, Deputy Minister Lasantha Alagiyawanna, MP Mujibur Rahman and many others participatedPresident Maithripala Sirisena vested the first phase of the Lakhiru Sevana Housing Complex in Maligawatta, with the public, yesterday (28th June). The Government launched this project with the aim of relocating of households presently located in undeserved settlements in the city of Colombo.This housing scheme was constructed under the Urban Regeneration Program by the Urban Development Authority with the guidance of the Ministry of Megapolis and Western Development. The Housing Complex consisted of 192 housing units and built at the cost of Rs 672 million.The Lakhiru Sevana entire project consisted of 768 housing units. Accordingly, another three housing blocks consisting 192 housing units in each will be constructed in the future and those houses will be provided for the families around Maligawatta area and for the Sri Lanka Railway Department to use as quarters for its employees.After unveiling the plaque of the new project, the President made an inspection tour in two houses of Housing Complex.Prime Minister Ranil Wickramasinghe, Ministers Patali Champika Ranawaka, Nimal Siripala de Silva, Sarath Fonseka, State Minister A.H.M. Fauzi, Deputy Minister Lasantha Alagiyawanna, MP Mujibur Rahman and many others participated", 
  "title": "First phase of  Lakhiru Sevana Housing Complex opens", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1332-first-phase-of-lakhiru-sevana-housing-complex-opens"
}