{
  "date": "July 02, 2017", 
  "text": "The conference was aimed at bringing together a range of stakeholders from across diverse sectors in order to help promote the discourse surrounding the adoption of constitutional reforms for the people of Sri Lanka.The former Deputy Chief Justice of South Africa, Justice Dikgang Moseneke, Deputy Speaker of Parliament and the Deputy Chairman of the Constitutional Assembly Thilanga Sumathipala, Members of the Constitutional Assembly, foreign envoys, Provincial government representatives, key officials from state institutions, representatives from NGOs, Experts and members of academia participated on this occasion.Prime Minister Wickremesinghe delivered an informative speech touching on the process and current challenges encountered in the business of constitution making, with references to key issues of national interest such as the nature of the state, the electoral system, the system of devolution of power and the religion of the state. Justice Dikgang Moseneke spoke on the topic of Reaching a Consensus on the Constitution  the South African Experience. He highlighted the myriad challenges during the drafting of the interim constitution for South Africa and how the South African people overcame these challenges to create for themselves a document that embodied common values of unity, diversity, reconciliation, democracy and consensus on fundamental rights and freedoms.Former president of Sri Lanka Chandrika Bandaranaike Kumaratunga, also addressed the gathering on the pressing need for constitutional reforms in Sri Lanka and the multiple challenges that need to be overcome when creating a constitution that is the supreme law of the land.The first National Conference on Constitutional Reforms organized by the Constitutional Assembly Secretariat of Sri Lanka was held on 28th June at BMICH under the patronage of Prime Minister Ranil Wickremesinghe. The conference was aimed at bringing together a range of stakeholders from across diverse sectors in order to help promote the discourse surrounding the adoption of constitutional reforms for the people of Sri Lanka.The former Deputy Chief Justice of South Africa, Justice Dikgang Moseneke, Deputy Speaker of Parliament and the Deputy Chairman of the Constitutional Assembly Thilanga Sumathipala, Members of the Constitutional Assembly, foreign envoys, Provincial government representatives, key officials from state institutions, representatives from NGOs, Experts and members of academia participated on this occasion.Prime Minister Wickremesinghe delivered an informative speech touching on the process and current challenges encountered in the business of constitution making, with references to key issues of national interest such as the nature of the state, the electoral system, the system of devolution of power and the religion of the state. Justice Dikgang Moseneke spoke on the topic of Reaching a Consensus on the Constitution  the South African Experience. He highlighted the myriad challenges during the drafting of the interim constitution for South Africa and how the South African people overcame these challenges to create for themselves a document that embodied common values of unity, diversity, reconciliation, democracy and consensus on fundamental rights and freedoms.Former president of Sri Lanka Chandrika Bandaranaike Kumaratunga, also addressed the gathering on the pressing need for constitutional reforms in Sri Lanka and the multiple challenges that need to be overcome when creating a constitution that is the supreme law of the land.", 
  "title": "National Conference on Constitutional Reforms held", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1341-national-conference-on-constitutional-reforms-held"
}