{
  "date": "July 02, 2017", 
  "text": "It is essential to develop the gem industry, but we should ensure the right of future generations to live in this area. Therefore, everybody including the business community should fulfil their responsibility to stop the environmental pollution, he said.The president was speaking at a ceremony to open several new buildings in the General Hospital in Ratnapura on 30th June.He stated that the environmental pollution caused by the illegal gem mining has become a major reason for earth slips and the flood in Ratnapura District. This was revealed in a research carried out by the National Building Construction Research Institute.Commenting on the statements by some groups which indicate that some destructions are occurred due to the movements of the planets related to the governing people, the President said all countries in world has to face some climate changes caused by the global warming. We cannot avoid the challenges of the climate. We should adjust with the nature, he said.The new children ward, blood bank, blood dialysis unit and X Ray Unit built at a cost of Rs. 100 million in the General Hospital in Ratnapura were declared open by the President.There buildings were sponsored by local donors and the donation by the American citizen Louise Allen. The president presented a souvenir to Mr. Louise.He also registered the first patient to the childrens ward.If we want to continue the existence of Ratnapura District for more than twenty-five years we should stop the environmental destruction there, says President Maithripala Sirisena. It is essential to develop the gem industry, but we should ensure the right of future generations to live in this area. Therefore, everybody including the business community should fulfil their responsibility to stop the environmental pollution, he said.The president was speaking at a ceremony to open several new buildings in the General Hospital in Ratnapura on 30th June.He stated that the environmental pollution caused by the illegal gem mining has become a major reason for earth slips and the flood in Ratnapura District. This was revealed in a research carried out by the National Building Construction Research Institute.Commenting on the statements by some groups which indicate that some destructions are occurred due to the movements of the planets related to the governing people, the President said all countries in world has to face some climate changes caused by the global warming. We cannot avoid the challenges of the climate. We should adjust with the nature, he said.The new children ward, blood bank, blood dialysis unit and X Ray Unit built at a cost of Rs. 100 million in the General Hospital in Ratnapura were declared open by the President.There buildings were sponsored by local donors and the donation by the American citizen Louise Allen. The president presented a souvenir to Mr. Louise.He also registered the first patient to the childrens ward.", 
  "title": "Everybody is responsible to stop environmental pollution in Rathnapura District  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1342-everybody-is-responsible-to-stop-environmental-pollution-in-rathnapura-district-president"
}