{
  "date": "2017-07-03", 
  "text": "This was designed to support the Public Private People Partnership (4Ps), focusing the smallholder farmers to develop the agribusiness value chain - which encompasses agricultural production, processing, distribution and marketing which will help smallholder farmers to increase their incomes, improve employment opportunities and household nutrition in rural areas.The programme will provide a platform for 57,500 poor rural households to increase their income and food security by expanding livelihood and business opportunities. This will also facilitate women and young people, to access financing and business training enabling them to form partnerships with each other and with the private sector.The total investment over the six-year implementation period is estimated at USD 105 million (LKR 17 billion), including IFAD financing of USD 33.7 million with the contribution of financial institutions, private sector, beneficiaries and the Government.The program will have the national coverage and preference will be given to poor rural householders in low income districts and areas where agri- production potential is high.Dr. R.H.S. Samarathunga, Secretary to the Ministry of Finance and Mass Media on behalf of the Government of Sri Lanka and Gilbert F. Houngbo, President of IFAD, signed the Financial Agreement to obtain USD 33.7 million as the loan for this Program in Rome, Italy.International Fund for Agricultural Development (IFAD) and the Government of Sri Lanka signed Financial Agreement on 26th June for the implementation of the Smallholder Agribusiness Partnership (SAP) Program. This was designed to support the Public Private People Partnership (4Ps), focusing the smallholder farmers to develop the agribusiness value chain - which encompasses agricultural production, processing, distribution and marketing which will help smallholder farmers to increase their incomes, improve employment opportunities and household nutrition in rural areas.The programme will provide a platform for 57,500 poor rural households to increase their income and food security by expanding livelihood and business opportunities. This will also facilitate women and young people, to access financing and business training enabling them to form partnerships with each other and with the private sector.The total investment over the six-year implementation period is estimated at USD 105 million (LKR 17 billion), including IFAD financing of USD 33.7 million with the contribution of financial institutions, private sector, beneficiaries and the Government.The program will have the national coverage and preference will be given to poor rural householders in low income districts and areas where agri- production potential is high.Dr. R.H.S. Samarathunga, Secretary to the Ministry of Finance and Mass Media on behalf of the Government of Sri Lanka and Gilbert F. Houngbo, President of IFAD, signed the Financial Agreement to obtain USD 33.7 million as the loan for this Program in Rome, Italy.", 
  "title": "IFAD provides financial assistance for SAP Program", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1345-ifad-provides-financial-assistance-for-sap-program"
}