{
  "date": "July 04, 2017", 
  "text": "The representatives briefed Minister Samaraweera on various investment projects undertaken by the Japanese Chamber of Commerce and Industry in the country and exchanged views on ease of doing business in Sri Lanka.The Japanese delegation apprised the Minister of issues faced by investors with regard to various tax reforms implemented time to time. They stated that most of their products are being exported under forward contract with buyers and any sudden amendment to the tax regime may affect their exports.The Japanese delegates requested the Finance Minister to give them at least six months notice prior to the enforcement of any tax amendments, as it might have an adverse impact on exports.Minister Samaraweera stated that since Sri Lanka intends to implement an investor and export friendly economic policy, the Government would implement tax reforms favorable to exports.The Japanese Ambassador was accompanied by a high-profile business delegation consisting of the Chairman/President of Training and Service Industry Group of Mitsubishi Corporation Mr. EijiSuga, Vice Chairman of Taisei CorporationMr. Hiroki Horikawa, Vice Chairman of Noritake Lanka Porcelain Mr.YoshinariShimaya, Vice President of Itochu Corporation Mr.Akira Matsui, Vice President of Oriental Consultants Mr.Noboru Kitazawa, Vice President of YKK Lanka Mr.RyuheiNagahata and Secretary General of the Japan External Trade Organisation (JETRO) Mr.Kazuhiko Obama.A delegation of representatives from the Japanese Chamber of Commerce and Industry in Sri Lanka, accompanied by the Japanese Ambassador to Sri Lanka, Kenichi Suganuma, called on the Minister of Finance and Media Mangala Samaraweera at the Ministry of Finance on Monday (3rd July). The representatives briefed Minister Samaraweera on various investment projects undertaken by the Japanese Chamber of Commerce and Industry in the country and exchanged views on ease of doing business in Sri Lanka.The Japanese delegation apprised the Minister of issues faced by investors with regard to various tax reforms implemented time to time. They stated that most of their products are being exported under forward contract with buyers and any sudden amendment to the tax regime may affect their exports.The Japanese delegates requested the Finance Minister to give them at least six months notice prior to the enforcement of any tax amendments, as it might have an adverse impact on exports.Minister Samaraweera stated that since Sri Lanka intends to implement an investor and export friendly economic policy, the Government would implement tax reforms favorable to exports.The Japanese Ambassador was accompanied by a high-profile business delegation consisting of the Chairman/President of Training and Service Industry Group of Mitsubishi Corporation Mr. EijiSuga, Vice Chairman of Taisei CorporationMr. Hiroki Horikawa, Vice Chairman of Noritake Lanka Porcelain Mr.YoshinariShimaya, Vice President of Itochu Corporation Mr.Akira Matsui, Vice President of Oriental Consultants Mr.Noboru Kitazawa, Vice President of YKK Lanka Mr.RyuheiNagahata and Secretary General of the Japan External Trade Organisation (JETRO) Mr.Kazuhiko Obama.", 
  "title": "Govt. ready to facilitate an export friendly economic policy: Finance Minister", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1354-govt-ready-to-facilitate-an-export-friendly-economic-policy-finance-minister"
}