{
  "date": "July 06, 2017", 
  "text": "He said that still there is no a final draft on the proposed body, but only the discussion paper prepared by the Sub-Committee appointed in this regard is available. Eight media organizations had participated in the basic discussions in July last year and set up the above Sub-Committee. The five-member Sub Committee includes Ms. Seetha Ranjani, Upali Arambewela, Dharmasiri Lankapedi, N.M. Ameen and is headed by Wijayananda Jayaweera. All the activities related to this process are being conducted by this subcommittee.Dr. Kalansooriya made these remarks answering questions raised by journalists today (5th July) at the weekly Cabinet Press Briefing in Colombo.According to Dr. Kalansooriya, as his department was not capable of bearing a huge cost, financial support was obtained from an International Organization to conduct Consultation programs in all 25 districts.When asked by the journalists, the Director General further said that the arrival of Mr. Toby Mendel in the island last week took place as part of these consultation programs and neither the government nor the Department of Government Information has any connection for his coming. He further said that Mr. Mendel was not selected by himself.Floor is still open for any media organization or individual to present their suggestions on the proposed Independence Media Regulatory Body, Director General of Government Information Dr. Ranga Kalansooriya said. He said that still there is no a final draft on the proposed body, but only the discussion paper prepared by the Sub-Committee appointed in this regard is available. Eight media organizations had participated in the basic discussions in July last year and set up the above Sub-Committee. The five-member Sub Committee includes Ms. Seetha Ranjani, Upali Arambewela, Dharmasiri Lankapedi, N.M. Ameen and is headed by Wijayananda Jayaweera. All the activities related to this process are being conducted by this subcommittee.Dr. Kalansooriya made these remarks answering questions raised by journalists today (5th July) at the weekly Cabinet Press Briefing in Colombo.According to Dr. Kalansooriya, as his department was not capable of bearing a huge cost, financial support was obtained from an International Organization to conduct Consultation programs in all 25 districts.When asked by the journalists, the Director General further said that the arrival of Mr. Toby Mendel in the island last week took place as part of these consultation programs and neither the government nor the Department of Government Information has any connection for his coming. He further said that Mr. Mendel was not selected by himself.", 
  "title": "DG clarifies doubts on Independence Media Regulatory Body", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1358-dg-clarifies-doubts-on-independence-media-regulatory-body"
}