{
  "date": "July 06, 2017", 
  "text": "The SLFP and its trade union movement were humanitarian movements forwarded through one path, he said.The President was speaking at the opening ceremony of the newly built office for the Sri Lanka Freedom Trade Union Federation, in the premises of the SLFP headquarters in Colombo. The President unveiled the plaque and marked the souvenir book for special guests.Vice President of the Sri Lanka Freedom Trade Union Federation, Senior Vice President of the SLFP W. D. J. Senevirathne presented a special proposal to the President on this occasion.The President presented souvenirs to three seniors of the Sri Lanka Freedom Trade Union Federation.General Secretary of the UPFA Minister Mahinda Amaraweera, State Minister Lakshman Yapa Abeywardena, Former Minister Athavuda Senevirathne, General Secretary of Sri Lanka Nidahas Sevaka Sangamaya Leslie Devendra, and General Secretary of the Sri Lanka Freedom Trade Union Federation W. Roy de Mel were among those participated on this occasion.President Maithripala Sirisena says the Trade Union Movement of the Sri Lanka Freedom Party (SLFP) contributed to make a huge transformation in the economic, social and cultural sectors of the country. The SLFP and its trade union movement were humanitarian movements forwarded through one path, he said.The President was speaking at the opening ceremony of the newly built office for the Sri Lanka Freedom Trade Union Federation, in the premises of the SLFP headquarters in Colombo. The President unveiled the plaque and marked the souvenir book for special guests.Vice President of the Sri Lanka Freedom Trade Union Federation, Senior Vice President of the SLFP W. D. J. Senevirathne presented a special proposal to the President on this occasion.The President presented souvenirs to three seniors of the Sri Lanka Freedom Trade Union Federation.General Secretary of the UPFA Minister Mahinda Amaraweera, State Minister Lakshman Yapa Abeywardena, Former Minister Athavuda Senevirathne, General Secretary of Sri Lanka Nidahas Sevaka Sangamaya Leslie Devendra, and General Secretary of the Sri Lanka Freedom Trade Union Federation W. Roy de Mel were among those participated on this occasion.", 
  "title": "TU Movement of SLFP contributed transformations of the country  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1359-tu-movement-of-slfp-contributed-transformations-of-the-country-president"
}