{
  "date": "2017-07-06", 
  "text": "The MoUs are scheduled to be signed on 11th July in Colombo.The new factories will be set up in Horana, Kalutara, Koggala and Kandy generating nearly 2,000 job opportunities. Construction of several factories has already commenced.The managing authorities of the companies met the Ministry of Health, Nutrition and Indigenous Medicine Dr. Rajitha Senarathne recently at the Health Ministry and discussed the issues pertaining to the establishment of new factories.The drugs to be manufactured by these factories will be used in government hospitals. According to the Minister Dr. Rajitha Senarathne, with the implementation of this project, the government will be able to save approximately Rs. 45 billion, which is spent annually for the importation of drugs.He further added that it was his aim to locally manufacture nearly 75 percent of the drug requirement of the country by the end of 2018.Ministry of Health, Nutrition and Indigenous Medicine will sign 33 MoUs with 23 drug manufacturing companies to locally manufacture drugs for the State Pharmaceuticals Corporation of Sri Lanka. The MoUs are scheduled to be signed on 11th July in Colombo.   The new factories will be set up in Horana, Kalutara, Koggala and Kandy generating nearly 2,000 job opportunities. Construction of several factories has already commenced.  The managing authorities of the companies met the Ministry of Health, Nutrition and Indigenous Medicine Dr. Rajitha Senarathne recently at the Health Ministry and discussed the issues pertaining to the establishment of new factories.   The drugs to be manufactured by these factories will be used in government hospitals. According to the Minister Dr. Rajitha Senarathne, with the implementation of this project, the government will be able to save approximately Rs. 45 billion, which is spent annually for the importation of drugs.    He further added that it was his aim to locally manufacture nearly 75 percent of the drug requirement of the country by the end of 2018.", 
  "title": "23 companies to join local drug manufacturing", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1361-23-companies-to-join-local-drug-manufacturing"
}