{
  "date": "2017-07-07", 
  "text": "The President was speaking at a discussion he had with Maha Sangha led by Maha Nayaka Theros yesterday (6th July) at the Presidents House in Kandy.President Sirisena said no document on a new constitution has been drafted so far. We know there is a debate in the country on a new constitution. But if the government is going to formulate such a draft, it will be done after a deep study on the future and stability of the country, he said.The Maha Sangha presented their ideas and proposals on the political, social, economic and religious matters, to the President during this meeting. They presented a list of proposals related to these matters.Maha Nayaka of Malwathu Chapter of Siyam Maha Nikaya Most Ven. Thibbatuwawe Sri Sumangala Thero, Maha Nayaka of Asgiri Sector Most Ven. Warakagoka Sri Gnanarathana Thero, and Maha Nayaka of Ramanna Maha Nikaya Most Ven. Napane Premasiri Thero were among those joined this discussion.Minister Wijeyadasa Rajapakshe, Governor of the Central Province Niluka Ekanayake and the Chief Minister Sarath Ekanayake also joined this discussion.President Maithripala Sirisena says if the government is going to formulate even a draft for a new constitution, the venerable Maha Sangha will be kept informed and the government will take the ideas and proposals from the Maha Sangha for that. The President was speaking at a discussion he had with Maha Sangha led by Maha Nayaka Theros yesterday (6th July) at the Presidents House in Kandy.President Sirisena said no document on a new constitution has been drafted so far. We know there is a debate in the country on a new constitution. But if the government is going to formulate such a draft, it will be done after a deep study on the future and stability of the country, he said.The Maha Sangha presented their ideas and proposals on the political, social, economic and religious matters, to the President during this meeting. They presented a list of proposals related to these matters.Maha Nayaka of Malwathu Chapter of Siyam Maha Nikaya Most Ven. Thibbatuwawe Sri Sumangala Thero, Maha Nayaka of Asgiri Sector Most Ven. Warakagoka Sri Gnanarathana Thero, and Maha Nayaka of Ramanna Maha Nikaya Most Ven. Napane Premasiri Thero were among those joined this discussion.Minister Wijeyadasa Rajapakshe, Governor of the Central Province Niluka Ekanayake and the Chief Minister Sarath Ekanayake also joined this discussion.", 
  "title": "Maha Sangha will be kept informed even about a draft of a constitution  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1363-maha-sangha-will-be-kept-informed-even-about-a-draft-of-a-constitution-president"
}