{
  "date": "July 09, 2017", 
  "text": "SriLankan Airlines, the largest foreign airline operating to India, is proud to commence operations to Visakhapatnam in Andhra Pradesh from today. Accordingly, the airline will be offering a four-times-a-week service to Visakhapatnam connecting the states largest city and financial capital to the world through its global route network.Known as the jewel of Indias east coast, Visakhapatnam is one of three cities in India that SriLankan is adding to its network within a nine-day period, together with Hyderabad on 12th July and Coimbatore on 16th July. This will bring SriLankans total operations in India to 126 weekly flights to 14 cities, with its existing operations to Chennai, Trichy, Trivandrum, Mumbai, New Delhi, Gaya, Madurai, Varanasi, Kochi, Bangalore and Kolkata.SriLankan Airlines Chief Commercial Officer Mr. Siva Ramachandran said: Travelers to and from Visakhapatnam can now enjoy SriLankan award winning hospitality onboard. This new destination addition to our network indeed reflects SriLankan Airlines commitment in serving Asian region offering travelers seamless connectivity on board of our brand new A320neo and A321neo aircraft.Being the 12th destination to India by SriLankan, this new service would also allow travelers from Visakhapatnam to enjoy Sri Lankas many tourist attractions and experience for themselves the reasons why the island is fast becoming one of the most highly sought after tourism destinations in the world.The addition of Visakhapatnam, Hyderabad and Coimbatore will increase SriLankans global route network to 105 cities in 47 countries. As a member of the prestigious oneworld alliance, SriLankan also offers its passengers connectivity to over 1,000 cities in 160 countries that are served by its oneworld partner airlines.SriLankan would also offer all industries in Visakhapatnam, one of the fastest growing economic regions in India, enhanced opportunities for rapidly and seamlessly transport of all types of cargo throughout its network.SriLankan Airlines, the largest foreign airline operating to India, is proud to commence operations to Visakhapatnam in Andhra Pradesh from today. Accordingly, the airline will be offering a four-times-a-week service to Visakhapatnam connecting the states largest city and financial capital to the world through its global route network.Known as the jewel of Indias east coast, Visakhapatnam is one of three cities in India that SriLankan is adding to its network within a nine-day period, together with Hyderabad on 12th July and Coimbatore on 16th July. This will bring SriLankans total operations in India to 126 weekly flights to 14 cities, with its existing operations to Chennai, Trichy, Trivandrum, Mumbai, New Delhi, Gaya, Madurai, Varanasi, Kochi, Bangalore and Kolkata.SriLankan Airlines Chief Commercial Officer Mr. Siva Ramachandran said: Travelers to and from Visakhapatnam can now enjoy SriLankan award winning hospitality onboard. This new destination addition to our network indeed reflects SriLankan Airlines commitment in serving Asian region offering travelers seamless connectivity on board of our brand new A320neo and A321neo aircraft.Being the 12th destination to India by SriLankan, this new service would also allow travelers from Visakhapatnam to enjoy Sri Lankas many tourist attractions and experience for themselves the reasons why the island is fast becoming one of the most highly sought after tourism destinations in the world.The addition of Visakhapatnam, Hyderabad and Coimbatore will increase SriLankans global route network to 105 cities in 47 countries. As a member of the prestigious oneworld alliance, SriLankan also offers its passengers connectivity to over 1,000 cities in 160 countries that are served by its oneworld partner airlines.SriLankan would also offer all industries in Visakhapatnam, one of the fastest growing economic regions in India, enhanced opportunities for rapidly and seamlessly transport of all types of cargo throughout its network.The flight schedule is as follows: From To Departure Arrival Days of operation Colombo Visakhapatnam 0710 hrs. (local time) 0910 hrs. (local time) Tuesday, Thursday, Saturday, Sunday Visakhapatnam Colombo 1010 hrs (local time) 1215 hrs (local time) For more information please visit www.srilankan.com", 
  "title": "SriLankan Airlines connects Visakhapatnam to the world", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1373-srilankan-airlines-connects-visakhapatnam-to-the-world"
}