{
  "date": "2017-07-09", 
  "text": "Having identified the need for developing the infrastructure such as rural roads, medium and small size irrigation and rural and urban water supply, the Government of Sri Lanka has decided to implement Rural Infrastructure Development Project in Emerging Regions and Kalu Ganga Water Supply Expansion Project (I).As a result of bilateral discussions had with the Government of Japan, the Government of Japan has agreed to provide two concessional loans amounting to Japanese Yen 44,767 million (Approximately Rs. 60,407 million) through the Japan International Cooperation Agency (JICA) for the implementation of the above Rural Infrastructure Development & Water Supply Projects.Rural Infrastructure Development Project in Emerging RegionsAs highlighted by the Economic Policy Statement of the Hon. Prime Minister in November 2015, the Government is in the process of rebuilding of conflict affected areas through improvement of basic infrastructure to promote the regional economies. Rural Infrastructure Development Project in Emerging Regions is aligned with the above development policy of the Government by aiming at improving the living standards of the people through developing the basic infrastructure in the emerging regions in Sri Lanka.Accordingly, the Government of Japan has agreed to provide a concessional loan of Japanese Yen 12,957 million (17,431 million) for the above project to improve living standards and to develop livelihoods through improvement of basic infrastructure, such as rural roads, medium and small size irrigation and rural water supply facilities in Northern, Eastern, North Central and Uva Provinces, thereby contributing to development of rural economies and reducing regional disparities in the country.Kalu Ganga Water Supply Expansion Project (I)Western Province comprised of Colombo, Gampaha and Kalutara Distrcts is the centre of Sri Lankas economic and social activities with relatively developed infrastructure facilities. However, the coverage of pipe borne water supply in Kalutara District is approximately 37.1% and recorded as the lowest in Western Province. Moreover, due to recent rapid urbanization, it is estimated that the service population of current Kalu Ganga Water Supply System will be increased by 45.8% from 2015 to 2025. In order to respond to increasing demand, augmentation of Kalu Ganga Water Supply System and Non revenue Water reduction is imperative.Accordingly, the Government of Japan has agreed to provide a concessional loan of Japanese Yen 31,810 million (Approximately Rs. 42,976 million) to implement Kalu Ganga Water Supply Expansion Project (I) to provide safe water and increase water supply efficiency in the southern area of the Western Province by expanding Kalu Ganage water supply facilities and restructuring water distribution networks, thereby contributing to the improvement of the living conditions of the people. Accordingly, it is expected to expand Kalu Ganga Water Supply System and to reduce Non Revenue Water by restructuring water distribution networks in Dehiwala and Moratuwa areas.The Exchange of Notes of the above projects were signed between the Government of Sri Lanka and the Government of Japan during the Hon. Prime Ministers visit to Japan in April 2017. The signing of Loan Agreements pertaining to the above loans took place today, at the Ministry of Finance & Mass Media. Dr. R.H.S Samaratunga, Secretary, Ministry of Finance & Mass Media on behalf of the Government of Sri Lanka and Mr. Fusato Tanaka, Chief Representative of JICA Sri Lanka Office on behalf of JICA signed the above Loan Agreements.Ministry of Finance & Mass MediaHaving identified the need for developing the infrastructure such as rural roads, medium and small size irrigation and rural and urban water supply, the Government of Sri Lanka has decided to implement Rural Infrastructure Development Project in Emerging Regions and Kalu Ganga Water Supply Expansion Project (I).As a result of bilateral discussions had with the Government of Japan, the Government of Japan has agreed to provide two concessional loans amounting to Japanese Yen 44,767 million (Approximately Rs. 60,407 million) through the Japan International Cooperation Agency (JICA) for the implementation of the above Rural Infrastructure Development & Water Supply Projects.Rural Infrastructure Development Project in Emerging RegionsAs highlighted by the Economic Policy Statement of the Hon. Prime Minister in November 2015, the Government is in the process of rebuilding of conflict affected areas through improvement of basic infrastructure to promote the regional economies. Rural Infrastructure Development Project in Emerging Regions is aligned with the above development policy of the Government by aiming at improving the living standards of the people through developing the basic infrastructure in the emerging regions in Sri Lanka.Accordingly, the Government of Japan has agreed to provide a concessional loan of Japanese Yen 12,957 million (17,431 million) for the above project to improve living standards and to develop livelihoods through improvement of basic infrastructure, such as rural roads, medium and small size irrigation and rural water supply facilities in Northern, Eastern, North Central and Uva Provinces, thereby contributing to development of rural economies and reducing regional disparities in the country.Kalu Ganga Water Supply Expansion Project (I)Western Province comprised of Colombo, Gampaha and Kalutara Distrcts is the centre of Sri Lankas economic and social activities with relatively developed infrastructure facilities. However, the coverage of pipe borne water supply in Kalutara District is approximately 37.1% and recorded as the lowest in Western Province. Moreover, due to recent rapid urbanization, it is estimated that the service population of current Kalu Ganga Water Supply System will be increased by 45.8% from 2015 to 2025. In order to respond to increasing demand, augmentation of Kalu Ganga Water Supply System and Non revenue Water reduction is imperative.Accordingly, the Government of Japan has agreed to provide a concessional loan of Japanese Yen 31,810 million (Approximately Rs. 42,976 million) to implement Kalu Ganga Water Supply Expansion Project (I) to provide safe water and increase water supply efficiency in the southern area of the Western Province by expanding Kalu Ganage water supply facilities and restructuring water distribution networks, thereby contributing to the improvement of the living conditions of the people. Accordingly, it is expected to expand Kalu Ganga Water Supply System and to reduce Non Revenue Water by restructuring water distribution networks in Dehiwala and Moratuwa areas.The Exchange of Notes of the above projects were signed between the Government of Sri Lanka and the Government of Japan during the Hon. Prime Ministers visit to Japan in April 2017. The signing of Loan Agreements pertaining to the above loans took place today, at the Ministry of Finance & Mass Media. Dr. R.H.S Samaratunga, Secretary, Ministry of Finance & Mass Media on behalf of the Government of Sri Lanka and Mr. Fusato Tanaka, Chief Representative of JICA Sri Lanka Office on behalf of JICA signed the above Loan Agreements.Ministry of Finance & Mass Media", 
  "title": "Rs. 60 billion from Japan for infra structure development projects under 47th Yen Loan Package", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1375-rs-60-billion-from-japan-for-infra-structure-development-projects-under-47th-yen-loan-package"
}