{
  "date": "July 10, 2017", 
  "text": "Samaraweera made this clarification issuing a media communique yesterday to counter the allegations against the proposed legislation.The Government presented the International Convention for the Protection of All Persons from Enforced Disappearance Bill in Parliament on 7th March. The Bill was to be taken up for debate last week, but the Government at the last moment announced that it would be moved at a future date.Samaraweera was the Foreign Minister when Sri Lanka signed International Convention for the Protection of All Persons from Enforced Disappearance on December 10, 2015 ratified the same on May 26, 2016.The Ministers strongly worded statement came in the wake of allegations mainly by the Joint Opposition led by former President Mahinda Rajapaksa that the proposed Bill was an attempt to betray the War Heroes.The proposed legislation is to safe guard a fundamental human right of every citizen in a just, free and civilized society. The main intention of the Bill is to ensure that every Sri Lankan citizen gets the freedom to live without fear of being a victim of enforced disappearance or abduction. All citizens must be happy about this progressive legislation that will put an end to while-van culture and the trend of enforced disappearances and abductions carried out with the connivance of the State, he noted.The minister, hitting hard at the Joint Opposition led by Rajapaksa, said power-hungry politicians who were architects of the infamous white-van culture were deliberately trying to mislead the public. Samaraweera asked as to how anybody could speak against the proposed move to put an end to white-van culture in the country.Rajapaksa loyalists, with their very claim that this Bill affects the War Heroes, admit before the world that the Security Forces during the period of their rule committed enforced disappearances, abductions and extra judicial killings. By saying so, arent they tagging the War Heroes as war criminals? Samaraweera questioned. (CDN)The proposed Bill for protection against enforced disappearances provides only for the future and it has nothing to do with the past incidents, Finance and Media Minister Mangala Samaraweera said. Samaraweera made this clarification issuing a media communique yesterday to counter the allegations against the proposed legislation.The Government presented the International Convention for the Protection of All Persons from Enforced Disappearance Bill in Parliament on 7th March. The Bill was to be taken up for debate last week, but the Government at the last moment announced that it would be moved at a future date.Samaraweera was the Foreign Minister when Sri Lanka signed International Convention for the Protection of All Persons from Enforced Disappearance on December 10, 2015 ratified the same on May 26, 2016.The Ministers strongly worded statement came in the wake of allegations mainly by the Joint Opposition led by former President Mahinda Rajapaksa that the proposed Bill was an attempt to betray the War Heroes.   The proposed legislation is to safe guard a fundamental human right of every citizen in a just, free and civilized society. The main intention of the Bill is to ensure that every Sri Lankan citizen gets the freedom to live without fear of being a victim of enforced disappearance or abduction. All citizens must be happy about this progressive legislation that will put an end to while-van culture and the trend of enforced disappearances and abductions carried out with the connivance of the State, he noted.The minister, hitting hard at the Joint Opposition led by Rajapaksa, said power-hungry politicians who were architects of the infamous white-van culture were deliberately trying to mislead the public. Samaraweera asked as to how anybody could speak against the proposed move to put an end to white-van culture in the country.Rajapaksa loyalists, with their very claim that this Bill affects the War Heroes, admit before the world that the Security Forces during the period of their rule committed enforced disappearances, abductions and extra judicial killings. By saying so, arent they tagging the War Heroes as war criminals? Samaraweera questioned. (CDN)    ", 
  "title": "Disappearance bill to deal with future only - Minister Samaraweera", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1376-disappearance-bill-to-deal-with-future-only-minister-samaraweera"
}