{
  "date": "July 10, 2017", 
  "text": "He said that if he cant face challenges and criticisms, he wouldnt have come out from the previous government in November 2014.How many humiliations and insults did Mahatma Gandhi face during his struggles? But today the entire world is respecting him, he said.The President was speaking at a ceremony held yesterday (9th July) to open the Polysac Factory built in Sinhapura, Welikanda, Polonnaruwa. This new factory of New Rathna Pvt. Ltd manufactures packaging for rice. This has created 350 direct jobs and 500 indirect jobs for the youth in Polonnaruwa District.He expressed his satisfaction over the opportunities created to strengthen the livelihoods of the farming community in Polonnaruwa. He said these kinds of factories which strengthen the national economy and support peoples livelihood, should be established in many fields in the country. The government will encourage those and provide required facilities to them, he said.The President said the government will take actions to stop the importation of poly-sac productions to encourage and strengthen the local manufacturers.Though the former government did not fulfill its duty for Polonnaruwa even when they were capable of doing it, the current government will fulfill that responsibility. Hence, Polonnaruwa will be added to the list of developed districts in the country, the President further said.The current government will move forward without any fear of the challenges and criticisms for the betterment of the people of the country, says President Maithripala Sirisena. He said that if he cant face challenges and criticisms, he wouldnt have come out from the previous government in November 2014.How many humiliations and insults did Mahatma Gandhi face during his struggles? But today the entire world is respecting him, he said.The President was speaking at a ceremony held yesterday (9th July) to open the Polysac Factory built in Sinhapura, Welikanda, Polonnaruwa. This new factory of New Rathna Pvt. Ltd manufactures packaging for rice. This has created 350 direct jobs and 500 indirect jobs for the youth in Polonnaruwa District.He expressed his satisfaction over the opportunities created to strengthen the livelihoods of the farming community in Polonnaruwa. He said these kinds of factories which strengthen the national economy and support peoples livelihood, should be established in many fields in the country. The government will encourage those and provide required facilities to them, he said.The President said the government will take actions to stop the importation of poly-sac productions to encourage and strengthen the local manufacturers.Though the former government did not fulfill its duty for Polonnaruwa even when they were capable of doing it, the current government will fulfill that responsibility. Hence, Polonnaruwa will be added to the list of developed districts in the country, the President further said.", 
  "title": "Government will move forward without any fear of challenges and criticisms  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1378-government-will-move-forward-without-any-fear-of-challenges-and-criticisms-president"
}