{
  "date": "2017-07-11", 
  "text": "Through this program people can easily get access to an electronic database which will provide information on all the welfare benefits offered by the government. The public can obtain information about the areas in which those projects are being implemented and how much money has been spent. The data collected is still in the initial phase and is awaiting confirmation through the District and Divisional Secretaries.This program will provide more accurate information about all the welfare beneficiaries and provide a system to identify the people who are entitled to these welfare benefits in order to eliminate fraud, wastage and ensure transparency. This is a source of data which carries island wide information on these welfare projects and their progress.The Policy Development Office of the Prime Ministers Office had initiated this concept and the project is now being implemented together with the Department of Project Management and Monitoring and the Information Technology Agency of Sri Lanka (ICTA). The web page has already been opened to the public throughhttp://socialregistry.gov.lk.The government has launched a program utilizing new technology to properly distribute social benefits to the people. Through this program people can easily get access to an electronic database which will provide information on all the welfare benefits offered by the government. The public can obtain information about the areas in which those projects are being implemented and how much money has been spent. The data collected is still in the initial phase and is awaiting confirmation through the District and Divisional Secretaries.This program will provide more accurate information about all the welfare beneficiaries and provide a system to identify the people who are entitled to these welfare benefits in order to eliminate fraud, wastage and ensure transparency. This is a source of data which carries island wide information on these welfare projects and their progress.The Policy Development Office of the Prime Ministers Office had initiated this concept and the project is now being implemented together with the Department of Project Management and Monitoring and the Information Technology Agency of Sri Lanka (ICTA). The web page has already been opened to the public throughhttp://socialregistry.gov.lk. ", 
  "title": "New initiative to properly distribute govt.s welfare benefits", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1382-new-initiative-to-properly-distribute-govt-s-welfare-benefits"
}