{
  "date": "July 11, 2017", 
  "text": "The Minister said that the present tax system in place is complicated and that investors find it difficult to understand. Therefore, he said that the new Inland Revenue Bill will broad-base the tax system and incorporate globally accepted new tax principles to deal with international cross border relations.Minister Samaraweera met the TU representatives of the IRD at the Ministry of Finance on Monday (10th July), and held discussions on matters relating to functional activities that come under the purview of the IRD. The Minister invited the employees of the IRD to submit their proposals and to discuss any other issues faced by them. Minister Samaraweera further stated that he was prepared to consider the trade unions concerns in order to enhance the tax revenue of the Government.The trade union representatives briefed Minister Samaraweera on certain administrative and technical issues in the department. The representatives cited the lack of local and foreign training opportunities for officers of the Inland Revenue Department and apprised the Minister on issues faced by them with regard to the payment of incentives. They also stressed on the need for a new building for the Head Office of the Department of Inland Revenue.Although tax revenue has decreased since 2011, the Government has been able to increase national revenue via increased tax collection to reach an all-time high in the recent past due to new policies adopted by the Government.Minister of Finance and Mass Media Mangala Samaraweera during a discussion with representatives of the trade unions of the Inland Revenue Department (IRD) stated that the main objective of the new Inland Revenue Bill was to simplify the tax system in the country in order to create an investor friendly environment that will attract more foreign direct investments in the near future. The Minister said that the present tax system in place is complicated and that investors find it difficult to understand. Therefore, he said that the new Inland Revenue Bill will broad-base the tax system and incorporate globally accepted new tax principles to deal with international cross border relations.Minister Samaraweera met the TU representatives of the IRD at the Ministry of Finance on Monday (10th July), and held discussions on matters relating to functional activities that come under the purview of the IRD. The Minister invited the employees of the IRD to submit their proposals and to discuss any other issues faced by them. Minister Samaraweera further stated that he was prepared to consider the trade unions concerns in order to enhance the tax revenue of the Government.The trade union representatives briefed Minister Samaraweera on certain administrative and technical issues in the department. The representatives cited the lack of local and foreign training opportunities for officers of the Inland Revenue Department and apprised the Minister on issues faced by them with regard to the payment of incentives. They also stressed on the need for a new building for the Head Office of the Department of Inland Revenue.Although tax revenue has decreased since 2011, the Government has been able to increase national revenue via increased tax collection to reach an all-time high in the recent past due to new policies adopted by the Government.", 
  "title": "New Inland Revenue Act will bring an investor-friendly tax system Minister Samaraweera", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1383-new-inland-revenue-act-will-bring-an-investor-friendly-tax-system-minister-samaraweera"
}