{
  "date": "July 11, 2017", 
  "text": "Under this program, a pregnant mother receives a voucher for 2,000 rupees each month during her ten months, which will total up to 20,000 rupees at the end. The vouchers are issued by the Divisional Secretariats for the mothers to buy their needs from the merchants recommended by the authorities. The current procedure is that the beneficiaries have to go to the Divisional Secretaries office in person, in order to collect their vouchers.The Government of Sri Lanka has planned to replace the existing system with a mobile based digital voucher system, with the corporation of mobile telephone companies. Under the proposed system, the mother will receive a digital voucher to her mobile each month, so that she can buy her needs using that digital voucher. There will be a value addition to all the stakeholders of the program; the beneficiaries, merchants registered under the program, and the government.The Central Program Management Unit of the Prime Ministers Office had initiated this concept and the project will be implemented together with the Ministry of Telecommunication and Digital Infrastructure and Ministry of Women and Child Affairs.National Nutrition Program for pregnant mothers is one of the welfare programs conducted by the government. The program has been implemented by the Ministry of Women and Child Affairs with the objective of uplifting the wellbeing of both the child and the mother. Under this program, a pregnant mother receives a voucher for 2,000 rupees each month during her ten months, which will total up to 20,000 rupees at the end. The vouchers are issued by the Divisional Secretariats for the mothers to buy their needs from the merchants recommended by the authorities. The current procedure is that the beneficiaries have to go to the Divisional Secretaries office in person, in order to collect their vouchers.The Government of Sri Lanka has planned to replace the existing system with a mobile based digital voucher system, with the corporation of mobile telephone companies. Under the proposed system, the mother will receive a digital voucher to her mobile each month, so that she can buy her needs using that digital voucher. There will be a value addition to all the stakeholders of the program; the beneficiaries, merchants registered under the program, and the government.The Central Program Management Unit of the Prime Ministers Office had initiated this concept and the project will be implemented together with the Ministry of Telecommunication and Digital Infrastructure and Ministry of Women and Child Affairs.", 
  "title": "Mobile payment for Nutrition Program for Pregnant Mothers", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1385-mobile-payment-for-nutrition-program-for-pregnant-mothers"
}