{
  "date": "July 12, 2017", 
  "text": "As the first phase of the program, all electronic media will disseminate messages on prevention of dengue and on the importance of cleaning the housing premises today from 9.00 a.m. to 11.00 a.m.These messages will be telecast live in Sinhala and Tamil through the Sri Lanka Rupavahini Corporation and ITN respectively. A same program will be conducted on Saturday (15th July) from 10.00 a.m. to 12.00 noon with the participation of all electronic media.Under the second phase, a comprehensive dengue prevention program will be held on 19th July targeting school and office premises with the participation of all media institutions.A special discussion in this regard was held yesterday at the Ministry of Finance and Media under patronage of Deputy Minister Lasantha Alagiyawanna.Director General of Government Information Dr. Ranga Kalansooriya was also present on this occasion.Ministry of Finance and Mass Media and the Department of Government Information in coordination with all the media institutions, mobile telephone companies and the Ministry of Health, Nutrition, and Indigenous Medicine will launch a joint program to make public aware on the dengue menace from today (12th July). As the first phase of the program, all electronic media will disseminate messages on prevention of dengue and on the importance of cleaning the housing premises today from 9.00 a.m. to 11.00 a.m.These messages will be telecast live in Sinhala and Tamil through the Sri Lanka Rupavahini Corporation and ITN respectively. A same program will be conducted on Saturday (15th July) from 10.00 a.m. to 12.00 noon with the participation of all electronic media.Under the second phase, a comprehensive dengue prevention program will be held on 19th July targeting school and office premises with the participation of all media institutions.A special discussion in this regard was held yesterday at the Ministry of Finance and Media under patronage of Deputy Minister Lasantha Alagiyawanna.Director General of Government Information Dr. Ranga Kalansooriya was also present on this occasion.", 
  "title": "All media join dengue prevention campaign", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1389-all-media-join-dengue-prevention-campaign"
}