{
  "date": "July 13, 2017", 
  "text": "During the visit, President Sirisena will hold bilateral meetings with the Bangladesh Prime Minister and the President. He will also hold bilateral meetings with the Bangladesh Foreign Minister, Health Minister, Speaker as well as the Opposition Leader.Diplomatic relations between Sri Lanka and Bangladesh were formally established in 1972.The President will hold extensive bilateral discussions regarding the ways to strengthen the cooperation in the fields of the maritime, education, tourism, fisheries and health as well as the ways to promote investments between the two countries.During the state visit, the two countries are expected to sign several bilateral agreements in the fields of agriculture, education, training of diplomats and Immigration and Emigration.The President will pay his special attention to explore the ways to further expansion of trade and investments between the two countries during his visit.President Maithripala Sirisena left for Bangladesh this morning for a three-day State Visit at the invitation of Bangladesh Prime Minister Sheikh Hasina. During the visit, President Sirisena will hold bilateral meetings with the Bangladesh Prime Minister and the President. He will also hold bilateral meetings with the Bangladesh Foreign Minister, Health Minister, Speaker as well as the Opposition Leader.Diplomatic relations between Sri Lanka and Bangladesh were formally established in 1972.The President will hold extensive bilateral discussions regarding the ways to strengthen the cooperation in the fields of the maritime, education, tourism, fisheries and health as well as the ways to promote investments between the two countries.During the state visit, the two countries are expected to sign several bilateral agreements in the fields of agriculture, education, training of diplomats and Immigration and Emigration.The President will pay his special attention to explore the ways to further expansion of trade and investments between the two countries during his visit.", 
  "title": "President leaves for Bangladesh", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1392-president-leaves-for-bangladesh"
}