{
  "date": "2017-07-13", 
  "text": "Addressing the weekly Cabinet press briefing yesterday (12th July) at the Department of Government Information the deputy minister explained that there was no final draft on the Bill and the cabinet sub-committee appointed to study the draft would consult the public and media institutions to recommend to the Cabinet what future action was needed to be taken with regard to the Bill.He also denied the reports that the Bill would force journalists to reveal their sources.It is a misunderstanding that the government is seeking to suppress the media. No one could force a journalist to reveal his/her sources. But in a criminal investigation or in instances of national security, the police would have to get a Supreme Court order if they wanted a source to be revealed. Media has the rights but they are not absolute, he said.The government yesterday insisted that a new Media Standards Bill would not seek to suppress the freedom of the media, but would only act as a regulator to uphold standards, Deputy Minister of Skills Development and Vocational Training Karunaratne Paranawithana said. Addressing the weekly Cabinet press briefing yesterday (12th July) at the Department of Government Information the deputy minister explained that there was no final draft on the Bill and the cabinet sub-committee appointed to study the draft would consult the public and media institutions to recommend to the Cabinet what future action was needed to be taken with regard to the Bill.He also denied the reports that the Bill would force journalists to reveal their sources.It is a misunderstanding that the government is seeking to suppress the media. No one could force a journalist to reveal his/her sources. But in a criminal investigation or in instances of national security, the police would have to get a Supreme Court order if they wanted a source to be revealed. Media has the rights but they are not absolute, he said.", 
  "title": "New Bill will not suppress freedom of media  Deputy Minister", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1393-new-bill-will-not-suppress-freedom-of-media-deputy-minister"
}