{
  "date": "2017-07-13", 
  "text": "Previously Sri Lanka received USD 660 Million IDA support for the period from year 2014 to 2017.Sri Lanka is expected to access approximately USD 300 million per annum for the coming 3 years from IBRD (international bank for Reconstruction and Development) IDA and IBRD are member institutions of World Bank Group. This assistance comes as financial assistance for development projects and technical assistance for analytical and advisory services.This was revealed when the World Bank Country Director for Sri Lanka and Maldives Ms. Idah ZRiddihough called on the Minister of Finance and Mass Media Mangala Samaraweera at the Finance Ministry on Tuesday.World Bank Country Director discussed the progress of WB assisted ongoing and proposed projects in the country. Public Sector Efficiency Project and the Country Readiness for Public Private Partnerships (PPP) are the two projects, proposed to be implemented by the Ministry of Finance with financial and technical support from the World Bank. The Social Safety Nets Project is the on-going project with WB assistance.         WB Country Director appreciating the Sri Lankas economic performance said that despite significant challenges, it remained broadly satisfactory in 2016 and early 2017. The WB recognizes the corrective policy measures taken in 2016 following expansionary fiscal and monetary policies implemented in the previous year as early signs of stabilization.A combination of increase in revenues and rationalization of expenditures helped reducing the fiscal deficit from a reported 7.6 percent in 2015 to a 5.4 percent of GDP in 2016. While the boost received from increased profits and dividend income from State Owned Enterprises (SOEs) played a key role in increasing revenues; the changes to the VAT Act implemented late 2016 and improved revenue administration helped strengthen the tax collection.The World Bank predicts that fiscal deficit in Sri Lanka is projected to fall to 5.2 percent of GDP for 2017. This is thanks to the impact of VAT changes in its first full year. In outer years, the new Inland Revenue Act is expected to expand the tax base for corporate and personal income tax while shifting from tax holidays to a performance-based incentive regime, where the incentives depend on actual rather than promised investment.On the expenditure side, WB projects the increased fiscal space will benefit primarily public investment, assuming no major additional recurrent expenditure commitments. Under this baseline, the fiscal deficit to narrow the deficit to 3.5 of GDP by 2020. The primary fiscal balance is projected to become marginally positive in 2017.Sri Lanka will receive USD 1,340 million worth of financial and technical assistance from the World Bank Groups for the 3-year period starting from July1, 2017 under the IDA (International Development Association) Transitional Support Facility. Previously Sri Lanka received USD 660 Million IDA support for the period from year 2014 to 2017.Sri Lanka is expected to access approximately USD 300 million per annum for the coming 3 years from IBRD (international bank for Reconstruction and Development) IDA and IBRD are member institutions of World Bank Group. This assistance comes as financial assistance for development projects and technical assistance for analytical and advisory services.This was revealed when the World Bank Country Director for Sri Lanka and Maldives Ms. Idah ZRiddihough called on the Minister of Finance and Mass Media Mangala Samaraweera at the Finance Ministry on Tuesday.World Bank Country Director discussed the progress of WB assisted ongoing and proposed projects in the country. Public Sector Efficiency Project and the Country Readiness for Public Private Partnerships (PPP) are the two projects, proposed to be implemented by the Ministry of Finance with financial and technical support from the World Bank. The Social Safety Nets Project is the on-going project with WB assistance.          WB Country Director appreciating the Sri Lankas economic performance said that despite significant challenges, it remained broadly satisfactory in 2016 and early 2017. The WB recognizes the corrective policy measures taken in 2016 following expansionary fiscal and monetary policies implemented in the previous year as early signs of stabilization.A combination of increase in revenues and rationalization of expenditures helped reducing the fiscal deficit from a reported 7.6 percent in 2015 to a 5.4 percent of GDP in 2016. While the boost received from increased profits and dividend income from State Owned Enterprises (SOEs) played a key role in increasing revenues; the changes to the VAT Act implemented late 2016 and improved revenue administration helped strengthen the tax collection.The World Bank predicts that fiscal deficit in Sri Lanka is projected to fall to 5.2 percent of GDP for 2017. This is thanks to the impact of VAT changes in its first full year. In outer years, the new Inland Revenue Act is expected to expand the tax base for corporate and personal income tax while shifting from tax holidays to a performance-based incentive regime, where the incentives depend on actual rather than promised investment.On the expenditure side, WB projects the increased fiscal space will benefit primarily public investment, assuming no major additional recurrent expenditure commitments. Under this baseline, the fiscal deficit to narrow the deficit to 3.5 of GDP by 2020. The primary fiscal balance is projected to become marginally positive in 2017.", 
  "title": "Sri Lanka to receive USD 1,340 million assistance from WB ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1394-sri-lanka-to-receive-usd-1-340-million-assistance-from-wb"
}