{
  "date": "July 16, 2017", 
  "text": "President Sirisena who arrived in the Presidents House of Bangladesh was warmly welcomed by President Hamid.President Hamid who himself came from a village, said President Sirisena as a President who came from a village is performing a humble service to the people. He admired President Sirisenas service.He said there is a possibility for both countries which are proceeding to a democratic goal, to continue the relationships between both countries through a new access. The Bangladeshi President added that the two leaders should often meet and discuss on this regard.President Sirisena expressed his gratitude to the government of Bangladesh, the Prime Minister and the President for their warm welcome and hospitality.President Sirisena will grace a special cultural show, held in the Presidents House in Bangladesh. The cultural show has been organized to be held in line with the Presidents state visit to Bangladesh.President Sirisena also participated in the banquet hosted by the Bangladeshi President at the Presidents House, in honor of him.President Maithripala Sirisena, who in on a state visit to Bangladesh met the President of Bangladesh Md. Abdul Hamid yesterday (14th July) at the Presidents House of Bangladesh. President Sirisena who arrived in the Presidents House of Bangladesh was warmly welcomed by President Hamid.President Hamid who himself came from a village, said President Sirisena as a President who came from a village is performing a humble service to the people. He admired President Sirisenas service.He said there is a possibility for both countries which are proceeding to a democratic goal, to continue the relationships between both countries through a new access. The Bangladeshi President added that the two leaders should often meet and discuss on this regard.President Sirisena expressed his gratitude to the government of Bangladesh, the Prime Minister and the President for their warm welcome and hospitality.President Sirisena will grace a special cultural show, held in the Presidents House in Bangladesh. The cultural show has been organized to be held in line with the Presidents state visit to Bangladesh.President Sirisena also participated in the banquet hosted by the Bangladeshi President at the Presidents House, in honor of him.", 
  "title": "Sri Lanka and Bangladesh Presidents meet", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1402-sri-lanka-and-bangladesh-presidents-meet"
}