{
  "date": "2017-07-16", 
  "text": "The four-member team of officials that flew to Pakistan and Myanmar returned (14th July) and met the Minister of Industry and Commerce Rishad Bathiudeen. The team was led by Secretary of Ministry of Industry and Commerce Chinthaka Lokuhetti.After this successful tour, it is clear that there will be no more rice shortages in the domestic markets-or even any likelihood of it. Some elements in the market are trying to create an artificial shortage, the Minister said.According to an official, Pakistan has agreed to supply 25000 MT immediately. No final price has been quoted yet but once the final price is agreed, they will be shipped from Pakistan in early August. Pakistan is also ready to supply some more rice quantity by September. Myanmar is ready to supply another 30,000 MT immediately and its final price too, to be agreed.Pakistan and Myanmar have agreed to supply 55, 000 MT of rice to Sri Lanka immediately to overcome any possible rice shortage in the domestic market. The four-member team of officials that flew to Pakistan and Myanmar returned (14th July) and met the Minister of Industry and Commerce Rishad Bathiudeen. The team was led by Secretary of Ministry of Industry and Commerce Chinthaka Lokuhetti.After this successful tour, it is clear that there will be no more rice shortages in the domestic markets-or even any likelihood of it. Some elements in the market are trying to create an artificial shortage, the Minister said.According to an official, Pakistan has agreed to supply 25000 MT immediately. No final price has been quoted yet but once the final price is agreed, they will be shipped from Pakistan in early August. Pakistan is also ready to supply some more rice quantity by September. Myanmar is ready to supply another 30,000 MT immediately and its final price too, to be agreed.", 
  "title": "Pakistan, Myanmar agree to provide 55,000 MT of rice immediately", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1403-pakistan-myanmar-agree-to-provide-55-000-mt-of-rice-immediately"
}