{
  "date": "2017-07-17", 
  "text": "Secretary made these remarks responding to media personnel after meeting the Chief Prelates during his visit to Kandy on Saturday (15th July).The Secretary said that the security forces are involved in another mission in fighting against the Dengue menace, educating the public, carrying out medical camps and services in order to save the nation from this deadly disease and that the tri forces and the civil security personnel played a vital role in carrying out rescue and relief efforts during the recent natural disaster which engulfed parts of the country. This should not be just another piece of 'news' but a national effort, he stressed.In response to question on national security the Secretary said that as far as national security is concerned it is being safeguarded to the utmost and that the President and the Prime Minister have taken all measures in this regard and as the Secretary of Defence he is committed in carrying out his duties with commitment. Stressing on the importance of national security he said that he will act with to strengthen national security and while taking measures to maintain the dignity of the tri forces and the civil security personnel, will not allow national security to be diluted or subdued', he maintained.Commenting on a question on the arrest of security forces personnel he said that, as a former member of the Solicitor General's Department he can reveal that there are investigations being carried out regarding certain crimes and that he is certain that no unnecessary arrests will be made. He also noted that in the case of any arrests being made those arrested he will be provided justice through the judiciary.Secretary to the Ministry of Defense Kapila Waidyaratne said that he would not allow national security to be diluted or subdued. Secretary made these remarks responding to media personnel after meeting the Chief Prelates during his visit to Kandy on Saturday (15th July).The Secretary said that the security forces are involved in another mission in fighting against the Dengue menace, educating the public, carrying out medical camps and services in order to save the nation from this deadly disease and that the tri forces and the civil security personnel played a vital role in carrying out rescue and relief efforts during the recent natural disaster which engulfed parts of the country. This should not be just another piece of 'news' but a national effort, he stressed.In response to question on national security the Secretary said that as far as national security is concerned it is being safeguarded to the utmost and that the President and the Prime Minister have taken all measures in this regard and as the Secretary of Defence he is committed in carrying out his duties with commitment. Stressing on the importance of national security he said that he will act with to strengthen national security and while taking measures to maintain the dignity of the tri forces and the civil security personnel, will not allow national security to be diluted or subdued', he maintained.Commenting on a question on the arrest of security forces personnel he said that, as a former member of the Solicitor General's Department he can reveal that there are investigations being carried out regarding certain crimes and that he is certain that no unnecessary arrests will be made. He also noted that in the case of any arrests being made those arrested he will be provided justice through the judiciary.", 
  "title": "'Will not allow national security to dilute or subdue' - Secretary", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1407-will-not-allow-national-security-to-dilute-or-subdue-secretary"
}