{
  "date": "2017-07-18", 
  "text": "Accordingly, the proposed program aims to increase enrolment in higher education programs that are important for an aspiring Upper Middle Income Countries and to develop the higher education sector in areas of vital importance for future economic development such as modern teaching and learning that blend academic achievement with good socio-emotional skills and a vibrant research and innovation culture that supports the expansion and growth of higher-value industries and services.AHEAD focuses on three Result Areas; Increasing Enrolment in Higher Education in Priority Areas for Economic Development (Science, Technology, Engineering and Mathematics (STEM)), Improving the Quality of Higher Education, and Promoting Research and Development, Innovation.Depending on the availability of the World Bank funds to Sri Lanka, it has been proposed to obtain two financing facilities from IDA and IBRD such as a Credit of Special Drawing Rights (SDR) being the equivalent of USD 33 million from the International Development Association (IDA) and a Credit of USD 67 million from the International Bank for Reconstruction and Development (IBRD)of the World Bank. The project will be implemented by the Ministry of Higher Education and Highways throughout the period of 2017  2022.Financing Agreement and Loan Agreement in this regard were signed on 17th July at the Ministry of Finance by Dr. R. H. S Samarathunga, Secretary, Ministry of Finance and Mass Media on behalf of the Government of Sri Lanka and Ms. Idah Z. Pswarayi  Riddihough, Country Director for Sri Lanka and the Maldives, on behalf of the World Bank.The International Development Association (IDA) and the International Bank for Reconstruction and Development (IBRD) of the World Bank has shown their interest to mobilize its funds through a credit of USD 100 million for the Accelerating Higher Education Expansion and Development (AHEAD) Operation. Accordingly, the proposed program aims to increase enrolment in higher education programs that are important for an aspiring Upper Middle Income Countries and to develop the higher education sector in areas of vital importance for future economic development such as modern teaching and learning that blend academic achievement with good socio-emotional skills and a vibrant research and innovation culture that supports the expansion and growth of higher-value industries and services.AHEAD focuses on three Result Areas; Increasing Enrolment in Higher Education in Priority Areas for Economic Development (Science, Technology, Engineering and Mathematics (STEM)), Improving the Quality of Higher Education, and Promoting Research and Development, Innovation.Depending on the availability of the World Bank funds to Sri Lanka, it has been proposed to obtain two financing facilities from IDA and IBRD such as a Credit of Special Drawing Rights (SDR) being the equivalent of USD 33 million from the International Development Association (IDA) and a Credit of USD 67 million from the International Bank for Reconstruction and Development (IBRD)of the World Bank. The project will be implemented by the Ministry of Higher Education and Highways throughout the period of 2017  2022.Financing Agreement and Loan Agreement in this regard were signed on 17th July at the Ministry of Finance by Dr. R. H. S Samarathunga, Secretary, Ministry of Finance and Mass Media on behalf of the Government of Sri Lanka and Ms. Idah Z. Pswarayi  Riddihough, Country Director for Sri Lanka and the Maldives, on behalf of the World Bank.", 
  "title": "USD 100 Mn from WB for Higher Education Expansion program", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1409-usd-100-mn-from-wb-for-higher-education-expansion-program"
}