{
  "date": "2017-07-18", 
  "text": "Minister Balakrishnan is expected to call on President Maithripala Sirisena, Prime Minister Ranil Wickremesinghe and Leader of the Opposition R. Sampanthan during his visit.The Foreign Minister will meet Foreign Affairs Minister Ravi Karunanayake today (18th July) for bilateral talks. He will also have meetings with Minister of Megapolis and Western Development Champika Ranawaka, Minister of Finance and Mass Media Mangala Samaraweera, Minister of Development Strategies and International Trade Malik Samarawickrama and Minister of Law and Order and Southern Development Sagala Ratnayaka during his visit. The Minister will witness the signing of a MOU between Singapore Red Cross and the Sri Lanka Red Cross on relief and rehabilitation programs in Sri Lanka.During stay in the island, Foreign Minister Balakrishnan will visit Jaffna, where he would take part in an event to handover books donated from the Singapore National Library Board to the Jaffna Public Library and visit the Orthopedic Ward of the Teaching Hospital where he would plant a tree at the premises. The Minister would also visit the University of Jaffna to take part in the launch of the Lee Foundation- SingHealth Orthopedic Development Program at the Medical Faculty.He will also call on the Governor of the Northern Province Reginald Cooray and Chief Minister C.V. Wigneswaran and have an interaction with Businessmen of the Chamber of Commerce of Jaffna.Minister for Foreign Affairs of Singapore Dr. Vivian Balakrishnan will undertake an official visit to Sri Lanka from 17th -21st July. Minister Balakrishnan is expected to call on President Maithripala Sirisena, Prime Minister Ranil Wickremesinghe and Leader of the Opposition R. Sampanthan during his visit.The Foreign Minister will meet Foreign Affairs Minister Ravi Karunanayake today (18th July) for bilateral talks. He will also have meetings with Minister of Megapolis and Western Development Champika Ranawaka, Minister of Finance and Mass Media Mangala Samaraweera, Minister of Development Strategies and International Trade Malik Samarawickrama and Minister of Law and Order and Southern Development Sagala Ratnayaka during his visit. The Minister will witness the signing of a MOU between Singapore Red Cross and the Sri Lanka Red Cross on relief and rehabilitation programs in Sri Lanka.During stay in the island, Foreign Minister Balakrishnan will visit Jaffna, where he would take part in an event to handover books donated from the Singapore National Library Board to the Jaffna Public Library and visit the Orthopedic Ward of the Teaching Hospital where he would plant a tree at the premises. The Minister would also visit the University of Jaffna to take part in the launch of the Lee Foundation- SingHealth Orthopedic Development Program at the Medical Faculty.He will also call on the Governor of the Northern Province Reginald Cooray and Chief Minister C.V. Wigneswaran and have an interaction with Businessmen of the Chamber of Commerce of Jaffna.", 
  "title": "Singaporean Foreign Minister visits Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1410-singaporean-foreign-minister-visits-sri-lanka"
}