{
  "date": "2017-07-19", 
  "text": "The Minister pointed out the pre-requisites for the proposed trade agreement will be completed before the end of this year.Minister Karunanayake made these remarks addressing media after the bilateral discussions with visiting Singaporean Foreign Minister Dr. Vivian Balakrishnan yesterday (18th July) at the Foreign Ministry.Singaporean Foreign Minister Dr. Balakrishnan visited the Foreign Ministry yesterday and had bilateral discussions with his Sri Lankan counterpart Minister Ravi Karunanayake .According to Minster Karunanayake, bilateral ties between Sri Lanka and Singapore were strengthened subsequent to the official visit to Singapore by Prime Minister Ranil Wickremesinghe last year.He said at the meeting held yesterday, attention was drawn to economic and development cooperation between the two countries. Matters with regard to tourism, cultural affairs, human cooperation, economic and maritime activities and education and training development in both countries were also discussed during the meeting.Foreign Minister Ravi Karunanayake who appreciated the support extended by Singapore for future development activities of Sri Lanka stated that such assistance always stands a huge strength for Sri Lanka.The minister also said that investment opportunities for Singaporean investors have been widely available in the island.Speaking to the media, Singaporean Foreign Minister Dr. Balakrishnan said bilateral relations between Sri Lanka and Singapore has been strengthening for years.At the same time, he pointed out that Singapore government is committed to assist Sri Lanka in its all development efforts. He said that entering a new trade agreement between the two countries would further strengthen the well existing bilateral ties.At this moment, Dr. Balakrishnan extended an invitation to Minister Ravi Karunanayake to make an official tour of Singapore.State Minister of Foreign Affairs Wasantha Senanayake, Ministry Secretary Esala Weerakoon and a group of officials of the Ministry of Foreign Affairs participated.The proposed Free Trade Agreement (FTA) between Sri Lanka and Singapore will be finalized this year, Foreign Minister Ravi Karunanayake said. The Minister pointed out the pre-requisites for the proposed trade agreement will be completed before the end of this year.Minister Karunanayake made these remarks addressing media after the bilateral discussions with visiting Singaporean Foreign Minister Dr. Vivian Balakrishnan yesterday (18th July) at the Foreign Ministry.Singaporean Foreign Minister Dr. Balakrishnan visited the Foreign Ministry yesterday and had bilateral discussions with his Sri Lankan counterpart Minister Ravi Karunanayake .According to Minster Karunanayake, bilateral ties between Sri Lanka and Singapore were strengthened subsequent to the official visit to Singapore by Prime Minister Ranil Wickremesinghe last year.He said at the meeting held yesterday, attention was drawn to economic and development cooperation between the two countries. Matters with regard to tourism, cultural affairs, human cooperation, economic and maritime activities and education and training development in both countries were also discussed during the meeting.Foreign Minister Ravi Karunanayake who appreciated the support extended by Singapore for future development activities of Sri Lanka stated that such assistance always stands a huge strength for Sri Lanka.The minister also said that investment opportunities for Singaporean investors have been widely available in the island.Speaking to the media, Singaporean Foreign Minister Dr. Balakrishnan said bilateral relations between Sri Lanka and Singapore has been strengthening for years.At the same time, he pointed out that Singapore government is committed to assist Sri Lanka in its all development efforts. He said that entering a new trade agreement between the two countries would further strengthen the well existing bilateral ties.At this moment, Dr. Balakrishnan extended an invitation to Minister Ravi Karunanayake to make an official tour of Singapore.State Minister of Foreign Affairs Wasantha Senanayake, Ministry Secretary Esala Weerakoon and a group of officials of the Ministry of Foreign Affairs participated.", 
  "title": "Proposed FTA between Sri Lanka and Singapore to be finalized this year", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1412-proposed-fta-between-sri-lanka-and-singapore-to-be-finalized-this-year"
}