{
  "date": "July 20, 2017", 
  "text": "The premier was delivering the keynote address at a forum organized by the European Chamber of Commerce in Sri Lanka, on Sri Lanka - The Next Asian Economic Miracle? he stressed the potential of Sri Lankas economic growth through the GSP Plus.Wickremesinghe stressed the opportunities the GSP+ will provide for Sri Lanka, reminding the audience that open markets require open societies.The GSP Plus (Generalised System of Preferences) is a preferential tariff system which provides for a formal system of exemption from the more general rules of the World Trade Organization.The GSP+ is a key to us, because here we have the ability to develop our economy and to develop and strengthen our democracy.But he also said the opportunities provided by entry to the GSP+ also present a challenge to Sri Lankas domestic investors, to utilize this opportunity. Because, as he explained, success requires the private sector to be strong enough to invest in. Speaking about foreign investors coming to Sri Lanka, not just through GSP Plus but the entire global value chain, he said,We have to be ready. And the way Sri Lanka becomes ready, he said, is through productivity. Our productivity will enhance our competitiveness. Productivity means a workforce dedicated to productivity. And how do we get a workforce dedicated to productivity? Part of the gains has to be shared with the workforce.The way to do this, Wickremesinghe said was to move toward a minimum of total pay or allowances and benefits [for the workforce] of USD 400. Otherwise, you wont be able to compete. There will be more people driving trishaws than in the factories. Wickremesinghe ended his speech by emphasising the need for a shift in the type of labor demanded from the Sri Lankan workforce, one that would be accentuated by the opportunities provided by entry to the GSP+.Theres a large low-wage base developing in Bangladesh and Myanmar. We cannot compete with that, and we shouldnt compete with that. The world is changing, new technology is coming in. So where do we want to be? The low wage of the t-shirt industry, or the middle part of the 3D printing industry?. This is a time that we can make a revolution, a time we can make a revolution peacefully, through the economy. (CDN)The GSP plus concession is the lynchpin to build our outward-looking, export-oriented economy which will provide jobs and increase incomes, Prime Minister Ranil Wickremesinghe said. The premier was delivering the keynote address at a forum organized by the European Chamber of Commerce in Sri Lanka, on Sri Lanka - The Next Asian Economic Miracle? he stressed the potential of Sri Lankas economic growth through the GSP Plus.Wickremesinghe stressed the opportunities the GSP+ will provide for Sri Lanka, reminding the audience that open markets require open societies.The GSP Plus (Generalised System of Preferences) is a preferential tariff system which provides for a formal system of exemption from the more general rules of the World Trade Organization.The GSP+ is a key to us, because here we have the ability to develop our economy and to develop and strengthen our democracy.But he also said the opportunities provided by entry to the GSP+ also present a challenge to Sri Lankas domestic investors, to utilize this opportunity. Because, as he explained, success requires the private sector to be strong enough to invest in. Speaking about foreign investors coming to Sri Lanka, not just through GSP Plus but the entire global value chain, he said,We have to be ready. And the way Sri Lanka becomes ready, he said, is through productivity. Our productivity will enhance our competitiveness. Productivity means a workforce dedicated to productivity. And how do we get a workforce dedicated to productivity? Part of the gains has to be shared with the workforce.The way to do this, Wickremesinghe said was to move toward a minimum of total pay or allowances and benefits [for the workforce] of USD 400. Otherwise, you wont be able to compete. There will be more people driving trishaws than in the factories. Wickremesinghe ended his speech by emphasising the need for a shift in the type of labor demanded from the Sri Lankan workforce, one that would be accentuated by the opportunities provided by entry to the GSP+.Theres a large low-wage base developing in Bangladesh and Myanmar. We cannot compete with that, and we shouldnt compete with that. The world is changing, new technology is coming in. So where do we want to be? The low wage of the t-shirt industry, or the middle part of the 3D printing industry?. This is a time that we can make a revolution, a time we can make a revolution peacefully, through the economy. (CDN)", 
  "title": "GSP+, new technology will enhance countrys competitiveness - PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1419-gsp-new-technology-will-enhance-country-s-competitiveness-pm"
}