{
  "date": "July 21, 2017", 
  "text": "This would enable the duty-free entry of products such as bags, wallets and backpacks in to the US market after being previously charged 6 to 20 percent of tariff.Following this concession, Sri Lankas travel goods exports to the United States will have the potential to regain the market share previously enjoyed by Sri Lanka by making the country among top 10 suppliers to the US market, once again. The inclusion of travel goods in the GSP is expected to help US travel goods brands and retailers to broaden sourcing options for these products.Production of travel goods in Sri Lanka continues to remain as Small and Medium Enterprise (SME) industry, which provides livelihood to a considerable number of men and women at the grassroots level and this development would bolster the local manufacturing industry and investments in this industry. It would also lead to the creation of new jobs in the travel goods manufacturing sector in Sri Lanka. US companies having a manufacturing plant in Sri Lanka in the travel goods industry could also export the finished product not only to the US market under zero duty but could also export to the EU under EU GSP Plus, India and Pakistan under the respective Free Trade Agreements as well.Export of travel goods from Sri Lanka will enjoy duty free entry to the United States following a decision by the US administration to approve the inclusion of travel goods from all GSP beneficiary countries, including Sri Lanka, in the expanded US General System of Preferences (GSP) scheme on 1st July, 2017. This would enable the duty-free entry of products such as bags, wallets and backpacks in to the US market after being previously charged 6 to 20 percent of tariff.Following this concession, Sri Lankas travel goods exports to the United States will have the potential to regain the market share previously enjoyed by Sri Lanka by making the country among top 10 suppliers to the US market, once again. The inclusion of travel goods in the GSP is expected to help US travel goods brands and retailers to broaden sourcing options for these products.Production of travel goods in Sri Lanka continues to remain as Small and Medium Enterprise (SME) industry, which provides livelihood to a considerable number of men and women at the grassroots level and this development would bolster the local manufacturing industry and investments in this industry. It would also lead to the creation of new jobs in the travel goods manufacturing sector in Sri Lanka. US companies having a manufacturing plant in Sri Lanka in the travel goods industry could also export the finished product not only to the US market under zero duty but could also export to the EU under EU GSP Plus, India and Pakistan under the respective Free Trade Agreements as well.", 
  "title": "Travel goods from Sri Lanka to enjoy duty free entry to the US", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1427-travel-goods-from-sri-lanka-to-enjoy-duty-free-entry-to-the-us"
}