{
  "date": "2017-07-22", 
  "text": "He said his personal opinion is that everybody should be given an income tax number although they pay income tax or not. He added that even the religious institutions should pay tax if they engage in business otherwise no.Minister Samaraweera made these observations yesterday (21st July) during a press conference at the Finance Ministry Auditorium.He said that out of the tax collected, 20 percent is direct tax while 80 percent is indirect tax.The Minister added that to bring about social justice the indirect tax should be reduced to 60 percent and direct tax should be increased to 40 percent.Queried by the media, Minister Samaraweera said that there are some doctors engaging in private practice, architects, lawyers and teachers etc who earn massive amounts of money who should pay income tax.He said that they would find ways to collect those taxes.Questioned by the media on tax exemption, the Minister said that it was the politicians and officials that granted tax exemptions during previous regimes without any standard. There was no social justice, Minister Samaraweera said.He further said that JVP MP Anura Dissanayake had said that this government is getting ready to collect income tax from beggars. It is wrong, the Minister said. But, if there are beggars who earn tens of millions, surely they would be taxed. When questioned by the media on certain statements made by the Joint Opposition in this regard, Finance and Media State Minister Eran Wickramaratne said even politicians should pay taxes if they earn.There is no exemption to them, the State Minister said.But the statement that we impose the income tax on the poor is totally wrong. We even have increased the tax free allowance to Rs.1.2 million. It means even those people who earn a Rs.100,000 a month do not need to pay income tax.He said that discussions are still in progress with all the stake holders and their views would be entertained.State Minister Wickramaratne said during the Committee Stage debate, the government too would make amendments.He also said as there are a few cases against the bill before the Supreme Court, the recommendations of the Court would be considered in Parliament.Minister Samaraweera further said that the Bill would be debated in Parliament during the third week of August and would come into effect from the next tax year. (CDN)The Policy of the new Inland Revenue Bill is that there are no exemptions and everybody qualified should pay income tax, Finance and Media Minister Mangala Samaraweera said yesterday. He said his personal opinion is that everybody should be given an income tax number although they pay income tax or not. He added that even the religious institutions should pay tax if they engage in business otherwise no.Minister Samaraweera made these observations yesterday (21st July) during a press conference at the Finance Ministry Auditorium.He said that out of the tax collected, 20 percent is direct tax while 80 percent is indirect tax.The Minister added that to bring about social justice the indirect tax should be reduced to 60 percent and direct tax should be increased to 40 percent.Queried by the media, Minister Samaraweera said that there are some doctors engaging in private practice, architects, lawyers and teachers etc who earn massive amounts of money who should pay income tax.He said that they would find ways to collect those taxes.Questioned by the media on tax exemption, the Minister said that it was the politicians and officials that granted tax exemptions during previous regimes without any standard. There was no social justice, Minister Samaraweera said.He further said that JVP MP Anura Dissanayake had said that this government is getting ready to collect income tax from beggars. It is wrong, the Minister said. But, if there are beggars who earn tens of millions, surely they would be taxed. When questioned by the media on certain statements made by the Joint Opposition in this regard, Finance and Media State Minister Eran Wickramaratne said even politicians should pay taxes if they earn.There is no exemption to them, the State Minister said.But the statement that we impose the income tax on the poor is totally wrong. We even have increased the tax free allowance to Rs.1.2 million. It means even those people who earn a Rs.100,000 a month do not need to pay income tax.He said that discussions are still in progress with all the stake holders and their views would be entertained.State Minister Wickramaratne said during the Committee Stage debate, the government too would make amendments.He also said as there are a few cases against the bill before the Supreme Court, the recommendations of the Court would be considered in Parliament.Minister Samaraweera further said that the Bill would be debated in Parliament during the third week of August and would come into effect from the next tax year. (CDN)", 
  "title": "No tax exemptions under new Inland Revenue Bill", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1428-no-tax-exemptions-under-new-inland-revenue-bill"
}