{
  "date": "August 30, 2016", 
  "text": "SriLankan Airlines wishes to advise its valued customers of changes to its schedule over a three-month periodcommencing from 06th January 2017 to 06th April 2017,due to the closure of Colombos Bandaranaike International Airport from 0830 hours to 1630 hours each day for maintenance work on the runway.The following flights have been cancelled. However, SriLankan will continue to serve each of these destinations through its flights at other times of the day: UL308 Colombo-Singapore and UL 309 Singapore-Colombo  UL127 Colombo-Chennai and UL122Chennai-Colombo  UL133 Colombo-Trichy and UL132Trichy-Colombo  UL115 Colombo-Male and UL102 Male-Colombo  UL167 Colombo-Cochin and UL166 Cochin-Colombo  UL173 Colombo-Bangalore and UL174Bangalore-ColomboThe following flights have been shifted to alternate times of the day: UL868 Colombo-Beijing. UL866 Colombo-Shanghai. UL402 Colombo-Bangkok and UL403 Bangkok-Colombo UL318 Colombo-Kuala Lumpur and UL319 Kuala Lumpur-Colombo UL306 Colombo-Singapore and UL307 Singapore-Colombo UL161 Colombo-Trivandrum and UL162 Trivandrum -Colombo UL195 Colombo-New Delhi and UL196 New Delhi-Colombo UL183 Colombo-Karachi and UL184 Karachi-Colombo UL503 Colombo-London and UL504 London-Colombo (From 05th January UL 504 will operate as London-Mal -Colombo) UL281 Colombo-Jeddah and UL282 Jeddah-ColomboPassengers who have already booked tickets on any of the above flights should contact their travel agent or the nearest SriLankan Airlines ticket office for details on revised times and/or alternative routings.SriLankan Airlines regrets any inconvenience to its passengers caused due tothese arrangements that have been made under unavoidable circumstances. The closure of BIA affects flights of all airlines that operate to BIA during the scheduled time of maintenance work. The airline is not the operator of the airport and has no control over the scheduled maintenance works.For more information please visithttp://www.srilankan.com/en_uk/coporate/news", 
  "title": "SriLankan Airlinesflight schedule changes due to BIA runway work", 
  "url": "https://www.dgi.gov.lk/news/latest-news/143-srilankan-airlines-flight-schedule-changes-due-to-bia-runway-work"
}