{
  "date": "2017-07-22", 
  "text": "He said this when he called on President Maithripala Sirisena at the Presidents Official Residence in Colombo yesterday (21st July).The UN Official expressed appreciation over the progress made by Sri Lanka in many areas despite challenges of natural calamities, adverse weather conditions and small groups of political hardliners in the North and South.President Sirisena pointed out that a few extreme elements in the North compel the innocent poor people in displacement camps not to accept land and houses offered to them by the government and to demand lands from other areas. Similarly some political opportunists in the South level baseless allegations against the government. But the government is determined to implement its programs for reconciliation and development, the President said.The strengthening of democratic institutions and enhancing strategic communication to make people aware of progressive development activities of the government were also discussed during the meeting.President Sirisena said Sri Lanka is committed to the United Nations Charter as a long standing member nation. Mr. Feltmen expressed appreciation over Sri Lankas contribution to the United Nations in the past and assured continuous support. He also referred to the Sri Lankas contribution to the UN Peace Keeping Force. The President urged the UN to increase the intake of Sri Lankan soldiers to the UN Peace Keeping Force.Mr. Feltman said that when he flew to Trincoamalee he could see the devastation due to droughts in the East, and President Sirisena said that he travelled to Kantale today and some areas had not received rains for nearly a year and many cultivations were destroyed. The UN Under Secretary General assured that assistance would be provided under the UN Development Program.This is the Under-Secretary-Generals third visit to Sri Lanka and is a follow up to his 2015 visit after the change of government. He also accompanied the then UN Secretary General Ban Ki Moon to Sri Lanka.Foreign Minister Ravi Karunanayake, Secretary to the President, Austin Fernando, Foreign Secretary Esala Weerakoon and UN Resident Coordinator and UNDP Resident Representative, Una McCauley were also present on this occasion.Under-Secretary-General for Political Affairs, Jeffrey Feltman said that the UN would continue to extend fullest support to Sri Lankas development process and reconciliation. He said this when he called on President Maithripala Sirisena at the Presidents Official Residence in Colombo yesterday (21st July).The UN Official expressed appreciation over the progress made by Sri Lanka in many areas despite challenges of natural calamities, adverse weather conditions and small groups of political hardliners in the North and South.President Sirisena pointed out that a few extreme elements in the North compel the innocent poor people in displacement camps not to accept land and houses offered to them by the government and to demand lands from other areas. Similarly some political opportunists in the South level baseless allegations against the government. But the government is determined to implement its programs for reconciliation and development, the President said.The strengthening of democratic institutions and enhancing strategic communication to make people aware of progressive development activities of the government were also discussed during the meeting.President Sirisena said Sri Lanka is committed to the United Nations Charter as a long standing member nation. Mr. Feltmen expressed appreciation over Sri Lankas contribution to the United Nations in the past and assured continuous support. He also referred to the Sri Lankas contribution to the UN Peace Keeping Force. The President urged the UN to increase the intake of Sri Lankan soldiers to the UN Peace Keeping Force.Mr. Feltman said that when he flew to Trincoamalee he could see the devastation due to droughts in the East, and President Sirisena said that he travelled to Kantale today and some areas had not received rains for nearly a year and many cultivations were destroyed. The UN Under Secretary General assured that assistance would be provided under the UN Development Program.This is the Under-Secretary-Generals third visit to Sri Lanka and is a follow up to his 2015 visit after the change of government. He also accompanied the then UN Secretary General Ban Ki Moon to Sri Lanka.Foreign Minister Ravi Karunanayake, Secretary to the President, Austin Fernando, Foreign Secretary Esala Weerakoon and UN Resident Coordinator and UNDP Resident Representative, Una McCauley were also present on this occasion.", 
  "title": "UN assures continued support to Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1430-un-assures-continued-support-to-sri-lanka"
}