{
  "date": "July 23, 2017", 
  "text": "The new AOPV is intended to conduct patrols, policing, reconnaissance, surveillance, search and rescue, Humanitarian Assistance and Disaster Relief (HADR) and pollution control missions in Sri Lanka's maritime zones. Moreover, it can also be used for external fire-fighting missions.The 105.7m long, 13.6m wide ship also features maximum speed of 24 knots and displacement of 2,350 tons. Apart from that, the vessel will be manned by 18 officers and will accommodate up to 100 sailors. The AOPV could bear the endurance of 4,500 nm while operating cruising speed (12-14 knots) and is provided with a landing and hangar facility for Advanced Light Helicopter (ALH).The state of the art vessel tailor made for the mission requirement of the Sri Lanka Navy, cost an estimated USD 66.55 million when it reached the completion stage of its construction.The official commissioning of the ship is scheduled to be held on 02nd August 2017 in the presence of the President Maithripala Sirisena, at the Colombo harbour.The Goa Shipyard Ltd (GSL) delivered the 1st Advanced Offshore Patrol Vessel (AOPV), constructed at the Indian ship building facility, to Sri Lanka Navy yesterday (22nd July). The new AOPV is intended to conduct patrols, policing, reconnaissance, surveillance, search and rescue, Humanitarian Assistance and Disaster Relief (HADR) and pollution control missions in Sri Lanka's maritime zones. Moreover, it can also be used for external fire-fighting missions.The 105.7m long, 13.6m wide ship also features maximum speed of 24 knots and displacement of 2,350 tons. Apart from that, the vessel will be manned by 18 officers and will accommodate up to 100 sailors. The AOPV could bear the endurance of 4,500 nm while operating cruising speed (12-14 knots) and is provided with a landing and hangar facility for Advanced Light Helicopter (ALH).The state of the art vessel tailor made for the mission requirement of the Sri Lanka Navy, cost an estimated USD 66.55 million when it reached the completion stage of its construction.The official commissioning of the ship is scheduled to be held on 02nd August 2017 in the presence of the President Maithripala Sirisena, at the Colombo harbour.", 
  "title": "Sri Lanka Navy receives the largest AOPV from India", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1431-sri-lanka-navy-receives-the-largest-aopv-from-india"
}