{
  "date": "July 24, 2017", 
  "text": "He said Rs 350 million was allocated for the purpose. He was speaking at the Diamond Jubilee Anniversary of the Government Medical Laboratory Technologists Association at Temple Trees yesterday.Procurements will be done by the Health Ministry, and we have instructed to import them as soon as possible without following the tender procedure. Now our responsibility is to control dengue and gradually eliminate it. The dengue spread worsened due to garbage issue, he said.The Prime Minister, highlighting the importance of giving laboratory test reports on dengue within an hour, said the Health Minister would take stern action against the private hospitals and laboratories which delay blood test reports.The Premier said durable solution to garbage issue is now being worked out and added that the collapse of Meethotamulla garbage dump was a result of not addressing the garbage disposal issue by successive governments. (CDN)The Government will immediately procure new equipment for laboratory tests on Dengue, Prime Minister Ranil Wickremesinghe said. He said Rs 350 million was allocated for the purpose. He was speaking at the Diamond Jubilee Anniversary of the Government Medical Laboratory Technologists Association at Temple Trees yesterday.Procurements will be done by the Health Ministry, and we have instructed to import them as soon as possible without following the tender procedure. Now our responsibility is to control dengue and gradually eliminate it. The dengue spread worsened due to garbage issue, he said.The Prime Minister, highlighting the importance of giving laboratory test reports on dengue within an hour, said the Health Minister would take stern action against the private hospitals and laboratories which delay blood test reports.The Premier said durable solution to garbage issue is now being worked out and added that the collapse of Meethotamulla garbage dump was a result of not addressing the garbage disposal issue by successive governments. (CDN)", 
  "title": "Government will immediately procure new equipment for dengue tests - PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1435-government-will-immediately-procure-new-equipment-for-dengue-tests-pm"
}