{
  "date": "2017-07-25", 
  "text": "The discussion was centered on exchanging expertise and experiences of security forces of Sri Lanka with other countries and systematically maintaining overseas training for members of the tri forces.Another matter that was drawn attention during the discussion is how security forces can contribute in the effort to strengthen the living conditions of the people in the North and the East.At the same time, attention was drawn how to correct misimpression about the security forces of Sri Lanka, if any, among the global community. Among the other matters that were discussed during the meeting were dignity of Sri Lankan security forces, safety of them, sovereignty of the country, steps that should be taken to protect the territorial integrity of the country and, how to deal with the international community in this regard.The meeting also discussed how to protect human rights to strengthen the operation to win over the international community under the guidance of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe to march forward the country as a whole. Further, it was discussed during the meeting about the responsibility and the contribution by the tri forces in order to protect human rights of all communities under the Constitution, how to strengthen them and, how to identify if there are any hurdles towards such efforts.Defense Secretary Kapila Vydyarathna, Foreign Secretary Esala Weerakoon, Secretary of Law and Order and Southern Development Ministry Jagath Wijeweera, Chairman of the Sri Lanka Human Rights Commission Deepika Udugama also participated.A special discussion was held among Defense Secretary, tri forces commanders, IGP, officers of Sri Lanka Human Rights Commission and Minister of Foreign Affairs Ravi Karunanayake yesterday (24th July) at the Ministry of Foreign Affairs. The discussion was centered on exchanging expertise and experiences of security forces of Sri Lanka with other countries and systematically maintaining overseas training for members of the tri forces.Another matter that was drawn attention during the discussion is how security forces can contribute in the effort to strengthen the living conditions of the people in the North and the East.At the same time, attention was drawn how to correct misimpression about the security forces of Sri Lanka, if any, among the global community. Among the other matters that were discussed during the meeting were dignity of Sri Lankan security forces, safety of them, sovereignty of the country, steps that should be taken to protect the territorial integrity of the country and, how to deal with the international community in this regard.The meeting also discussed how to protect human rights to strengthen the operation to win over the international community under the guidance of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe to march forward the country as a whole. Further, it was discussed during the meeting about the responsibility and the contribution by the tri forces in order to protect human rights of all communities under the Constitution, how to strengthen them and, how to identify if there are any hurdles towards such efforts.Defense Secretary Kapila Vydyarathna, Foreign Secretary Esala Weerakoon, Secretary of Law and Order and Southern Development Ministry Jagath Wijeweera, Chairman of the Sri Lanka Human Rights Commission Deepika Udugama also participated.", 
  "title": "Special meeting on security forces at Foreign Ministry", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1438-special-meeting-on-security-forces-at-foreign-ministry"
}