{
  "date": "July 25, 2017", 
  "text": "This was organized by the Ministry of Sports and Sri Lanka Olympic Association, in line with the golden jubilee of the Sports Ministry. Forty one (41) Sri Lankan athletes were offered golden awards by the President on this occasion.The President expressed his satisfaction about the opportunity he got to commend the athletes who had earned world reputation and honor for Sri Lanka.Commending the men and women of skill is an honor offered to them. It is also a task, performed for the betterment of the nation, the President said. He pointed out the importance of initiating a comprehensive program to make use of the Sri Lankan athletes knowledge and experience to guide the future generation.He emphasized that the government will take every action for the welfare of all these athletes.The President made a donation of Rs. 500,000.00 to Sri Lanka Olympian at this occasion. Chairman of Sri Lanka Olympians Mrs. Sriyani Kulawansha said Sri Lankan Olympic athletes did not have such an opportunity before.Ministers Dayasiri Jayasekara, S. B. Dissanayake, Chief Minister of Western Province Isura Dewapriya, Provincial Sports Ministers, Secretary to the Ministry of Sports R. B. Dissanayake, Secretary to the Sri Lanka Olympians Damayanthi Darsha and Sugath Thilakarathne were among those participated in this occasion.A ceremony to present golden awards to athletes who represented Sri Lanka at the Olympic games from 1948 to date, was held under the patronage of President Maithripala Sirisena yesterday (24th July) at the Presidents House. This was organized by the Ministry of Sports and Sri Lanka Olympic Association, in line with the golden jubilee of the Sports Ministry. Forty one (41) Sri Lankan athletes were offered golden awards by the President on this occasion.The President expressed his satisfaction about the opportunity he got to commend the athletes who had earned world reputation and honor for Sri Lanka.Commending the men and women of skill is an honor offered to them. It is also a task, performed for the betterment of the nation, the President said. He pointed out the importance of initiating a comprehensive program to make use of the Sri Lankan athletes knowledge and experience to guide the future generation.He emphasized that the government will take every action for the welfare of all these athletes.The President made a donation of Rs. 500,000.00 to Sri Lanka Olympian at this occasion. Chairman of Sri Lanka Olympians Mrs. Sriyani Kulawansha said Sri Lankan Olympic athletes did not have such an opportunity before.Ministers Dayasiri Jayasekara, S. B. Dissanayake, Chief Minister of Western Province Isura Dewapriya, Provincial Sports Ministers, Secretary to the Ministry of Sports R. B. Dissanayake, Secretary to the Sri Lanka Olympians Damayanthi Darsha and Sugath Thilakarathne were among those participated in this occasion.", 
  "title": "President presents golden awards to Sri Lankan Olympic athletes ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1442-president-presents-golden-awards-to-sri-lankan-olympic-athletes"
}