{
  "date": "July 26, 2017", 
  "text": "The National Youth Flag Day was declared in 1985, which was the World Youth Year.The National Youth Flag Day was celebrated from 2011 to 2015. It was celebrated from 2016 under the current government. Accordingly, this is the 2nd celebration of National Youth Flag Day of this government.The flag program is carried out with the participation of the members of 13,000 youth clubs island-wide.This is carried out with objective of collecting grants for youth development. Accordingly, community development projects, recognized by youth clubs will be initiated.Chairman and the Director of the National Youth Services Council Eranda Weliange pinned the first flag on the President at this occasion.Ministers Ravi Karunanayake, Arjuna Ranatunga, Dayasiri Jayasekara, Secretary to the Sri Lanka Federation of Youth Clubs Upul Sandaruwan and the Administrative Secretary and District Youth Services Officer Mahesh Thilakarathne also were present at this occasion.The first flag of the youth flag program, organized by the National Youth Services Council and Sri Lanka Federation of Youth Clubs, in line with the National Youth Day, which falls on 26th July, was pinned on President Maithripala Sirisena yesterday (25th July) at the Presidential Secretariat. The National Youth Flag Day was declared in 1985, which was the World Youth Year.The National Youth Flag Day was celebrated from 2011 to 2015. It was celebrated from 2016 under the current government. Accordingly, this is the 2nd celebration of National Youth Flag Day of this government.The flag program is carried out with the participation of the members of 13,000 youth clubs island-wide.This is carried out with objective of collecting grants for youth development. Accordingly, community development projects, recognized by youth clubs will be initiated.Chairman and the Director of the National Youth Services Council Eranda Weliange pinned the first flag on the President at this occasion.Ministers Ravi Karunanayake, Arjuna Ranatunga, Dayasiri Jayasekara, Secretary to the Sri Lanka Federation of Youth Clubs Upul Sandaruwan and the Administrative Secretary and District Youth Services Officer Mahesh Thilakarathne also were present at this occasion.", 
  "title": "First youth flag pinned on President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1445-first-youth-flag-pinned-on-president"
}