{
  "date": "2017-07-27", 
  "text": "The judgment is a legal ruling of the European Court of Justice on the procedure used for listing the LTTE. It does not involve any assessment by the Court of the substantive reasons for the designation of the LTTE as a terrorist organization, a statement from EU said yesterday.The annulled measures cover the period 2011-2015. Designations of the LTTE adopted by the Council later in 2015-2017 are not covered by the present ruling. This means that the LTTE remains listed as a terrorist organization by the EU.EU institutions systematically review their practices following rulings of the European Court of Justice. The current ruling will be carefully analyzed. Any necessary remedial action will be taken to adjust the listings to these procedural requirements and to ensure legally robust designations.The EU continues to consider the LTTE as a terrorist organization and the EU's restrictive measures against the LTTE remain in force.\"European Union said that it had taken note of the European Court of Justice's judgment annulling measures against the LTTE, namely the designation of the LTTE as a terrorist organization and the freezing of LTTE funds. The judgment is a legal ruling of the European Court of Justice on the procedure used for listing the LTTE. It does not involve any assessment by the Court of the substantive reasons for the designation of the LTTE as a terrorist organization, a statement from EU said yesterday.The annulled measures cover the period 2011-2015. Designations of the LTTE adopted by the Council later in 2015-2017 are not covered by the present ruling. This means that the LTTE remains listed as a terrorist organization by the EU.EU institutions systematically review their practices following rulings of the European Court of Justice. The current ruling will be carefully analyzed. Any necessary remedial action will be taken to adjust the listings to these procedural requirements and to ensure legally robust designations.The EU continues to consider the LTTE as a terrorist organization and the EU's restrictive measures against the LTTE remain in force.\"", 
  "title": "LTTE remains a terrorist organization- EU", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1448-ltte-remains-a-terrorist-organization-eu"
}