{
  "date": "July 27, 2017", 
  "text": "He said the strike disrupts the dengue prevention programs, disrupts the economy and the examinations that are scheduled to begin soon. The government has decided to make fuel provision an essential service, the PM said.Making a ministerial statement in Parliament on the gazette notification making petroleum fuel distribution an essential service, the Prime Minister said the gazette notification on making petroleum distribution an essential service was issued on Tuesday evening.We decided to make a statement in Parliament on the policy of the government as we always stand to protect parliamentary tradition and democracy, the PM said.He said that this was not practiced during the previous regime which went even to the extent of not revealing financial matters to Parliament. During the Rajapaksa regime, Parliament had become a mere rubber seal. After President Maithripala Sirisena was elected President,democracy was established in the country, the Premier said.The peoples right to life and expression was guaranteed. However, it was observed that this freedom was utilized by several to achieve their petty political ends.The Premier said there was no issue with the trade unions struggling to win their rights. If someone attempted to lead the country into anarchy the government will have to act responsibly, he said.Our government never refused to discuss with trade unions. Our ministers had discussed with them on several occasions. I had discussions with them on April 24 and July 13.He said that they discussed on the matters of Trincomalee and Hambantota Oil Tank farms and the matter of renovation of the Sapugaskanda refinery. He said that government and the trade unions came to an agreement on two matters. He added that the other being matter on Trincomalee oil tank farm the trade unions needed to consult their representatives. He added that there were cases before court on lease agreements on the Trincomalee oil tanks and following the judgments, the matter can be discussed.We have instructed the trade unions to hand over their proposals on the Sapugaskanda refinery and then they could be considered, he said. The Hambantota Oil Tanks belong to the Ports Authority. It was given by former President Mahinda Rajapaksa. Then nobody spoke on it, the Premier said. We have directed the trade union requests to the Ministry. I also assured them that the governments actions will not cause any harm to the CPC. It is pathetic that CPC trade unions resumed a trade union action in such a situation.If the fuel distribution is disrupted the smooth function of all activities come an end including the transport and health, Premier said. It also disrupts the flight arrival and departure and activities at the Port and in turn the strike also affects examinations scheduled to be held in near future.The Premier also said that by noon yesterday (Wednesday) everything returned to normal. The fuel bowsers are being sent out of the CPC refinery. The aeroplane fuel tanks are being sent to Katunayake too, the Premier said. We hold the democratic principles in esteem. We respect the rule of law. But we dont bow down to those forces that are bent on destabilizing the country, he said. (CDN)The CPC TU strike is not acceptable when a number of discussion rounds with unions had ended successfully, Prime Minister Ranil Wickremesinghe said in Parliament yesterday. He said the strike disrupts the dengue prevention programs, disrupts the economy and the examinations that are scheduled to begin soon. The government has decided to make fuel provision an essential service, the PM said.Making a ministerial statement in Parliament on the gazette notification making petroleum fuel distribution an essential service, the Prime Minister said the gazette notification on making petroleum distribution an essential service was issued on Tuesday evening.We decided to make a statement in Parliament on the policy of the government as we always stand to protect parliamentary tradition and democracy, the PM said.He said that this was not practiced during the previous regime which went even to the extent of not revealing financial matters to Parliament. During the Rajapaksa regime, Parliament had become a mere rubber seal. After President Maithripala Sirisena was elected President,democracy was established in the country, the Premier said.The peoples right to life and expression was guaranteed. However, it was observed that this freedom was utilized by several to achieve their petty political ends.The Premier said there was no issue with the trade unions struggling to win their rights. If someone attempted to lead the country into anarchy the government will have to act responsibly, he said.Our government never refused to discuss with trade unions. Our ministers had discussed with them on several occasions. I had discussions with them on April 24 and July 13.He said that they discussed on the matters of Trincomalee and Hambantota Oil Tank farms and the matter of renovation of the Sapugaskanda refinery. He said that government and the trade unions came to an agreement on two matters. He added that the other being matter on Trincomalee oil tank farm the trade unions needed to consult their representatives. He added that there were cases before court on lease agreements on the Trincomalee oil tanks and following the judgments, the matter can be discussed.We have instructed the trade unions to hand over their proposals on the Sapugaskanda refinery and then they could be considered, he said. The Hambantota Oil Tanks belong to the Ports Authority. It was given by former President Mahinda Rajapaksa. Then nobody spoke on it, the Premier said. We have directed the trade union requests to the Ministry. I also assured them that the governments actions will not cause any harm to the CPC. It is pathetic that CPC trade unions resumed a trade union action in such a situation.If the fuel distribution is disrupted the smooth function of all activities come an end including the transport and health, Premier said. It also disrupts the flight arrival and departure and activities at the Port and in turn the strike also affects examinations scheduled to be held in near future.The Premier also said that by noon yesterday (Wednesday) everything returned to normal. The fuel bowsers are being sent out of the CPC refinery. The aeroplane fuel tanks are being sent to Katunayake too, the Premier said. We hold the democratic principles in esteem. We respect the rule of law. But we dont bow down to those forces that are bent on destabilizing the country, he said. (CDN)", 
  "title": "PM says strike is not acceptable", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1449-pm-says-strike-is-not-acceptable"
}