{
  "date": "2017-07-27", 
  "text": "The minister points out that there is a secret scheming behind these activities to mar his character.Answering Journalists at an event held to mark the National Youth Flag Day yesterday (26th July), Minister Karunanayake expressed that nothing has happened to those of the previous regime who destroyed this country. But a minister of our Government goes before an Independent Commission. This is the transparency of the rule of the Good Governance.Didnt they know that I am a Cabinet Minister to summon me before the Commission yesterday (July 25)? I was summoned on the day where I had commitment to attend the Cabinet Meeting. Therefore, I informed the Commission through my lawyers to allocate another day. These things were publicly talked in parliament seven or eight months ago. There is nothing to hide, he added.A two or three media houses have been got into their hold and attempt to assassinate the character of Ravi Karunanayake for no reason. They have nothing else to show therefore are doing this kind of things. I will answer before the Commission on these matters at the correct time. Then, the truth will be exposed to the entire county, Minister Karunanayake said.Minister of Foreign Affairs Ravi Karunanayake says that he will give proper answers to the statements made against him when he appears before the Presidential Commission probing the Central Bank Bond Issue on 2nd August. The minister points out that there is a secret scheming behind these activities to mar his character.Answering Journalists at an event held to mark the National Youth Flag Day yesterday (26th July), Minister Karunanayake expressed that nothing has happened to those of the previous regime who destroyed this country. But a minister of our Government goes before an Independent Commission. This is the transparency of the rule of the Good Governance.Didnt they know that I am a Cabinet Minister to summon me before the Commission yesterday (July 25)? I was summoned on the day where I had commitment to attend the Cabinet Meeting. Therefore, I informed the Commission through my lawyers to allocate another day. These things were publicly talked in parliament seven or eight months ago. There is nothing to hide, he added.A two or three media houses have been got into their hold and attempt to assassinate the character of Ravi Karunanayake for no reason. They have nothing else to show therefore are doing this kind of things. I will answer before the Commission on these matters at the correct time. Then, the truth will be exposed to the entire county, Minister Karunanayake said.", 
  "title": "Due answers will be given before Commission on August 2  Minister Karunanayake ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1450-due-answers-will-be-given-before-commission-on-august-2-minister-karunanayake"
}