{
  "date": "2017-07-28", 
  "text": "The keys of the water bowsers were handed over by two leaders of the Korean Parliamentary Delegation, Hong Moon-jong and Yoo Ki-june, two senior members of the Korean National Assembly. Minister of Disaster Management, Anura Priyadharshana Yapa and Korean Ambassador Won-sam Chang were also present on this occassion.President Sirisena thanked the Government and the people of South Korea for providing assistance to drought victims. Nearly 2/3rds of the country is badly affected by the droughts and the people are in need of water, the bowsers donated by Korea are quite useful, he said.Minister Anura Priyadharshana Yapa said the bowsers would be dispatched immediately to the drought affected districts of Jaffna, Kilinochchi, Anuradhapura, Polonnaruwa and Trincomalee Districts.Referring to close bilateral cooperation, the President thanked Korea for providing employment to nearly 30,000 Sri Lankans and looking after them properly.Leader of the delegation, Hong Moon-jong thanked Sri Lanka for the support extended to Korea at the international forums. He said that the Korean employers are quite satisfied about job performances and efficiency of Sri Lankan workers. He said that the delegation is visiting Sri Lanka to attend the events to mark the 40th anniversary of establishment of diplomatic relations between the two countries.Former Korean Minister of Oceanic Affairs, Yoo Ki-june said an island nation like Sri Lanka could make maximum utilization of the vast sea resources and added that Koreas technical knowledge in the fisheries sector could be shared with Sri Lanka to develop fishing industry in this country. He suggested that the cooperation in the fisheries sector could be established through the Korea International Cooperation Agency (KOICA).President Sirisena welcomed the proposal for cooperation in fisheries sector and said with the support of Korean technical support Sri Lanka could further increase fish exports to Europe and other countries.Both former and the current Directors of KOICA were also present during the discussion.Republic of Korea provided a humanitarian assistance package to Sri Lanka for drought relief. A Korean Parliamentary delegation handed over the relief material including eight lorry-mounted water bowsers to President Maithripala Sirisena at the Presidents Official Residence in Colombo today (28th July). The keys of the water bowsers were handed over by two leaders of the Korean Parliamentary Delegation, Hong Moon-jong and Yoo Ki-june, two senior members of the Korean National Assembly. Minister of Disaster Management, Anura Priyadharshana Yapa and Korean Ambassador Won-sam Chang were also present on this occassion.President Sirisena thanked the Government and the people of South Korea for providing assistance to drought victims. Nearly 2/3rds of the country is badly affected by the droughts and the people are in need of water, the bowsers donated by Korea are quite useful, he said.Minister Anura Priyadharshana Yapa said the bowsers would be dispatched immediately to the drought affected districts of Jaffna, Kilinochchi, Anuradhapura, Polonnaruwa and Trincomalee Districts.Referring to close bilateral cooperation, the President thanked Korea for providing employment to nearly 30,000 Sri Lankans and looking after them properly.Leader of the delegation, Hong Moon-jong thanked Sri Lanka for the support extended to Korea at the international forums. He said that the Korean employers are quite satisfied about job performances and efficiency of Sri Lankan workers. He said that the delegation is visiting Sri Lanka to attend the events to mark the 40th anniversary of establishment of diplomatic relations between the two countries.Former Korean Minister of Oceanic Affairs, Yoo Ki-june said an island nation like Sri Lanka could make maximum utilization of the vast sea resources and added that Koreas technical knowledge in the fisheries sector could be shared with Sri Lanka to develop fishing industry in this country. He suggested that the cooperation in the fisheries sector could be established through the Korea International Cooperation Agency (KOICA).President Sirisena welcomed the proposal for cooperation in fisheries sector and said with the support of Korean technical support Sri Lanka could further increase fish exports to Europe and other countries.Both former and the current Directors of KOICA were also present during the discussion.", 
  "title": "Korea provides drought relief", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1457-korea-provides-drought-relief"
}