{
  "date": "2017-08-01", 
  "text": "The Ambassador of Russia in Sri Lanka, Alexander A. Karchava and, Ambassador of the United States, Atul Keshap met Minister of Foreign Affairs Ravi Karunanayake this afternoon at the Ministry of Foreign Affairs.Russian Ambassador in Sri Lanka Alexander A Karchava who met minister Karunanayake said that the friendly ties between Russia and Sri Lanka have been strengthened. The ambassador also said that Russia continues to assist Sri Lanka in her future development activities. In response, Foreign Minister Ravi Karunanayake said that Sri Lanka always treats Russia as a friend and its continuous support that extended to Sri Lanka is appreciated.Meanwhile, Ambassador of the United States of America Atul Keshap who met Minister of Foreign Affairs said that the United States always committed to support Sri Lanka to uplift the living conditions of people.Ambassador Keshap who commented that the level of health, education, and social development are in a higher position today in Sri Lanka and, pointed out that he is pleased to witness such development in the country.He also said that United States will extend further support to strengthen such development sectors in the future as well.Responding to Ambassador Keshap, Minister of Foreign Affairs Ravi Karunanayake said that the commitment made by the United States to strengthen bilateral ties between America and Sri Lanka is of paramount importanceThe Ambassador of Russia in Sri Lanka, Alexander A. Karchava and, Ambassador of the United States, Atul Keshap met Minister of Foreign Affairs Ravi Karunanayake this afternoon at the Ministry of Foreign Affairs.Russian Ambassador in Sri Lanka Alexander A Karchava who met minister Karunanayake said that the friendly ties between Russia and Sri Lanka have been strengthened. The ambassador also said that Russia continues to assist Sri Lanka in her future development activities. In response, Foreign Minister Ravi Karunanayake said that Sri Lanka always treats Russia as a friend and its continuous support that extended to Sri Lanka is appreciated.Meanwhile, Ambassador of the United States of America Atul Keshap who met Minister of Foreign Affairs said that the United States always committed to support Sri Lanka to uplift the living conditions of people.Ambassador Keshap who commented that the level of health, education, and social development are in a higher position today in Sri Lanka and, pointed out that he is pleased to witness such development in the country.He also said that United States will extend further support to strengthen such development sectors in the future as well.Responding to Ambassador Keshap, Minister of Foreign Affairs Ravi Karunanayake said that the commitment made by the United States to strengthen bilateral ties between America and Sri Lanka is of paramount importance", 
  "title": " U.S., Russia envoys assure to support Sri Lanka's future development", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1463-ambassadors-of-russia-and-america-in-sri-lanka-meet-fm"
}