{
  "date": "2017-08-02", 
  "text": "There is a saying that most valuable gift one could give is a precious gift one received.President Maithripala Sirisena presents the invaluable artifact he received from Russian President Vladimir Putin to the National Museum today (August 2).He received a royal sword (Kastane) of the Kandyan era of the 19th century from President Vladimir Putin during his state visit to Russia in March this year. President Putin, a known lover of antique weapons, graciously decided to part with one of his treasured antiques for the sake of friendship. It was a pleasant surprise for President Sirisena as the Russian leader gave this invaluable gift when he entered the Green Chimney Room in the Kremlin at the Red Square for bilateral talks with President Putin. The Russian leader said he was presenting this significant gift to President Sirisena symbolizing the close relationship between the two countries.When President Sirisena was admiring the shining weapon and its beautifully carved case which was studded with gems, Putin explained that it was an antique Kastane belonging to a Kandyan Nilame (Nobleman) and that it has a fascinating history.This sword had been brought to England in 1906 and later bought by Russia at the leading archeological artifact auction house, Sothebys in London. The Kastane (sword, hanger) was the major attribute of the noblemen of Sri Lanka. People who were not noble by origin were not eligible to bear or even keep a Kastane. Therefore, the purpose of such arm was to underline the stature of the bearer. According to Alex Freger (Tel Aviv), a high-profile Israeli expert on bladed weapons, the item subject to expertise descends from the Kandyan rulers (kings).Freger noted that the Kandy ruling class had always played an essential political and religious role in Sri Lanka. The temple which still keeps custody over the sacred Buddhist object  Tooth of Buddha  was located at the premises of the Royal Palace, and up to this day is the destination of pilgrims from all over the world.The Kastane was auctioned at the Sothebys Auction House on 19 December 2006 in the elite section of Property of a Princely Family and Other Aristocratic Estates.", 
  "title": "President gifts the gifted kastane to National Museum", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1466-president-gifts-the-gifted-kastane-to-national-museum"
}