{
  "date": "August 03, 2017", 
  "text": "The minister made these observations addressing the Diploma awarding ceremony of the Sri Lanka Press Council (SLPC) held yesterday at the BMICH under the patronage of President Maithripala Sirisena.The SLPC stood for press freedom and fulfilled readers or viewers aspirations, the minister said.The SLPC is working to arm journalists with knowledge, ability and media ethics. The SLPC is duty bound to protect media freedom. It is also important not to allow destructive elements to misuse the media freedom, he said.\"It is important to create self-disciplined journalists rather than control media by regulations and guidelines, he said.Former governments imposed regulations, circulars and restrictions to control the media. Such practices hampered the media freedom of the country from time to time, he said.Quoting part of a book titled Lankawe Puwathpath Mella Kirima of late journalist Gunadasa Liyanage, the minister said media freedom is destroyed, when the media of a country is controlled or suppressed by the government. Media freedom will come to an end if media organizations fail to understand the gravity or the responsibility of the media, he said.\"After January 8, 2015, it is observed that there is media freedom. Journalists can perform their duty without any interference of the government,\" Minister Samaraweera said. About 13 journalists were killed during the previous regime. Journalist Pradeep Ekneligoda is still missing. About 84 journalists were assaulted. Several persons were jailed. Lanka e-news, Sirasa, Siyatha and a few other media institutions were attacked, while several other institutions were threatened. The then government not only attacked journalist, but also created a white van culture, the minister said.Present President Maithripala Sirisena could end the dark era after becoming the President of the country, he said.Minister Samaraweera said media censoring is no longer valid in the 21st century. Journalists are duty bound to report news without resorting to fabrications, he said. (CDN)Finance and Mass Media Minister Mangala Samaraweera urged media personnel not to misuse the media freedom. The Sri Lanka Press Council (SLPC), which started in 1973, has been doing a yeoman service to the media sector while abiding by the principles on which the SLPC was formed, he said.The minister made these observations addressing the Diploma awarding ceremony of the Sri Lanka Press Council (SLPC) held yesterday at the BMICH under the patronage of President Maithripala Sirisena. The SLPC stood for press freedom and fulfilled readers or viewers aspirations, the minister said.The SLPC is working to arm journalists with knowledge, ability and media ethics. The SLPC is duty bound to protect media freedom. It is also important not to allow destructive elements to misuse the media freedom, he said.\"It is important to create self-disciplined journalists rather than control media by regulations and guidelines, he said.Former governments imposed regulations, circulars and restrictions to control the media. Such practices hampered the media freedom of the country from time to time, he said.Quoting part of a book titled Lankawe Puwathpath Mella Kirima of late journalist Gunadasa Liyanage, the minister said media freedom is destroyed, when the media of a country is controlled or suppressed by the government. Media freedom will come to an end if media organizations fail to understand the gravity or the responsibility of the media, he said.\"After January 8, 2015, it is observed that there is media freedom. Journalists can perform their duty without any interference of the government,\" Minister Samaraweera said. About 13 journalists were killed during the previous regime. Journalist Pradeep Ekneligoda is still missing. About 84 journalists were assaulted. Several persons were jailed. Lanka e-news, Sirasa, Siyatha and a few other media institutions were attacked, while several other institutions were threatened. The then government not only attacked journalist, but also created a white van culture, the minister said.Present President Maithripala Sirisena could end the dark era after becoming the President of the country, he said.Minister Samaraweera said media censoring is no longer valid in the 21st century. Journalists are duty bound to report news without resorting to fabrications, he said. (CDN)", 
  "title": "Minister urges journalists not to misuse media", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1473-minister-urges-journalists-not-to-misuse-media"
}