{
  "date": "2017-08-05", 
  "text": "The mistakes have been done from the beginning and we are attempting to rectify them to ensure that the problems faced by the people are solved and there would not be any issues in the future, the President said.President Sirisena made these remarks after the Norwegian expert submitted the interim report to the President at the Presidents Official Residence in Colombo, yesterday (4th Aug.).The expert Bent Aagaard said that the preliminary studies had not forecast the possibility of large water seepage in the tunnel and he further said that the machinery used for the project had not been capable of proper strengthening of the tunnel wall and seal them with strong grout materials.Excavation must be done by using suitable machinery on the tunnel wall and grouting all the leaks in the tunnel to ensure that there will be no seepage in the tunnel in the future, the Norwegian expert said. He further said that the contractors had not been prepared for large scale water ingress in the tunnel.The expert advised that it would be necessary to get special grout materials and machinery before remaining 4 and half Km of the tunnel is dug as a part of it is below the of residential areas.The expert was of the view that a better comprehensive preliminary study could have prevented the water ingress into the tunnel leading to a severe water dearth in some areas. The President requested the expert to provide a full report on how the leakage could be completely stopped and the reasons for not taking into the consideration the water leakage in the previous reports.The President further said that such mega scale projects should not undertake without proper studies. He also said that Uma Oya problems are lessons for the future to avoid such mistakes. President Sirisena said that the government plans to obtain expert advice prior to implementation of the next project in which a 22 km long tunnel is to be constructed.President Maithripala Sirisena said that it is regrettable that series of problems have arisen during the implementation of the Uma Oya Multi-purpose Development Project as the previous government has hurriedly commenced the project without proper study of the feasibility report and the Environmental Impact Assessment (EIA). The mistakes have been done from the beginning and we are attempting to rectify them to ensure that the problems faced by the people are solved and there would not be any issues in the future, the President said.President Sirisena made these remarks after the Norwegian expert submitted the interim report to the President at the Presidents Official Residence in Colombo, yesterday (4th Aug.).The expert Bent Aagaard said that the preliminary studies had not forecast the possibility of large water seepage in the tunnel and he further said that the machinery used for the project had not been capable of proper strengthening of the tunnel wall and seal them with strong grout materials.Excavation must be done by using suitable machinery on the tunnel wall and grouting all the leaks in the tunnel to ensure that there will be no seepage in the tunnel in the future, the Norwegian expert said. He further said that the contractors had not been prepared for large scale water ingress in the tunnel.The expert advised that it would be necessary to get special grout materials and machinery before remaining 4 and half Km of the tunnel is dug as a part of it is below the of residential areas.The expert was of the view that a better comprehensive preliminary study could have prevented the water ingress into the tunnel leading to a severe water dearth in some areas. The President requested the expert to provide a full report on how the leakage could be completely stopped and the reasons for not taking into the consideration the water leakage in the previous reports.The President further said that such mega scale projects should not undertake without proper studies. He also said that Uma Oya problems are lessons for the future to avoid such mistakes. President Sirisena said that the government plans to obtain expert advice prior to implementation of the next project in which a 22 km long tunnel is to be constructed.", 
  "title": "Norwegian expert submits interim report on Uma Oya Project", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1480-norwegian-expert-submits-interim-report-on-uma-oya-project"
}