{
  "date": "August 05, 2017", 
  "text": "He made these remarks participating in an event to vest the Medawachchiya Berty Premalal Dissanayake new Economic Center with the public, yesterday (4th July).The North Central Provincial Council built this Economic Center at a cost of Rs. 48 million with the aim of ensuring sustainable economy for the rural farming communities and the Economic Center comprised of all the facilities including 28 stalls and an administrative building. The building had been abandoned for over 9 years, although work commenced, and the present government took steps to expedite the construction works and to hand it over to the public.The farming communities of this country grieve from poverty, low income status and lack of facilities to fulfill their daily needs, the President said adding that the present government has launched many projects to uplift their living standards and to provide facilities for the development of the agricultural sector.The government is working to create the background for the young generation to move forward in the agricultural sector with the latest technology, he said. The President further said for the development of the society as well as the country required strategies based on self-developed living style and economy. The President said Moragahakanda Project was implemented successfully amidst many barriers to end the water problem of the Rajarata farmers. With this project, 600 tanks in Anuradhapura, Polonnaruwa and North-Western Province will be renovated and through this initiative the solutions for the water issue of the farmers in those areas will be found, he added.Meanwhile, the ceremony to officially vest the Isipathana Maha Vidyalaya in Medavachchiya with students was held today under the patronage of the President. This school has been built at a cost of Rs. 160 million through the provisions of North-Central Provincial Council, with the objective of building a knowledge-based society.President Maithripala Sirisena says even though an agricultural country, during the past period priority was not given for the development projects aimed at the upliftment of the economy of the farmers as well as the issues of them were not resolved. He made these remarks participating in an event to vest the Medawachchiya Berty Premalal Dissanayake new Economic Center with the public, yesterday (4th July).The North Central Provincial Council built this Economic Center at a cost of Rs. 48 million with the aim of ensuring sustainable economy for the rural farming communities and the Economic Center comprised of all the facilities including 28 stalls and an administrative building. The building had been abandoned for over 9 years, although work commenced, and the present government took steps to expedite the construction works and to hand it over to the public.The farming communities of this country grieve from poverty, low income status and lack of facilities to fulfill their daily needs, the President said adding that the present government has launched many projects to uplift their living standards and to provide facilities for the development of the agricultural sector.The government is working to create the background for the young generation to move forward in the agricultural sector with the latest technology, he said. The President further said for the development of the society as well as the country required strategies based on self-developed living style and economy. The President said Moragahakanda Project was implemented successfully amidst many barriers to end the water problem of the Rajarata farmers. With this project, 600 tanks in Anuradhapura, Polonnaruwa and North-Western Province will be renovated and through this initiative the solutions for the water issue of the farmers in those areas will be found, he added.Meanwhile, the ceremony to officially vest the Isipathana Maha Vidyalaya in Medavachchiya with students was held today under the patronage of the President. This school has been built at a cost of Rs. 160 million through the provisions of North-Central Provincial Council, with the objective of building a knowledge-based society.", 
  "title": "Farmers issues not solved during past period  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1481-farmers-issues-not-solved-during-past-period-president"
}