{
  "date": "August 08, 2017", 
  "text": "Minister Samaraweera noted that when the new government assumed office there were two main challenges to resolve, the huge debt problem and the rights issue which had tarnished Sri Lankas image in the eyes of the international community.Minister Samaraweera was speaking at a ceremony organized to commence the Matara stage IV water supply project at the National Water Supply & Drainage Board Office premises at Nupe, Matara last Sunday.When we came to office, this government was burdened with many things.Debt was one, human rights violations was another. We have been able to address both issues by now. We have more challenges in this regard but we are on the right track, Minister Samaraweera said.The minister explaining the debt situation noted Sri Lanka has to repay Rs.3.2 trillion within the next two years but our annual income is only Rs. 3.12 trillion.The minister said, We have to find ways and means to pay this debt in 2018 and 2019. It should be noted that of this 82% were loans obtained by the previous government. By leasing the Hambanthota Port, we have been able to attract investors to the Hambanthota, Monaragala, Galle and Matara districts not only from China but from South Korea, Germany, India and Japan.With similar ventures in the pipeline, we would be able to increase government revenue, the Minister said.The minister also noted that it was the governments policy to develop the country in collaboration with other nations.Whenever development projects were introduced they have always met with criticism but it is those who criticized the most in the past that are making most use of them now. It is now that we are laying the foundation to develop this nation for future generations, Minister Samaraweera added.The minister also stressed that the government will not pass on the countrys debt to the future generations.He said the government has initiated a massive island wide development program and the public will receive the benefits of the program within a very short period. (CDN)Finance and Media Minister Mangala Samaraweera asserted that the country is now moving forward with a stable economy after overcoming many obstacles in the past. Minister Samaraweera noted that when the new government assumed office there were two main challenges to resolve, the huge debt problem and the rights issue which had tarnished Sri Lankas image in the eyes of the international community.Minister Samaraweera was speaking at a ceremony organized to commence the Matara stage IV water supply project at the National Water Supply & Drainage Board Office premises at Nupe, Matara last Sunday.   When we came to office, this government was burdened with many things.   Debt was one, human rights violations was another. We have been able to address both issues by now. We have more challenges in this regard but we are on the right track, Minister Samaraweera said.   The minister explaining the debt situation noted Sri Lanka has to repay Rs.3.2 trillion within the next two years but our annual income is only Rs. 3.12 trillion.   The minister said, We have to find ways and means to pay this debt in 2018 and 2019. It should be noted that of this 82% were loans obtained by the previous government. By leasing the Hambanthota Port, we have been able to attract investors to the Hambanthota, Monaragala, Galle and Matara districts not only from China but from South Korea, Germany, India and Japan.   With similar ventures in the pipeline, we would be able to increase government revenue, the Minister said.  The minister also noted that it was the governments policy to develop the country in collaboration with other nations.  Whenever development projects were introduced they have always met with criticism but it is those who criticized the most in the past that are making most use of them now. It is now that we are laying the foundation to develop this nation for future generations, Minister Samaraweera added.   The minister also stressed that the government will not pass on the countrys debt to the future generations.   He said the government has initiated a massive island wide development program and the public will receive the benefits of the program within a very short period. (CDN)", 
  "title": "Country making progress overcoming many obstacles", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1489-country-making-progress-overcoming-many-obstacles"
}