{
  "date": "August 08, 2017", 
  "text": "He said the government succeeded in restoring GSP+ concessions. The country can export over 6,000 varieties of goods under tariff concessions, he said.The Prime Minister was speaking at the opening of the modernized Ambewela milk factory in Nuwara Eliya yesterday.The countrys income will increase, if we can export at least 50  100 varieties of goods under concession, he said.The Prime Minister said the government has faced the task of creating more investment opportunities in the country.We have received investments to set up an oil refinery, a steel factory, a liquefied natural gas plant and a cement factory in Hambantota, he said.Prime Minister Wickremesinghe said the government is creating industrial zones in the North Western Province and the Kalutara district generating thousands of employment opportunities.I set up three industrial zones in Biyagama. Pallekele, Horana, Koggala and Sithawaka industrial zones were established during our rule, he said.He said the government has put in place a new program to supply milch cows to dairy farmers.The youths who pass out from schools in the plantation sector should have freedom to secure a job of their choice. We are ensuring a better future for them, he said.Ministers P. Harrison and Navin Dissanayake were also present. (CDN)Sri Lanka can enhance foreign reserves and relieve the debt burden following the new agreement on the Hambantota Port signed between the Ports Authority and China Merchants Port Holdings, Prime Minister Ranil Wickremesinghe said yesterday. He said the government succeeded in restoring GSP+ concessions. The country can export over 6,000 varieties of goods under tariff concessions, he said.The Prime Minister was speaking at the opening of the modernized Ambewela milk factory in Nuwara Eliya yesterday.The countrys income will increase, if we can export at least 50  100 varieties of goods under concession, he said.The Prime Minister said the government has faced the task of creating more investment opportunities in the country.We have received investments to set up an oil refinery, a steel factory, a liquefied natural gas plant and a cement factory in Hambantota, he said.Prime Minister Wickremesinghe said the government is creating industrial zones in the North Western Province and the Kalutara district generating thousands of employment opportunities. I set up three industrial zones in Biyagama. Pallekele, Horana, Koggala and Sithawaka industrial zones were established during our rule, he said.He said the government has put in place a new program to supply milch cows to dairy farmers.The youths who pass out from schools in the plantation sector should have freedom to secure a job of their choice. We are ensuring a better future for them, he said. Ministers P. Harrison and Navin Dissanayake were also present. (CDN)", 
  "title": "Htota Port agreement cuts debt burden: PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1490-h-tota-port-agreement-cuts-debt-burden-pm"
}