{
  "date": "2017-08-09", 
  "text": "He said we should be proud to be Sri Lankans and on the other hand we should be proud to be Sinhalese, Tamils, Muslims, Buddhists, Hindus, or Christians.He made these remarks addressing the 20th Commemoration Ceremony of the Former Speaker of the Sri Lanka Parliament late Deshamanya M.A. Bakeer Markar held yesterday (8th Aug.) at BMICH.The Commemorative Lecture on Multiculturalism as a Basis for Peace was delivered by the Former Prime Minister of Turkey Prof. Ahmet Davutoglu.Premier Wickremesinghe said, Sri Lanka as a single state has a long history of more than 2, 000 years, so we should go forward with that. If we are not utilizing that history at the time we live together, we will be the biggest traitors of this country. Even after the war, let us go through that journey together, he added. He further added that through the Constitution, they are seeking the possibility of providing rights to every citizen of the country without making any belittlement.Prime Minister Ranil Wickremesinghe said that the country should move forward while protecting the Sri Lankan solidarity as well as the different identities. He said we should be proud to be Sri Lankans and on the other hand we should be proud to be Sinhalese, Tamils, Muslims, Buddhists, Hindus, or Christians.He made these remarks addressing the 20th Commemoration Ceremony of the Former Speaker of the Sri Lanka Parliament late Deshamanya M.A. Bakeer Markar held yesterday (8th Aug.) at BMICH.The Commemorative Lecture on Multiculturalism as a Basis for Peace was delivered by the Former Prime Minister of Turkey Prof. Ahmet Davutoglu.Premier Wickremesinghe said, Sri Lanka as a single state has a long history of more than 2, 000 years, so we should go forward with that. If we are not utilizing that history at the time we live together, we will be the biggest traitors of this country. Even after the war, let us go through that journey together, he added. He further added that through the Constitution, they are seeking the possibility of providing rights to every citizen of the country without making any belittlement.", 
  "title": "Sri Lankan solidarity as well as different identities should be protected - PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1495-sri-lankan-solidarity-as-well-as-different-identities-should-be-protected-pm"
}