{
  "date": "2017-08-11", 
  "text": "These projects are implemented as a solution to the problems caused by improper garbage disposal.Sri Lanka did not focus on how to use garbage as a resource. Under this new initiative a sanitary based environment-friendly method for final disposal related to the methods used in developed countries for waste management, will be introduced.The Ministry of Megapolis and Western Development has implemented a proper program to utilize garbage. Under this, KCHT Lanka Jang Company has invested Rs. 27 billion for these projects in Kerawalapitiya.Under this project 10 mega watts of electricity will be added to the national grid. In line with this, a garbage collecting center will be established in Aruwakkalu in Puttalam.The construction work of all these will be completed within the next two years.The construction work of the first two projects to generate electricity from garbage commenced under the patronage of President Maithripala Sirisena on 10th Aug. in Kerawalapitiya. These projects are implemented as a solution to the problems caused by improper garbage disposal.Sri Lanka did not focus on how to use garbage as a resource. Under this new initiative a sanitary based environment-friendly method for final disposal related to the methods used in developed countries for waste management, will be introduced.The Ministry of Megapolis and Western Development has implemented a proper program to utilize garbage. Under this, KCHT Lanka Jang Company has invested Rs. 27 billion for these projects in Kerawalapitiya.Under this project 10 mega watts of electricity will be added to the national grid. In line with this, a garbage collecting center will be established in Aruwakkalu in Puttalam.The construction work of all these will be completed within the next two years.", 
  "title": "Projects to generate electricity from garbage commence", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1503-projects-to-generate-electricity-from-garbage-commence"
}