{
  "date": "2017-08-11", 
  "text": "As a result, they have come up with a new vision to uplift those services and ensure safety of those activities with an action plan that has already been given to the public. The project will be implemented as a major development strategy to uplift the national economy. All the information and activities related to the project have been published by the Policy Development Office on their official Facebook page:www.facebook.com/policydevelopmentoffice.While Sri Lanka Tourism Development Authority (SLTDA) plays the leading role to the entire process, adventure tourism activities related to water, air and land are governed under the supervision of Sri Lankan Navy, Air Force and Army respectively. Sri Lanka Telecommunication Regulatory Commission is responsible for immediate action regarding communication and rescue processes and Sri Lanka Standard Institution certifies the standards of adventure activities. Government, non-government and voluntary institutions are associated with this project.Since April, 2017 the government has been working with various stakeholders to uplift the Adventure Tourism services in Sri Lanka by formulating new policies. As a result, they have come up with a new vision to uplift those services and ensure safety of those activities with an action plan that has already been given to the public. The project will be implemented as a major development strategy to uplift the national economy. All the information and activities related to the project have been published by the Policy Development Office on their official Facebook page:www.facebook.com/policydevelopmentoffice.While Sri Lanka Tourism Development Authority (SLTDA) plays the leading role to the entire process, adventure tourism activities related to water, air and land are governed under the supervision of Sri Lankan Navy, Air Force and Army respectively. Sri Lanka Telecommunication Regulatory Commission is responsible for immediate action regarding communication and rescue processes and Sri Lanka Standard Institution certifies the standards of adventure activities. Government, non-government and voluntary institutions are associated with this project.", 
  "title": "Government to promote Safe Adventure Tourism", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1506-government-to-promote-safe-adventure-tourism"
}