{
  "date": "August 15, 2017", 
  "text": "The Export-Import Bank of Korea (Korea Eximbank) in collaboration with the Asian Development Bank (ADB) held a dissemination seminar on the Colombo-Trincomalee Economic Corridor (CTEC) with the aim of sharing the final policy consultation paper with Sri Lankan government officials from the Ministry of National Policies and Economic Affairs, Ministry of Industry and Commerce, Ministry of Development Strategies and International Trade and Sri Lanka Customs and other relevant ministries and organizations.ADB-KSP joint consulting program was launched in April this year to support the Sri Lankan Government in drawing a blueprint for CTEC.Even though Sri Lanka is just below the threshold of upper-middle income country status, there are challenges that it needs to overcome. Low foreign direct investment (FDI) inflow compared with those in other countries like Viet Nam and Myanmar, a non-vibrant SME sector, an inadequate custom system and risks arising from unplanned urbanization are some of the challenges. These factors contributed to a decline in the export to GDP ratio from 29% in 2000 to 12.5% in 2016.In this context, by providing hands-on experiences and knowledge that the Republic of Korea acquired from implementing similar economic corridor development projects from the 1970s to 2000s, this ADB-KSP joint consulting program will make practical contributions to the CTEC initiative which will boost an export-oriented economy and revitalize Sri Lanka. This joint consulting offers comprehensive policy recommendations tailored to the needs of Sri Lanka, especially focusing on four areas  FDI promotion, strengthening the competitiveness of SMEs, single window custom system and urbanization. Korea Eximbank may finance development projects related to these 4 areas and other economic infrastructures in Sri LankaThe Export-Import Bank of Korea (Korea Eximbank) in collaboration with the Asian Development Bank (ADB) held a dissemination seminar on the Colombo-Trincomalee Economic Corridor (CTEC) with the aim of sharing the final policy consultation paper with Sri Lankan government officials from the Ministry of National Policies and Economic Affairs, Ministry of Industry and Commerce, Ministry of Development Strategies and International Trade and Sri Lanka Customs and other relevant ministries and organizations.ADB-KSP joint consulting program was launched in April this year to support the Sri Lankan Government in drawing a blueprint for CTEC.Even though Sri Lanka is just below the threshold of upper-middle income country status, there are challenges that it needs to overcome. Low foreign direct investment (FDI) inflow compared with those in other countries like Viet Nam and Myanmar, a non-vibrant SME sector, an inadequate custom system and risks arising from unplanned urbanization are some of the challenges. These factors contributed to a decline in the export to GDP ratio from 29% in 2000 to 12.5% in 2016.In this context, by providing hands-on experiences and knowledge that the Republic of Korea acquired from implementing similar economic corridor development projects from the 1970s to 2000s, this ADB-KSP joint consulting program will make practical contributions to the CTEC initiative which will boost an export-oriented economy and revitalize Sri Lanka. This joint consulting offers comprehensive policy recommendations tailored to the needs of Sri Lanka, especially focusing on four areas  FDI promotion, strengthening the competitiveness of SMEs, single window custom system and urbanization. Korea Eximbank may finance development projects related to these 4 areas and other economic infrastructures in Sri Lanka", 
  "title": "ADB-KSP joint consultants held dissemination seminar for CTEC", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1522-adb-ksp-joint-consultants-held-dissemination-seminar-for-ctec"
}