{
  "date": "2017-08-18", 
  "text": "The President further said that all who act against this task of the government, which aimed at building peace and harmony amongthe all communities in the country and to prevent the recurrence of a war, may have repented regretfully in a cruel war in the future. He made these remarks participating in a ceremony to vest the newly built three-storey building at the Al Azhar Central College, Thihariya, with the students, today (17).The President pointed out that even though some criticized and ridiculed the initiatives taken by the government to build the national reconciliation, a lasting peace could be achieved only through successful implementation of the national reconciliation process.The three storey building was constructed with the financial donation of Most Venerable Dr. Pannila Sri Ananda Thero and the President after unveiling the plaque vest the new building with the students.The President paid his notice on the school building which hasnt been built after laying of its foundation stone in 2013. He directed the officials not to lay foundation stones to any school building or development project if there are no allocated funds for them.He directed the Provincial Education Minister to complete the construction of that building as soon as possible. He also directed the officials to allocate Rs. 20 million to build a new technical laboratory on the request of the students of the school.The President offered a souvenir to Ven. Pannila Sri Ananda Nayaka Thero. He has presented a souvenir with honor of the Muslim people in Thihariya, Attanagalla.Anu Nayaka of Malwathu Vihara Chapter, Kandy Rajakiya Panditha Most Ven. Dimbulkumbure Vimaladhamma Thero, Kelaniya Vidyalankara Parivenadhipathi Ven. Dr. Velamitiyave Kusaladhamma Thero, Former President Chandrika Bandaranaike Kumaratunga, State Minister A. H. M. Fawzie, Deputy Minister Lasantha Alagiyawanna, MP Harshana Rajakaruna, Provincial Education Minister Ranjith Somawansa and the principal of the school M. A. M. Azmeer were among those participated in this event.President Maithripala Sirisena says the patronage that should be given for the governments task of building national reconciliation in the country, is to provide the full support of all while understanding the process, but not to throw brickbats.The President further said that all who act against this task of the government, which aimed at building peace and harmony amongthe all communities in the country and to prevent the recurrence of a war, may have repented regretfully in a cruel war in the future. He made these remarks participating in a ceremony to vest the newly built three-storey building at the Al Azhar Central College, Thihariya, with the students, today (17).The President pointed out that even though some criticized and ridiculed the initiatives taken by the government to build the national reconciliation, a lasting peace could be achieved only through successful implementation of the national reconciliation process.The three storey building was constructed with the financial donation of Most Venerable Dr. Pannila Sri Ananda Thero and the President after unveiling the plaque vest the new building with the students.The President paid his notice on the school building which hasnt been built after laying of its foundation stone in 2013. He directed the officials not to lay foundation stones to any school building or development project if there are no allocated funds for them.He directed the Provincial Education Minister to complete the construction of that building as soon as possible. He also directed the officials to allocate Rs. 20 million to build a new technical laboratory on the request of the students of the school.The President offered a souvenir to Ven. Pannila Sri Ananda Nayaka Thero. He has presented a souvenir with honor of the Muslim people in Thihariya, Attanagalla.Anu Nayaka of Malwathu Vihara Chapter, Kandy Rajakiya Panditha Most Ven. Dimbulkumbure Vimaladhamma Thero, Kelaniya Vidyalankara Parivenadhipathi Ven. Dr. Velamitiyave Kusaladhamma Thero, Former President Chandrika Bandaranaike Kumaratunga, State Minister A. H. M. Fawzie, Deputy Minister Lasantha Alagiyawanna, MP Harshana Rajakaruna, Provincial Education Minister Ranjith Somawansa and the principal of the school M. A. M. Azmeer were among those participated in this event.", 
  "title": "National reconciliation process needs support of all ,but not brickbats- President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1538-national-reconciliation-process-needs-support-of-all-but-not-brickbats-president"
}