{
  "date": "2017-08-21", 
  "text": "He was addressing a ceremony held in Akuressa on 18th Friday.He said the accelerated Mahaweli Development Program was completed in 10 years and likewise the government will do a massive development project aimed at the South. The government will allocate 2,000 acres from Benthara to Pitabaddara to establish tourism zones. The first tourism zone will be established centering Dedduwa by the end of this year. The government will establish another Economic zone in Weligama and this is the start of that development said the PM.The Unity government will do greater change than the Mahaweli Development program, he added.He said the government will start programs to provide a better economy, income to the future generations. It took two years to mend the broken economy and now we are on the path to development. We turned losses into profits and will not burden the people. The government will not ruin the future of the youth the Premier said.The south is the best place to promote tourism as it is situated between the Bandaranaike International Airport and Mattala Airport. In addition, a large number of factories will be built-in Moneragala, Matara which will see the benefits trickling down to Akuressa as well as to all other villages, Prime Minister Ranil Wickremesinghe said. He was addressing a ceremony held in Akuressa on 18th Friday.He said the accelerated Mahaweli Development Program was completed in 10 years and likewise the government will do a massive development project aimed at the South. The government will allocate 2,000 acres from Benthara to Pitabaddara to establish tourism zones. The first tourism zone will be established centering Dedduwa by the end of this year. The government will establish another Economic zone in Weligama and this is the start of that development said the PM.The Unity government will do greater change than the Mahaweli Development program, he added.He said the government will start programs to provide a better economy, income to the future generations. It took two years to mend the broken economy and now we are on the path to development. We turned losses into profits and will not burden the people. The government will not ruin the future of the youth the Premier said.", 
  "title": "South is the best for tourism  PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1546-south-is-the-best-for-tourism-pm"
}