{
  "date": "August 21, 2017", 
  "text": "He was speaking at the ceremony to hand over land deeds to the farmers in Victoria and Kothmale Zones, under the national program to hand over 100,000 land deeds to Mahaweli colonists. The ceremony was held on 18th August at Digana Central Province Playground.President Sirisena pointed out that the people are dissatisfied with the governments activities inland sector. Taking it as a bad example, all officers should be committed to providing the service to the public today as well as tomorrow by correcting those wrong activities, he emphasized.The President stated that the right to a land is an issue not only for one life but for a generation. Ensuring of that right is a great responsibility which should be fulfilled for the citizens in this country, he said.When the government is carrying out its work various allegations arise. It is an aspect of a democratic country. If there is no freedom and democracy in the country such allegations and protests will not be there, the President stated.It is the responsibility of all to enjoy the ensured democratic rights while with an understanding of those rights, which were restored after concluding an era where people were afraid to demand their rights as well as politicians feared to present their political ideologies.The land deeds were distributed on the advice of President Maithripala Sirisena providing a solution for a long-standing problem faced by the Mahaweli residents. The program has been conducted successfully over the past years and at present, 85 percent of the project is concluded and the government is expected to complete the remaining work speedily.During this ceremony, 1,300 title deeds were handed over to the farmers and the President making this distribution of title deeds symbolically handed over 100 title deeds.If any section of the government is insulted by the people for any mistakes, the heads of those sections should take the responsibility for that, said President Maithripala Sirisena adding that the government would protect all officers who work according to their conscientiousness and with dedication. He was speaking at the ceremony to hand over land deeds to the farmers in Victoria and Kothmale Zones, under the national program to hand over 100,000 land deeds to Mahaweli colonists. The ceremony was held on 18th August at Digana Central Province Playground.President Sirisena pointed out that the people are dissatisfied with the governments activities inland sector. Taking it as a bad example, all officers should be committed to providing the service to the public today as well as tomorrow by correcting those wrong activities, he emphasized.The President stated that the right to a land is an issue not only for one life but for a generation. Ensuring of that right is a great responsibility which should be fulfilled for the citizens in this country, he said.When the government is carrying out its work various allegations arise. It is an aspect of a democratic country. If there is no freedom and democracy in the country such allegations and protests will not be there, the President stated.It is the responsibility of all to enjoy the ensured democratic rights while with an understanding of those rights, which were restored after concluding an era where people were afraid to demand their rights as well as politicians feared to present their political ideologies.The land deeds were distributed on the advice of President Maithripala Sirisena providing a solution for a long-standing problem faced by the Mahaweli residents. The program has been conducted successfully over the past years and at present, 85 percent of the project is concluded and the government is expected to complete the remaining work speedily.During this ceremony, 1,300 title deeds were handed over to the farmers and the President making this distribution of title deeds symbolically handed over 100 title deeds.", 
  "title": "Government servants should fulfill their responsibility President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1547-government-servants-should-fulfill-their-responsibility-president"
}