{
  "date": "August 21, 2017", 
  "text": "PM said that from Point Pedro to Dondra Point there are issues about unemployed graduates. Therefore, the Ministry of National Policy and Economic Affairs already has called for applications to recruit 20,000 as Development Assistants, he added.The Governments aim is to develop the country as the economic center of Indian Ocean. To achieve this task, the government has started to develop the ports. Already we have given a contract to Subana Jurong City Development, a company owned by the Singaporean government to prepare the plans to develop the Trincomalee Port.The government is demarcating land for naval purposes, jetties, tourism, factories as well as for housing development.By developing Trincomalee as well as tourism in the East we can create many employment opportunities. The government will develop internal airports targeting the increase in tourism and already the Batticaloa Airport has been developed while there are many more development plans in the pipeline, said the PM.The government will recruit 1, 700 graduate teachers to solve the teacher shortage in the East, said Prime Minister Ranil Wickremesinghe addressing a gathering at the Eravur Municipal Council yesterday (20th Aug). PM said that from Point Pedro to Dondra Point there are issues about unemployed graduates. Therefore, the Ministry of National Policy and Economic Affairs already has called for applications to recruit 20,000 as Development Assistants, he added.The Governments aim is to develop the country as the economic center of Indian Ocean. To achieve this task, the government has started to develop the ports. Already we have given a contract to Subana Jurong City Development, a company owned by the Singaporean government to prepare the plans to develop the Trincomalee Port.The government is demarcating land for naval purposes, jetties, tourism, factories as well as for housing development.By developing Trincomalee as well as tourism in the East we can create many employment opportunities. The government will develop internal airports targeting the increase in tourism and already the Batticaloa Airport has been developed while there are many more development plans in the pipeline, said the PM.", 
  "title": "Graduates to get more jobs under unity government", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1548-graduates-to-get-more-jobs-under-unity-government"
}