{
  "date": "September 02, 2016", 
  "text": "Mrs.Soon-taek, State Minister Niroshan Perera, Governor, South Province Hemakumara Nanayakkara, Southern Province Chief Minister Shan Wijayalal De Silva, Minister Gayantha Karunathilake, and Minister Chandima Weerakkodi also participated.United Nations Secretary General Ban Ki Moon at a meeting with the local youth community emphasized the Role of Youth as peace builders, and the leaders of the world. He made these comments yesterday in Southern Sri Lanka. He said, Young people, we often say youre the leaders of tomorrow. That may be true. But, there are many young people, who have already become leaders of today.According to him working with youth around the world is a top priority of UN.The UN Chief made these remarks attending a youth event titled Reconciliation and Coexistence: Role of Youth, at Hall De Galle in Galle organized by the National Youth Services Council(NYSC), the Ministry of National Policies and Economic Affairs,Office for National Unity and Reconciliation, and United Nations Sri Lanka.The event was joined by 100 young Sri Lankans from across the country, who are actively engaged in Projects and Programs relating to peace, unity, reconciliation and coexistence. Young participants displayed their work and ideas through eight thematic areas: Art and Culture, Education, Language and Identity, Inter-faith, Media and Communications, women and gender, sports, and Livelihoods and psychological support. At the end of his remarks, the Secretary General was also engaged in a Q and A session with participants, and signed the peace pledge.Mrs.Soon-taek, State Minister Niroshan Perera, Governor, South Province Hemakumara Nanayakkara, Southern Province Chief Minister Shan Wijayalal De Silva, Minister Gayantha Karunathilake, and Minister Chandima Weerakkodi also participated.", 
  "title": "UN Chief emphasizethe Role of Youth in Peace building", 
  "url": "https://www.dgi.gov.lk/news/latest-news/156-un-chief-emphasizethe-role-of-youth-in-peace-building"
}