{
  "date": "August 28, 2017", 
  "text": "He visited the exposition, where the latest technical aspects ofdefence and military technical related industries were showcasing their products. Later the Secretary witnessed a demonstration at the Alabino demonstration range.During the sidelines of the expo Secretary Waidyaratne sat with the Russian Deputy Minister of Defence Alexander Fomin for a formal discussion. A number of high ranking defence officials were also present at the discussion. The Secretary also had talks with top officials of the Federal Services of Military and Technical Cooperation, Russian Federation and JSC- Rosoboron export. The Secretary also visited the Museum of the Great Patriotic War in Moscow.The 'Army-2017 Expo' was organized by the Russian Defence Ministry and is one of its major annual events.Secretary to the Ministry of Defence Kapila Waidyaratne PC attended the opening ceremony of 'Army-2017 Expo' in Russia Recently. The International Military - Technical Forum was held from 22nd to 27th August at the Patriot Expo center in Moscow, Russia. He visited the exposition, where the latest technical aspects ofdefence and military technical related industries were showcasing their products. Later the Secretary witnessed a demonstration at the Alabino demonstration range.During the sidelines of the expo Secretary Waidyaratne sat with the Russian Deputy Minister of Defence Alexander Fomin for a formal discussion. A number of high ranking defence officials were also present at the discussion. The Secretary also had talks with top officials of the Federal Services of Military and Technical Cooperation, Russian Federation and JSC- Rosoboron export. The Secretary also visited the Museum of the Great Patriotic War in Moscow.The 'Army-2017 Expo' was organized by the Russian Defence Ministry and is one of its major annual events.", 
  "title": "Secretary attends 'Army 2017' in Russia", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1565-secretary-attends-army-2017-in-russia"
}