{
  "date": "2017-08-28", 
  "text": "During thevisit the State Minister paid a courtesy call on President General Michel Aoun, and had discussions with Prime Minister Saad Hariri, Minister of Foreign Affairs and Expatriates Gebran Bassil, Speaker Nabih Berri, and General Director Major General Abbas Ibrahim of the General Security of Lebanon. He also met the Parliamentarians of the Sri Lanka-Lebanese Parliamentary Friendship Group, and addressed the Business Forum arranged by the Chamber of Commerce of Zahle and Bekka of Lebanon. Discussions during the visit included expanding and consolidating existing bilateral relations in the political, economic, trade, tourism, education, and socio-cultural fields and Sri Lankan migrant workers.Sri Lanka's trade with Lebanon has increased from USD 6.9 million in 2004 to USD 30.89 million in 2016.During the discussions, State Minister Senanayake highlighted Sri Lanka's interest to further enhance Sri Lanka's tea exports to Lebanon which currently accounts for 79.55% of total tea imports of Lebanon, and invited Lebanese investors to explore investing in Sri Lanka.The State Minister extended invitations to the President, the Prime Minister, the Minister of Foreign Affairs and Expatriates Minister and the Speaker to visit Sri Lanka.During the high-level engagements, the State Minister briefed Lebanese authorities on developments in Sri Lanka since the establishment of the National Unity Government following the Presidential and the Parliamentary elections in 2015, and elaborated on the processes for reconciliation, strengthening democracy, and equitable and inclusive economic development to ensure Sri Lankas future as a stable, peaceful, reconciled and prosperous nation.He expressed appreciation to the Government of Lebanon for hosting nearly 80,000 Sri Lankan migrant workers, and ensuring their welfare and special appreciation was expressed for waiving a reducing the overstay penalties imposed on Sri Lankan migrant workers. State Minister Senanayake requested Lebanese Government to consider granting a waiver on overstay fee for 5,000 Sri Lankan undocumented workers and the early repatriation of Sri Lankans who leave on voluntary basis. He expressed interest in sending more skilled labourers to Lebanon in the future. The Lebanese Government agreed to consider the State Minister's requests favourably.The Lebanese Government was invited to open a Resident Mission in Colombo which will help further enhance and expand bilateral relations including people to people ties. Re-establishment of air links between the two countries, early conclusion of a bilateral Agreement on Visa Exemption on Diplomatic and Official Passport holders, Agreements on Political Consultations, and Judicial Cooperation, a Memorandum of Understanding (MoU) in the field of Manpower and a MoU between the Beirut Chamber of Commerce and the Ceylon Chamber of Commerce were also discussed. Support for the each other in International fora, and the exchange of high level delegations including trade Missions were also discussed.During the Business Forum, the State Minister invited the Lebanese business community to undertake a fact finding mission during the SAARC investment Forum and Trade Fair 2017 which is to be held in Colombo from 6th-9th September.Sri Lankas Ambassador to Lebanon H.M.G.R.R.K. Wijeratne Mendis and Actg. Director General C.A. Chaminda I. Colonne of the Ministry of Foreign Affairs were associated with the State Minister at his meetings with the Lebanese authorities.State Minister of Foreign Affairs Vasantha Senanayake concluded an official visit to Lebanon from 16th -19th August. During thevisit the State Minister paid a courtesy call on President General Michel Aoun, and had discussions with Prime Minister Saad Hariri, Minister of Foreign Affairs and Expatriates Gebran Bassil, Speaker Nabih Berri, and General Director Major General Abbas Ibrahim of the General Security of Lebanon. He also met the Parliamentarians of the Sri Lanka-Lebanese Parliamentary Friendship Group, and addressed the Business Forum arranged by the Chamber of Commerce of Zahle and Bekka of Lebanon. Discussions during the visit included expanding and consolidating existing bilateral relations in the political, economic, trade, tourism, education, and socio-cultural fields and Sri Lankan migrant workers.Sri Lanka's trade with Lebanon has increased from USD 6.9 million in 2004 to USD 30.89 million in 2016.During the discussions, State Minister Senanayake highlighted Sri Lanka's interest to further enhance Sri Lanka's tea exports to Lebanon which currently accounts for 79.55% of total tea imports of Lebanon, and invited Lebanese investors to explore investing in Sri Lanka.The State Minister extended invitations to the President, the Prime Minister, the Minister of Foreign Affairs and Expatriates Minister and the Speaker to visit Sri Lanka.During the high-level engagements, the State Minister briefed Lebanese authorities on developments in Sri Lanka since the establishment of the National Unity Government following the Presidential and the Parliamentary elections in 2015, and elaborated on the processes for reconciliation, strengthening democracy, and equitable and inclusive economic development to ensure Sri Lankas future as a stable, peaceful, reconciled and prosperous nation.He expressed appreciation to the Government of Lebanon for hosting nearly 80,000 Sri Lankan migrant workers, and ensuring their welfare and special appreciation was expressed for waiving a reducing the overstay penalties imposed on Sri Lankan migrant workers. State Minister Senanayake requested Lebanese Government to consider granting a waiver on overstay fee for 5,000 Sri Lankan undocumented workers and the early repatriation of Sri Lankans who leave on voluntary basis. He expressed interest in sending more skilled labourers to Lebanon in the future. The Lebanese Government agreed to consider the State Minister's requests favourably.The Lebanese Government was invited to open a Resident Mission in Colombo which will help further enhance and expand bilateral relations including people to people ties. Re-establishment of air links between the two countries, early conclusion of a bilateral Agreement on Visa Exemption on Diplomatic and Official Passport holders, Agreements on Political Consultations, and Judicial Cooperation, a Memorandum of Understanding (MoU) in the field of Manpower and a MoU between the Beirut Chamber of Commerce and the Ceylon Chamber of Commerce were also discussed. Support for the each other in International fora, and the exchange of high level delegations including trade Missions were also discussed.During the Business Forum, the State Minister invited the Lebanese business community to undertake a fact finding mission during the SAARC investment Forum and Trade Fair 2017 which is to be held in Colombo from 6th-9th September.Sri Lankas Ambassador to Lebanon H.M.G.R.R.K. Wijeratne Mendis and Actg. Director General C.A. Chaminda I. Colonne of the Ministry of Foreign Affairs were associated with the State Minister at his meetings with the Lebanese authorities.", 
  "title": "State Ministers official visit to Lebanon concludes", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1566-state-minister-s-official-visit-to-lebanon-concludes"
}