{
  "date": "August 29, 2017", 
  "text": "Prof. Halsted addressing media at the Department of Government Information yesterday said that he is happy about Sri Lanka's interest on the vaccine and added that the intention to think about it scientifically and take a decision is commendable. The Professor further added that Dengue has spread in about 120 countries and controlling it is a challenge. There are many experiments about a vaccine for Dengue but nothing is final.He further added that prior to giving the vaccine, assessments should be done to ensure that there is no harm to life and commended the interest of Sri Lankan Doctors on the vaccine.National Drug Regulatory Authority Chairman Dr. Asitha De Silva said that they will come to a correct conclusion after checking it scientifically. Until then the vaccine will not be registered. Dr De Silva further added prior to obtaining the vaccine from Singapore they would get the doctors advice.Prof Scott B. Halsted, an internationally known professor on Dengue had discussions with Minister of Health, Nutrition and Indigenous Medicine Dr. Rajitha Senaratna about the possibility of providing a vaccine for Dengue, yesterday (28th Aug.) at the Health Ministry. It is manufactured in countries such as France, Thailand and Japan. Prof. Halsted addressing media at the Department of Government Information yesterday said that he is happy about Sri Lanka's interest on the vaccine and added that the intention to think about it scientifically and take a decision is commendable. The Professor further added that Dengue has spread in about 120 countries and controlling it is a challenge. There are many experiments about a vaccine for Dengue but nothing is final.He further added that prior to giving the vaccine, assessments should be done to ensure that there is no harm to life and commended the interest of Sri Lankan Doctors on the vaccine.National Drug Regulatory Authority Chairman Dr. Asitha De Silva said that they will come to a correct conclusion after checking it scientifically. Until then the vaccine will not be registered. Dr De Silva further added prior to obtaining the vaccine from Singapore they would get the doctors advice.", 
  "title": "Dengue vaccine in the offing", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1569-dengue-vaccine-in-the-offing"
}