{
  "date": "August 30, 2017", 
  "text": "He made these comments participating at the launch of the report Health Sector Cost of National Nutrition Programme of Sri Lanka at the BMICH.He said that to enjoy a healthy life healthy, nutritious foods are essential. The public should be made aware of eating nutritious food as well as buying food which is value for money. The minister said that the government has allocated a large sum of money for the health and Nutrition. Rs. 100 million from 2016 budgetary allocations for the Health Ministry has been allocated for the promotion of health and nutrition. In addition, UNICEF and other Non-governmental Organizations also spend a lot of money to increase the nutrition of Sri Lankans.He further added that the ministry has launched a program to eliminate the bad habits of people which includes steps to minimize smoking as well as a color code for soft drinks.The government has allocated Rs 28.2 billion for the National Nutrition Program for the next five years, said Minister of Health, Nutrition and Indigenous Medicine Dr. Rajitha Senaratna. He made these comments participating at the launch of the report Health Sector Cost of National Nutrition Programme of Sri Lanka at the BMICH.He said that to enjoy a healthy life healthy, nutritious foods are essential. The public should be made aware of eating nutritious food as well as buying food which is value for money. The minister said that the government has allocated a large sum of money for the health and Nutrition. Rs. 100 million from 2016 budgetary allocations for the Health Ministry has been allocated for the promotion of health and nutrition. In addition, UNICEF and other Non-governmental Organizations also spend a lot of money to increase the nutrition of Sri Lankans.He further added that the ministry has launched a program to eliminate the bad habits of people which includes steps to minimize smoking as well as a color code for soft drinks.", 
  "title": "Rs 28 billion for National Nutrition Program", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1577-rs-28-billion-for-national-nutrition-program"
}