{
  "date": "September 02, 2017", 
  "text": "Millions of Islam devotees of the world are gathered into a single area, with the same devoutness for the Hajj, which demonstrates the unity of the humankind. This religious festival disseminates a message about the importance of the social co-existence to the global community.The Hajj pilgrimage is a great religious ritual in which all devotees from different parts of the world, irrespective of their personal identities worship the God in a single line, in a similar manner.The message given by the Hajj is to socialize the mutual bonds in a world where only divisions are seen and discipline to respect the leadership and it portraits a society with excellent social justice and co-existence.I wish all Islam devotees who perform Hajj rituals by respecting the meaning in the noble message conveyed to the world through the holy Mecca where the co-existence among humans come alive, and the entire Muslim community in the world a noble Eid-Ul Alha festival!The vast gathering of people for performance of common religious activities is as old as the human history itself. Today, after the lapse of many eras, the followers of different religions join in large numbers to perform religious rituals with utmost devotion and piety. Millions of Islam devotees of the world are gathered into a single area, with the same devoutness for the Hajj, which demonstrates the unity of the humankind. This religious festival disseminates a message about the importance of the social co-existence to the global community.The Hajj pilgrimage is a great religious ritual in which all devotees from different parts of the world, irrespective of their personal identities worship the God in a single line, in a similar manner.The message given by the Hajj is to socialize the mutual bonds in a world where only divisions are seen and discipline to respect the leadership and it portraits a society with excellent social justice and co-existence.I wish all Islam devotees who perform Hajj rituals by respecting the meaning in the noble message conveyed to the world through the holy Mecca where the co-existence among humans come alive, and the entire Muslim community in the world a noble Eid-Ul Alha festival!", 
  "title": "Presidents message for Haj", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1589-president-s-message-for-haj"
}