{
  "date": "2017-09-07", 
  "text": "The President was speaking at the inauguration ceremony of the program Kalana Mithuru Poth Sumithuru, implemented to increase the interest for reading among students. The ceremony was held yesterday (6th Sept.) at the Presidents House, Colombo.The program was organized by the Development and Special Projects Unit of the Presidential Secretariat, in line with the national reading month. The objective of the project is to build balanced children and nurture them with knowledge.Under the first phase of this project, 2,820 schools with Advanced Level classes island-wide will be facilitated. Accordingly, bundle of books written in Sinhala, Tamil and English medium was distributed among those schools. A program is being implemented in parallel to this, to promote children's interest in reading by holding competitions island-wide.The President further said that at present the interest in reading have been diminished among the children as well as adults. The President pointed out that the modern technology and the influence of Facebook and the social media have caused this decline. He also said that all must commit to build a society which is well-disciplined and have a high sense of literature.President Maithripala Sirisena says reading makes man knowledgeable and disciplined. The President was speaking at the inauguration ceremony of the program Kalana Mithuru Poth Sumithuru, implemented to increase the interest for reading among students. The ceremony was held yesterday (6th Sept.) at the Presidents House, Colombo.The program was organized by the Development and Special Projects Unit of the Presidential Secretariat, in line with the national reading month. The objective of the project is to build balanced children and nurture them with knowledge.Under the first phase of this project, 2,820 schools with Advanced Level classes island-wide will be facilitated. Accordingly, bundle of books written in Sinhala, Tamil and English medium was distributed among those schools. A program is being implemented in parallel to this, to promote children's interest in reading by holding competitions island-wide.The President further said that at present the interest in reading have been diminished among the children as well as adults. The President pointed out that the modern technology and the influence of Facebook and the social media have caused this decline. He also said that all must commit to build a society which is well-disciplined and have a high sense of literature.", 
  "title": "Reading makes man knowledgeable and disciplined  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1608-reading-makes-man-knowledgeable-and-disciplined-president"
}