{
  "date": "September 11, 2017", 
  "text": "Foreign Minister Marapana conveyed the greetings of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe to Prime Minister Modi.Minister Marapana referred to the cordial relations that exist between the two countries as manifested by frequenthigh level visits fortifying close bilateral bonds. Minister Marapana reaffirmed his commitment for taking bilateral relations to greater heights.Prime Minister Modi while welcoming the Foreign Minister Marapana stated that coming to India on his first overseas visit is a reflection of close partnership between the two countries. It was re-emphasised that as close neighbours, and more importantly, as the best of friends, India and Sri Lanka could continue to remain engaged and work together for the benefit of the two countries and the region. Prime Minister Modi renewed his assurances that India will stand by Sri Lankas forward march towards progress and prosperity.Minister Marapana also held talks with the External Affairs Minister Sushma Swaraj and National Security Advisor Ajit Doval.Foreign Minister Tilak Marapana during his official visit to New Delhi from 8th  10th September called on Prime Minister Narendra Modi. Foreign Minister Marapana conveyed the greetings of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe to Prime Minister Modi.Minister Marapana referred to the cordial relations that exist between the two countries as manifested by frequenthigh level visits fortifying close bilateral bonds. Minister Marapana reaffirmed his commitment for taking bilateral relations to greater heights.Prime Minister Modi while welcoming the Foreign Minister Marapana stated that coming to India on his first overseas visit is a reflection of close partnership between the two countries. It was re-emphasised that as close neighbours, and more importantly, as the best of friends, India and Sri Lanka could continue to remain engaged and work together for the benefit of the two countries and the region. Prime Minister Modi renewed his assurances that India will stand by Sri Lankas forward march towards progress and prosperity.Minister Marapana also held talks with the External Affairs Minister Sushma Swaraj and National Security Advisor Ajit Doval.", 
  "title": "Foreign Minister meets Indian PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1621-foreign-minister-meets-indian-pm"
}