{
  "date": "2017-10-09", 
  "text": "The Appropriation Bill approved by the Cabinet of Ministers which is to be tabled in Parliament today records an allocation of Rs.260,711,375,000 as recurrent expenditure for the Ministry of Defence and a capital expenditure of Rs. 30 billion.The Finance Ministry estimates a total expenditure of Rs. 3,982 billion for 2018. The amount includes Rs.1, 308 billion for recurrent expenditure and Rs. 668 billion for capital expenditure. The Government estimates a revenue of Rs. 2,175 billion from foreign grants while another Rs.1, 813 billion IS to be financed through loans obtained from both foreign and domestic sources.The second highest allocation is to the Ministry of Finance and Mass Media. The Recurrent Expenditure is Rs 196,517,853,000 and Capital Expenditure Rs 37,054,235,000. Other higher allocations include:The Ministry of Health, Nutrition and Indigenous Medicine: Recurrent Expenditure is Rs 134,399,998,000 and Capital Expenditure is Rs. 44 billion.The Ministry of Transport and Civil Aviation: Recurrent Expenditure is Rs 118,176,198,000 and Capital Expenditure is Rs 14,867,350,000.The Ministry of Foreign Affairs: Recurrent Expenditure is Rs 9,956,950,000 and Capital Expenditure is Rs 14,867,350,000.The Ministry of Higher Education: Recurrent Expenditure is Rs 32,757,000,000 and Capital Expenditure is Rs 150 billion.The Appropriation Bill will be presented for the first reading today by the State Minister for Finance Eran Wickramaratne. The Finance Minister MangalaSamaraweera will present the 2018 Budget during the second reading of the Appropriation Bill on November 9th. The second reading of the 2018 Budget will be held on November 10th, 11th, 13th, 14th and 15th while the Committee stage debate will be from November 16th with the vote on the third reading of budget fixed for December 9th.The Appropriation Bill proposes a total of Rs. 4.178 billion as recurrent expenditure for the Ministry of National Policies and Economic Affairs along with another Rs. 21.55 billion as capital expenditure. The total recurrent expenditure of the Ministry of Health, Nutrition and Indigenous Medicine for 2018 will be Rs. 134.399 billion while another Rs. 44 billion will allocated as capital expenditure.According to the Appropriation Bill, the Presidents office has been allocated Rs.487, 352,500 and the Prime Ministers office of Rs.177,268,000The Ministry of Finance in a statement announced that the government has a plan to introduce a budget which takes into consideration the hopes and aspirations of the general public. It is envisioned that the forthcoming budget would pave way for a better standing of living by creating a strong economy and plethora of opportunities for its people.", 
  "title": "Appropriation Bill to be tabled in Parliament today ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1632-appropriation-bill-to-be-tabled-in-parliament-today"
}