{
  "date": "2017-10-14", 
  "text": "Prime Minister Ranil Wickremesinghe yesterday ordered to speed up post-disaster relief activities and complete compensation payment to people affected by floods and landslides by November.The Prime Minister made this instruction chairing a progress review meeting in South, which was attended by the public officials in Galle, Matara, Ratnapura and Kalutara, the four districts worst affected by the torrential rains lashed in May and June.The Prime Minister, observing that the compensation payment has been unduly delayed despite the Government disbursing the necessary funds long time ago, pitched into the authorities asking as to why they failed to pass that money to the affected people immediately.Tell me an exact date you can finish the post-disaster relief work. Do not further delay them, the PM said while noting that the economy in the affected areas could have been restored by now had the affected entrepreneurs, businessmen and the tea industry received compensation swiftly.The PM pointed out that 1,361 applications were received to obtain compensation for damaged houses and shops in Matara totaling to Rs 356 million but not a single payment has been made by October 10.The National Insurance Trust Fund (NIFT) has to give reasons as to why such a delay occurred, he remarked.A sum of Rs 7.5 billion is to be paid as compensation for people affected. Rs 2 billion of that amount are for business entities. We had asked you to pay this money as soon as possible. The District Secretaries have informed that they approved and sent all the money needed. Then how did this delay happen? he questioned.The PM was highly critical of the lethargy of officials that he even said at one point that dropping down currency notes from air using helicopters for anybody in the ground to collect could have been a better option considering the inordinate delay shown by the authorities. He instructed the officials to use the disbursed money before the end of this year, reminding them that those allocations would not be available to be used next year.The Premier, commenting on the Athwela loan scheme, requested the State Banks to give loan facilities to those starting new business ventures.Ministers Vajira Abeywardena and Sagala Ratnayake participated in the meeting alongside the PM. (CDN)", 
  "title": "PM orders immediate relief for disaster victims ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1660-pm-orders-immediate-relief-for-disaster-victims-2"
}