{
  "date": "October 14, 2017", 
  "text": "Minister of Finance and Mass Media Mangala Samaraweera who is in Washington, on the sideline of the WB/IMF annual meeting, met Ms. Fatema Z. Sumar, the Regional Deputy Vice President for Europe, Asia, Pacific and Latin America in the Millennium Challenge Corporation (MCC) to review the progress of its 5- year Grant Compact to Sri Lanka.In December 2016, MCCs Board of Directors had selected Sri Lanka to develop a compact. Sri Lanka became eligible for assistance after passing 13 out of 20 indicators on MCCs policy scorecard.MCC is an independent agency working to reduce global poverty through economic growth. MCCs grants and assistance to Sri Lanka is an immense contribution on Sri Lankas efforts for good governance, fighting corruption and to protect and promote human rights.Sri Lanka is in the receiving country of approximately USD 700 million within a period of 5 years from the MCC to invest in three priority areas - Policy stability, access to land and transport.A delegation from the U.S. Governments Millennium Challenge Corporation (MCC) led by Fatema Z. Sumar, visited Colombo in July to advance progress on the development of the MCC compacta five-year grant programwith the Government of Sri Lanka that aims to reduce poverty and promote economic opportunity for Sri Lankans.During the visit following the signing of an MoU with the Secretary to Treasury Dr. R.H.S. Samaratunge, MCC announced LKR 1.1 billion (USD 7.4 million) in funding to Sri Lanka to support the development of a compact, including identifying and analyzing specific projects for potential investment.The Sri Lankan Government has established a project management unitthe Sri Lankan Compact Development Teamwithin the Prime Ministers office to work with MCC on the compact. The goal is to develop a high-quality, evidence-based and sustainable compact aimed at addressing these economic challenges in a way that drives growth and reduces poverty. MCC holds partner countries accountable through rigorous oversight, monitoring and evaluation.", 
  "title": "Sri Lanka reviews Grant Compacts progress with U.S. Millennium Challenge Corporation ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1661-sri-lanka-reviews-grant-compact-s-progress-with-u-s-millennium-challenge-corporation"
}