{
  "date": "October 18, 2017", 
  "text": "Cricketing legends Mahela Jayawardene and Kumar Sangakkara recently at the Ministry of Education spoke to more than 100 school children about the need to end violence against women and girls.The Minister of Education, Akila Viraj Kariyawasam, the European Union Ambassador, Tung-Lai Margue, and Gender Specialist, Mrs. Sriyani Perera, joined Mahela and Kumar on stage to speak out about the continuing high levels of violence directed against women and girls in everyday life.Minister Kariyawasam and Ambassador Margue introduced a video, featuring Mahela and Kumar, which will be circulated to schools in the country to increase awareness of the problem. The video was produced by the European Union (EU) Delegation to mark the International Day for the Elimination of Violence Against Women.Commenting on the initiative, Minister Kariyawasam said, \"The Government of Sri Lanka is strongly committed to the elimination of Violence Against Women, and has taken significant steps to combat its prevalence. However, it still requires consistent and concerted efforts to challenge and change attitudes and behaviours that normalize and reinforce violence against women. I'm really grateful that Mahela and Kumar have been willing to give their time to highlight that this sort of behaviour is completely unacceptable. I'd also like to express my thanks to the European Union, working in conjunction with the Family Rehabilitation Centre, for their support in raising awareness about this problem.\"\"We were delighted when Kumar and Mahela agreed to become our Envoys for Women's Rights. It's really important that Sri Lankan men hear from such role models about this serious and deep-rooted issue.\" said Ambassador Tung-Lai Margue. \"Studies have shown that more than half of the women in Sri Lanka have experienced some form of violence, but there is a dearth of open public discussion around the problem. Prevention of violence against women and girls starts with better educating and informing children in schools. We believe that having Kumar and Mahela speak about the issue will help make it easier to talk about the issue in public. The initiative is part of our long-term commitment to fight gender discrimination and to raise awareness of gender issues both in Sri Lanka and in the wider world\", the ambassador said.", 
  "title": "MoE and EU join to eliminate Violence Against Women", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1668-moe-and-eu-join-to-eliminate-violence-against-women"
}