{
  "date": "October 18, 2017", 
  "text": "Pesident Maithripala Sirisena emphasized the need for further expanding economic relations between Pakistan and Sri Lanka. He made this statement when Pakistans Foreign Secretary Ms. Tehmina Janjua called on him at the Presidential Secretariat yesterday (17th Oct.).He said Pakistan could invest in sugar and cement industries as there is a huge requirement of sugar and cement in Sri Lanka. He pointed out that currently Sri Lanka produces only 20 percent of the sugar requirement. Pakistan Foreign Secretary assured that Pakistan would continue to assist Sri Lanka. She said that Pakistan will assist to take the economic and trade relationship between the two countries to a stronger level. President Sirisena recalled the long-standing bilateral relations between Sri Lanka and Pakistan and emphasized the need to further consolidate the relationship. He expressed gratitude for assistance provided by Pakistan to Sri Lanka as a true friend and a brother, during the period of conflict in the country. He also expressed special thanks for the assistance given by Pakistan to Sri Lanka in the United Nations Human Rights Council. Ms Janjua said she attended the UNHRC Session in Geneva in September and she was glad that she could speak in support of Sri Lanka at the forum. She said that Pakistan would assist Sri Lankas livestock and milk production sectors and programs have been already formulated in consultation with Sri Lankan institutions. President Sirisena said that Sri Lanka would extend support to Pakistan to hold the next Summit of South Asian Association for Regional Cooperation (SAARC) and said it is important to strengthen SAARC to ensure regional cooperation. Foreign Secretary emphasized that Pakistan is ready to assist Sri Lankas development activities whenever required. She has arrived in Colombo to lead the Pakistan delegation to the 5th Round of Bilateral Political Consultations between Pakistan and Sri Lanka. The 4th round of talks was held in August 2014 in Islamabad. During her stay in Sri Lanka, the Foreign Secretary will also launch the Pakistan Alumni Society of Sri Lanka.The High Commissioner-Designate of Pakistan to Sri Lanka Dr. Shahid Ahmad Hashmat and the Secretary to the Ministry of Foreign Affairs Prasad Kariyawasam participated in this meeting.", 
  "title": "President urges Pakistan to invest in sugar and cement industries  P", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1669-president-urges-pakistan-to-invest-in-sugar-and-cement-industries-p"
}