{
  "date": "October 18, 2017", 
  "text": "The Consulate General of Sri Lanka in Guangzhou facilitated the participation of Sri Lankan SMEs in Trade Fairs in three different cities in Southern China, namely, Nanning (Guangxi province), Dongguan and Guangzhou to create awareness and boost trade for the wide range of products that are manufactured in Sri Lanka.While the Trade Fairs in Nanning and Guangzhou held in September and October were done with the active participation of the Sri Lanka Export Development Board, the Trade Fair in Dongguan was with the collaboration of the Federation of Chambers of Commerce of Sri Lanka (FCCISL). Some of the Trade Fairs had over 40 Sri Lankan companies participating, creating greater awareness of Sri Lankan products and contributing towards brand recognition. A Trade Forum under the theme of Opportunities for Trade with Sri Lanka was held on 12th September by the Consulate General and the Export Development Board alongside the 14th China- ASEAN Expo (CAEXPO) in Nanning providing essential information to both Chinese and foreign entrepreneurs from ASEAN countries on the excellent quality of Sri Lankan products that are exported worldwide. This is the second time that Sri Lanka has taken part in the China- ASEAN Trade Fair in Nanning. Following the Trade Fair in Nanning, the Consulate General organized Buyer-Seller meets for the Sri Lankan exhibitors at the CISMEF Trade Fair in Guangzhou held from 10th to 13th October. The Sri Lanka Pavilion which housed 35 companies from various sectors attracted a constant stream of visitors. The CISMEF Trade Fair is an annual event held every autumn in Guangzhou exclusively for Small and Medium enterprises (SMEs). This years Fair had the participation of over 3000 SMEs from China with 31 countries taking part in it.", 
  "title": "Participation of Sri Lankan SMEs at Trade Fairs in Southern China", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1670-participation-of-sri-lankan-sme-s-at-trade-fairs-in-southern-china"
}