{
  "date": "October 27, 2017", 
  "text": "An Edith Cowan University (ECU) team of scientists will arrive in Sri Lanka on 2nd of November to apply Sports Science in Sri Lanka.This six member team of Scientists from the ECU works with Australias best athletes and is ranked 14th out of 10,000 universities in the world in the area of Sport Science and is coordinated by Associate Prof (Adjunct) Hallam Pereira.This project of applying sports science aims to optimise the performance of athletes representing Sri Lanka at major international sporting events to achieve international success and using sports science. The Project also aims to improve the sporting industry of Sri Lanka, enhance its economy and integrate ethnic communities. Athletes and the wider community of Sri Lanka will greatly benefit from this as it will systematically augment athletes and the sports industry as a whole.Although athletes and cricketers in Sri Lanka are working tirelessly towards their achievements, accomplishing these goals can only result from a holistic training that includes sports science services. Such services are, unfortunately, not available to our talented sportspersons in Sri Lanka. This results in the failure to achieve the international success that we hope to reach.With this project, our sports persons and coaches will get the opportunity to obtain these services. This will undoubtedly result in a significant increase in global success rates, and bring about glory to Sri Lanka.In the long term, this will help to significantly improve the quality of life, health and wellbeing, social integration and harmony of all citizens. Therefore, it is not wrong to deem this project as a revolutionary turning point in the sports industry of Sri Lanka.Taking place in Colombo, the project will conduct tests on 240 athletes to identify strengths and weaknesses, advice coaches on training modification to accelerate the development of performance levels, conduct workshops on sports science, and upskill local officials to perform sports science tests and services on their own.This ground-breaking project has been given support and recognition by President Maithripala Sirisena, Foreign Minister Thilak Marapana, the National Olympic Committee, the Sri Lankan High Commissioner Somasundaram Skandakumar, and the Consul of Sri Lanka in Western Australia Rosh Jalagge.", 
  "title": "Project of Application of Sports Science in Sri Lanka to be launched", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1681-project-of-application-of-sports-science-in-sri-lanka-to-be-launched"
}