{
  "date": "October 29, 2017", 
  "text": "As a part of Prime Minister Ranil Wickremesinghes concept of uplifting the Small and Medium Enterprises (SMEs), a special project has been initiated with the objective of improving quality of the beauty culture sector, Hairdressers and Beauticians around the country, the Policy Development Office said.The project named as SED Salon is being implemented through the Small Enterprises Development Division of the Ministry of National Policies and Economic Affairs. This Small Enterprises Development Division was formed in 1980s by the present Prime Minister while he was Minister of Youth Affairs and Employment with the objective of uplifting the SMEs with assistance of the International Labor Organization. The project is included programs to promote customer attitudes, customer care, marketing and management skills etc. The main objective of this is to transform the beauty culture sector into a field of providing quality services to all.A total of 4,328 applications have already been received for this program. The Sri Lanka Standard Institute has launched a series of awareness campaign in July in order to maintain the standards of salons, and has already been implemented in all districts, with a large number of participants from Kalutara, Kegalle, Gampaha and Kurunegala districts.Furthermore, action is being taken to provide an internationally recognized National Training Certificate (NVQ) for Beauticians and Hairdressers to provide an international recognition to their profession. The information and registration details of the project can be obtained from the Small Enterprises Development Division at each District Secretariat.As another step of the project, it is expected to introduce a code of ethics for the beauty culture sector and to award the Merit Award for skillful beauticians annually. The first award program will be held in November 2017.", 
  "title": "Special project to improve quality of beauty culture sector", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1690-special-project-to-improve-quality-of-beauty-culture-sector"
}