{
  "date": "October 31, 2017", 
  "text": "The government will take three important steps on constitutional reforms and to prevent incorrect information which creates incorrect ideas about the proposed new constitution, says President Maithripala Sirisena.Accordingly, the government will call for an all party conference, with participation of the political parties represented in Parliament, a conference of all religious leaders and another conference of scholars and intellectuals who are interested in this national issue, he said.At these conferences the issues pertaining to the proposed new constitution can be discussed and unnecessary clauses could be removed and new clauses could be included, if required, he further said.The President was speaking at the National Convention on Reconciliation, participated by associations and national civil society activists, held yesterday (30th Oct.) at the Sugathadasa Stadium.He said the countrys problems cannot be solved through the protests carried out by being separated into parties. People and the country cannot be progressed through the divisions and separations. Everybody should get together and, work with understanding and find solutions. That is what, required for the country today, the President said.Many people who mess up the problems dont have the ability to solve them. I invite venerable Maha Sangha, other religious leaders, scholars and intellectuals to sit around one table and discuss about this matter, he said.It is everyones responsibility to ensure that the sound of gunfire is not heard once again. Everybody should take the responsibility to build the economy of all the people in a fair society, the President emphasized.The convention was organized by the Ministry of National Coexistence, Dialogue and Official Languages.", 
  "title": "President announces three major steps regarding constitutional reforms", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1699-president-announces-three-major-steps-regarding-constitutional-reforms"
}