{
  "date": "November 07, 2017", 
  "text": "The United States expressed its support to develop Sri Lanka as a regional hub for trade and investment in Asia, which would connect trade flows among ASEAN, India, the Middle East, and Africa through free and open seas that would be the key to growth of the region, says the joint statement issued by the Ministry of Foreign Affairs of Sri Lanka and the U.S. Department of State on the Sri Lanka-United States Partnership Dialogue held at Colombo yesterday (6th Nov.).Led by Sri Lanka Foreign Secretary Prasad Kariyawasam and US Under-Secretary of State for Political Affairs Thomas Shannon, the Partnership Dialogue demonstrates the consolidation of cooperation between the United States and Sri Lanka, and serves to further strengthen and enhance bilateral relations in the widest sense, through regular and structured engagement.It further states that as fellow democracies, the two governments resolved to work together toward a free and open Indo-Pacific region and for greater peace and stability around the world. The United States and Sri Lanka agreed that the security, stability, and prosperity of the Indian Ocean region should be safeguarded through the promotion of a rules-based order which would ensure that all countries that enjoy the global commons respect international laws and norms. Both countries agreed to advance this vision for peace and stability regionally and in international fora and stressed the particular importance of the freedom of navigation and overflight and of maintaining a maritime order based on the rule of law including unimpeded commerce, and they shared the intention to further promote cooperation and exchanges in maritime security and safety, including anti- piracy measures. Sri Lanka emphasized its need, as an island nation, to build maritime capacity so that it can effectively patrol its own borders andsafeguard its marine resources.The United States expressed its support for Sri Lanka through trade, investment, foreign assistance and direct partnership with stakeholders throughout the country and remains committed to a strong economic partnership and robust trade relationship with Sri Lanka.", 
  "title": "US supports SL to become regional trade and investment hub", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1720-us-supports-sl-to-become-regional-trade-and-investment-hub-2"
}