{
  "date": "November 09, 2017", 
  "text": "As prices of coconuts soared due to drought fuelled supply shortage, Sri Lanka announced that it is sourcing a huge volume of coconuts not from international sellers but from domestic suppliers, to be sold to local consumer at a very low price tag.Based on the Cost of Living Committees order yesterday (7th Nov.), Lanka Sathosa will source coconuts from various suppliers directly and sell from next week at a low price of Rs 65 each said Chairman of Lanka Sathosa TMKB Tennakoon. Chairman Tennakoon, representing the Minister of Industry and Commerce Rishad Bathiudeen was addressing a press briefing at CWE office at Vauxhall Street today (8th Nov.).Coconuts are a key product used in our kitchens and impacts on our CoL directly said Chairman Tennakoon, and added: Considering the current high prices of coconuts in the market, the CoL Committee has decided to distribute coconuts to local consumers at Rs 65 each through Lanka Sathosa outlets. We have been instructed to source them from private and state sector suppliers. We will start selling as soon as stocks arrive. We expect to receive first coconut stocks from the private sector suppliers starting next Tuesday 14th he said.Accordingly, till coconut prices fall, Lanka Sathosa will purchase 1.25 Mn nuts till end-November and another 1.75 Mn in the month of December all to be sold at Rs 65 each.Till end-November, Chilaw Plantations supplies 350,000, Elkaduwa Plantations supplies 100,000, Kurunegala Plantations 300,000 and the state run National Livestock Development Board (NLSDB) supplies 500,000 totalling to 1.25 Mn. All private sector suppliers agreed to supply the same volumes in December too while the state run NLSDB will double its supply to 1000,000 in December, so that 1.75 Mn nuts are moving to governments largest retail store chain Lanka Sathosa in December alone. Overall, Lanka Sathosa will flood three million nuts till January -during the rest of November and the month of December -to stabilise prices at the consumer end.After India, Indonesia, and Philippines, Sri Lanka was the fourth largest coconut exporter in Asia Pacific in 2013-a time when there was no droughts impacting the local crops.", 
  "title": "Sathosa sells 3 Mn coconuts at Rs. 65 each", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1726-sathosa-sells-3-mn-coconuts-at-rs-65-each"
}