{
  "date": "2017-11-23", 
  "text": "The Ministry of Finance and Mass Media yesterday (22nd Nov.) entered into two Loan Agreements with Asian Development Bank (ADB) to borrow USD 150 million for the development of 3400 km of rural roadways and USD 200 million for the implementation of 100 MW Wind Power Generation Project in Mannar Island.According to the recent economic policy statement of the government, development of the rural economies is one of the priorities to achieve the sustainable development of the country and therefore, the Government is investing more on rural infrastructure development to uplift the livelihood of people living in rural areas.3,400 km of rural access roads inclusive of 340 km of National highways will be upgraded under the agreement signed, today for the Second Integrated Road Investment Program. The significance of this road project is that these roads will be developed to suit all weather conditions and will improve 340 km of National roads with the aim of building up better connectivity between rural communities and socio economic centers.Improving the capacity of road agencies with respect to safeguards, road safety, maintenance, research capacity and road design and construction is another component of the program. The program will be implemented in Northern, Eastern, Uva and Western provinces.Under the first phase of this program 3,108 km of rural access roads and 248 km of national roads in Southern, Central, Sabaragamuwa, North Western, North Central Provinces and Kalutara District in Western Province are being improved and maintained. The total investment cost of the first tranche of this project is USD 172.1 million. ADB provides USD 150 million and the Government Contribution will be USD 22.1 million.Current energy policy focuses on diversification of power generation through Non-Conventional Renewable Energy Resources to improve the countrys energy security as well as the environment.Implementation of Wind Power Generation Project will support the Governments objective of achieving 20% of the total power generation through non-conventional power generation by 2020 by enhancing clean power generation.100 MW wind farm will be constructed in Mannar Island of the Northern Province under the proposed project. In addition, wind park infrastructure will be developed including Wind Parks internal medium voltage infrastructure, internal cabling and access roads; establishment of a renewable energy dispatch control center for the forecasting, controlling and managing intermittent 100 MW wind power generation.The total investment cost of this project is USD 256.7 million of which USD 200 million will be provided by ADB as a direct loan to CEB under a Treasury Guarantee. The balance USD 56.7 million will be financed by CEB.Dr. R H S Samaratunga, Secretary of the Ministry of Finance and Mass Media on behalf of the Government of Sri Lanka and Ms. Sri Widowati, Country Director of ADB Sri Lanka Resident Mission on behalf of ADB, signed two Loan Agreements on 22nd November 2017 at the Ministry of Finance and Mass Media.Further, the Chairman and the Vice Chairman of the Ceylon Electricity Board and Ms. Sri Widowati, Country Director of ADB Sri Lanka Resident Mission signed a loan agreement to obtain USD 200 mn from ADB for the implementation of Wind Power Generation Project.Mangala Samaraweera, Minister of Finance and Mass Media and Wencai Zhang Vice President of ADB also participated on this occasion.", 
  "title": "USD 350 Mn from ADB for infrastructure development in Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1739-usd-350-mn-from-adb-for-infrastructure-development-in-sri-lanka"
}