{
  "date": "2017-11-25", 
  "text": "Indian Prime Minister Narendra Modi who held bilateral talks with Prime Minister Ranil Wickremesinghe yesterday informed the latter that India would like to have fast tracked the implementation of Indian joint ventures in Sri Lanka.He added that this should be brought to the attention of President Maithripala Sirisena and these joint ventures started as soon as possible.Prime Minister Modi explained that this would not only improve Sri Lankas economic assets but would also add to job creation.Prime Minister Wickremesinghe said Sri Lanka was ready to take all steps needed to fast track joint venture projects between the countries and that they were working on speedily resolving many of the current obstacles. Prime Minister Modi thus praised the Lankan Prime Ministers efforts in strengthening the bilateral relationship between the countries.He noted that despite internal political opposition within Sri Lanka, Premier Wickremesinghe was taking great efforts in cementing the friendship between India and Sri Lanka.The above statements were made when Prime Minister Wickremesinghe visited his Indian counterpart for talks at Hydrabad House, New Delhi, where the latter and his delegation were hosted to lunch.In the meantime, Prime Minister Modi assured Prime Minister Ranil Wickremesinghe that as Sri Lanka celebrates 70 years of Independence, India would extend its complete support to the digital transformation of the education sector in the country.India, he said would prepare an information technology cooperation agreement to assist in the pilot project of providing school children with tabs and help prepare the necessary databases for Sinhala and Tamil instruction, Prime Minister Modi said.The Indian PM pointed out that it was important to implement development programmes to fulfil the aspirations of the youth and thus the two Premiers discussed challenges in implementation of such plans.The two sides exchanged ideas programmes to address food and energy security. They also focused on joint measures which need to be taken to ensure that the Indian Ocean was a region of peace and enable freedom of navigation.Modi who touched on the warm welcome he received during his last visit to Sri Lanka highlighted the importance of improving people to people relations between the two countries.The Indian delegation consisted of; Indian Foreign Secretary, S. Jaishankar, National Security Advisor Ajith Doval, Indian High Commissioner to Sri Lanka Tharanjit Singh Sandu, Joint Secretary of the Foreign Ministry Sanjay Panda whilst the Sri Lankan delegation comprised of Prof. Maithree Wickramasinghe, Law, Order and Southern Development Minister Sagala Ratnayaka, Secretary to the Prime Minister Saman Ekanayake, Sri Lankan High Commissioner in India Chithrangani Wageeshwara and Deputy High Commissioner M.R.K.Lenagala.", 
  "title": "Modi needs joint ventures expedited", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1740-modi-needs-joint-ventures-expedited"
}