{
  "date": "2016-09-08", 
  "text": "SriLankan Airlines today launched a new state of the art 24-hour Global Contact Centre, which will further enhance levels of service for all its worldwide customers and members of its FlySmiLes frequent flyer programme.Ajith Dias, Chairman of SriLankan Airlines, said: We have sharply enhanced our focus on the needs of our customers as an integral part of our effort to expand our business and bring SriLankan Airlines to profitability. I am confident that our new Global Contact Centre, which would be the first point of contact for many of our passengers, will tremendously increase levels of convenience and go a long way towards delighting our customers.The new centre will provide services for all SriLankan Airlines passenger operations. The airlines main contact number 1979, reachable from any fixed line or mobile in Sri Lanka, remains the same.SriLankan Airlines Chief Executive Officer, Captain Suren Ratwatte, said: We at SriLankan Airlines have in recent months been enhancing our product and taking our services to the very doorstep of customers through an enhanced website, sophisticated new mobile app and new ticket offices throughout Sri Lanka. Our Global Contact Centre has been designed to provide a level of service which is in accordance with SriLankan Airlines globally renowned standards in the air and on the ground. It will be comparable to the service that customers receive at our ticket offices, airport services and of course on-board our aircraft. Customer service and safety are our top priorities and this centre is proof of our commitmentThe centre is fully equipped to handle a wide range of customer service functions including 24x7 Call & Emailhandling; Skype facilities; Direct Dial numbers for selected online destinations; customized services for individual Flysmiles members; automated Flysmiles balance enquiries, last transaction details and mileage expiry for FlySmiLes members; enhanced monitoring and reporting of data and report generation from the state-of-the art Genesys Contact Centre system; and a social media monitoring capability. A Chat Facility will be activated shortly.The centre is in compliance with international standards on Data Security and Contact Centre Operations. It is expected to shortly be certified for ISO 27001 Information Security Standards, PCI-DSS v3.2 for Call Centre Systems and Environment and Industry Certification on Call Centre Processes (Service Capability & Performance certification). It is also equipped for Fraud Management on all transactions and contains a full-fledged Disaster Recovery Site.Located at the Iceland Business Centre Premises in Colombo 3, the Global Contact Centre will be operated by Scicom which is based in Malaysia with its fully own subsidiary in Sri Lanka We look forward to a long and mutually beneficial partnership with SciCom in this and other areas of our business.The expanded list of Local Direct-dial numbers now available for SriLankan online destinations is as listed below.", 
  "title": "SriLankan Airlines commissions sophisticated new Global Contact Centre", 
  "url": "https://www.dgi.gov.lk/news/latest-news/175-srilankan-airlines-commissions-sophisticated-new-global-contact-centre"
}