{
  "date": "December 07, 2017", 
  "text": "The Ministry of Telecommunication and Digital Infrastructure and the United Nations Development Program (UNDP) signed a Memorandum of Understanding to scale up HackaDev  Youth Social Innovation Challenge, recently.Under this initial agreement, the UNDPs tried and tested social innovation hackathon  HackaDev will be further scaled up and implemented until the end of 2019. The program is aimed at giving effect to the realization of the vision of a digital economy in Sri Lanka and will put young people in the spotlight of achieving the Sustainable Development Goals at the national level.The program is a co-financed initiative between the Ministry and UNDP, working closely with the Ministry of National Policies and Economic Affairs, the National Youth Services Council (NYSC), and the Information and Communication Technology Agency of Sri Lanka (ICTA).HackaDev aims to create a sustainable platform for young people in Sri Lanka to come up with innovative solutions to effectively address development challenges faced by their community or in the country at large.Following the approval of the Cabinet of Ministers for the initiative, the initial phase of the program was implemented in the latter half of 2017, where following a public call for applications for the National Youth Software Competition, a total of 45 innovative teams participated in three clustered HackaDev events in Badulla, Matara and Jaffna. Subsequently, nine teams went through the first phase of incubation in Colombo and will now receive seed funding to further develop their ideas towards implementation.Speaking about these teams, Minister of Telecommunication and Digital Infrastructure Harin Fernando said, I am amazed at the talent we have in Sri Lanka. You need to fail to win again. If you know the taste of failing, you know how it means to win. Never worry about somebody condemning your innovation. Keep going forward. I thank all the partners who have come together to create this platform for youth.Moving into the years 2018 and 2019, the project aims to further create opportunities for more young people to ideate solutions for development challenges by increasing their leadership, entrepreneurial, and innovative capacities.", 
  "title": "Steps to scale up Youth Social Innovation Challenge", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1751-steps-to-scale-up-youth-social-innovation-challenge"
}