{
  "date": "2017-12-07", 
  "text": "I believe that through Suraksha we can ensure a healthy future generation through the current education system, Minister Akila Viraj Kariyawasam said.The Suraksha health insurance program was given special recognition in the Budget Proposals of 2017. This program aims at adding value to the current free education system.Whilst it is national policy that all students in the country are given the opportunity of free education, free healthcare insurance to all children is a segment that has received special attention.On the direction of the Education Minister, 7th December has been designated as the Suraksha Student Insurance Day.On this day all government schools, approved private schools, pirivenas, assisted schools and international schools will carry out awareness programs.The programs are to commence at the auspicious hour of 8.08am while schools are expected to conduct programs with the participation of all parents of school children to disseminate information on the Suraksha Insurance Scheme.The Suraksha student insurance scheme will not only protect the mental and physical health of our children, but will undoubtedly guarantee a better future for them, the minister said.With rewards close to 5 lakhs of rupees under the theme Lets protect the children of our nation, we are proud to assert that this insurance scheme will be available to all students who attend local, private and international schools.The Ministry of Education today (7th Dec.) implemented a national program introduced to provide insurance coverage to over 4.5 million school students in the country. I believe that through Suraksha we can ensure a healthy future generation through the current education system, Minister Akila Viraj Kariyawasam said. The Suraksha health insurance program was given special recognition in the Budget Proposals of 2017. This program aims at adding value to the current free education system. Whilst it is national policy that all students in the country are given the opportunity of free education, free healthcare insurance to all children is a segment that has received special attention. On the direction of the Education Minister, 7th December has been designated as the Suraksha Student Insurance Day. On this day all government schools, approved private schools, pirivenas, assisted schools and international schools will carry out awareness programs. The programs are to commence at the auspicious hour of 8.08am while schools are expected to conduct programs with the participation of all parents of school children to disseminate information on the Suraksha Insurance Scheme. The Suraksha student insurance scheme will not only protect the mental and physical health of our children, but will undoubtedly guarantee a better future for them, the minister said. With rewards close to 5 lakhs of rupees under the theme Lets protect the children of our nation, we are proud to assert that this insurance scheme will be available to all students who attend local, private and international schools.", 
  "title": "National Day on Suraksha Student Insurance Scheme ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1753-national-day-on-suraksha-student-insurance-scheme"
}