{
  "date": "December 23, 2017", 
  "text": "He made these remarks participating at the progress review meeting of the Pibidemu Polonnaruwa (Awakening of Polonnaruwa) District Development Program held at the Polonnaruwa District Secretariat, yesterday (22nd Dec.).President Sirisena said that during the last three years too, the Government has given priority for the development projects implemented to support and uplift economic standard of low-income families than the mega development projects.The President also stressed the need of proper financial discipline and financial management when planning the development projects and said that it is the responsibility of officials to give maximum benefits to the public without wasting their money.During this meeting, the President inquired the officials about information he received regarding several development projects carried out wasting public funds and highlighted the need of officials paying more attention to take appropriate actions in a suitable way when planning of development projects.The President also instructed the officials to look into the needs of rural people, not only concerning the development of public places including the schools, hospitals and temples in the city and the both sides of the road. He also informed the District Secretaries to implement a special program in this regard.Already, 50 percent work of the project has been completed and, it was discussed in detail regarding successful implementation of the project in next year with the experiences of previous years.Expressing his views regarding this project, the President said that this project will enable the Polonnaruwa district to be named as a fully develop district in the period of 2018-2019.It was discussed in detail regarding the programs implemented to develop the schools in the district and the President requested to give priority for the rural school development in the year 2018.The President also pointed out the importance of giving priority for the programs implemented for the development of agriculture as well as livestock development as the year 2018 declared as National Food Production year. He also inquired the officials regarding the plans for the New Year for the field of livestock.The President emphasized the importance of strengthening the local dairy industry, and paid his attention regarding providing facilities in this regard.Discussions were also held at this meeting on the progress of the projects being carried out for the development of the regional hospitals in the district, drinking water supply projects, infrastructure development including the road development, irrigation development, conservation of archaeological sites, development of religious places and regarding all the projects including the sports. The public servants including the District Secretary and Peoples representatives in the district participated on this progress review meeting.President Maithripala Sirisena says in the year 2018, priority should be given for the projects which focused on uplifting of the economic status of underprivileged people while developing their livelihoods. He made these remarks participating at the progress review meeting of the Pibidemu Polonnaruwa (Awakening of Polonnaruwa) District Development Program held at the Polonnaruwa District Secretariat, yesterday (22nd Dec.). President Sirisena said that during the last three years too, the Government has given priority for the development projects implemented to support and uplift economic standard of low-income families than the mega development projects. The President also stressed the need of proper financial discipline and financial management when planning the development projects and said that it is the responsibility of officials to give maximum benefits to the public without wasting their money. During this meeting, the President inquired the officials about information he received regarding several development projects carried out wasting public funds and highlighted the need of officials paying more attention to take appropriate actions in a suitable way when planning of development projects. The President also instructed the officials to look into the needs of rural people, not only concerning the development of public places including the schools, hospitals and temples in the city and the both sides of the road. He also informed the District Secretaries to implement a special program in this regard. Already, 50 percent work of the project has been completed and, it was discussed in detail regarding successful implementation of the project in next year with the experiences of previous years. Expressing his views regarding this project, the President said that this project will enable the Polonnaruwa district to be named as a fully develop district in the period of 2018-2019. It was discussed in detail regarding the programs implemented to develop the schools in the district and the President requested to give priority for the rural school development in the year 2018. The President also pointed out the importance of giving priority for the programs implemented for the development of agriculture as well as livestock development as the year 2018 declared as National Food Production year. He also inquired the officials regarding the plans for the New Year for the field of livestock. The President emphasized the importance of strengthening the local dairy industry, and paid his attention regarding providing facilities in this regard. Discussions were also held at this meeting on the progress of the projects being carried out for the development of the regional hospitals in the district, drinking water supply projects, infrastructure development including the road development, irrigation development, conservation of archaeological sites, development of religious places and regarding all the projects including the sports. The public servants including the District Secretary and Peoples representatives in the district participated on this progress review meeting.", 
  "title": "Priority to uplift low-income families in 2018 President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1776-priority-to-uplift-low-income-families-in-2018-president"
}