{
  "date": "2017-12-25", 
  "text": "The spirit of Christmas is shared universally and is a time to spread the goodwill, love and joy the birth of Christ brings.Born in a manger to parents from a humble background, Jesus Christ brought equality, compassion and fellowship to mankind. He chose to set the captives free from social injustice and their mental, physical and spiritual burdens.Today, we live in a society that seeks freedom from tyranny and injustice, stigma and prejudice. One in which people will be free from religious and ethnic strife, able to live together in harmony and a spirit of tolerance.The Holy Bible tells us that good trees bear good fruit; an outpouring of goodness in our hearts can help us find the good in others.May you know a blessed Season of Goodwill that truly celebrates the birth of the Prince of Peace.     Ranil Wickremesinghe     Prime MinisterThe spirit of Christmas is shared universally and is a time to spread the goodwill, love and joy the birth of Christ brings.Born in a manger to parents from a humble background, Jesus Christ brought equality, compassion and fellowship to mankind. He chose to set the captives free from social injustice and their mental, physical and spiritual burdens.Today, we live in a society that seeks freedom from tyranny and injustice, stigma and prejudice. One in which people will be free from religious and ethnic strife, able to live together in harmony and a spirit of tolerance.The Holy Bible tells us that good trees bear good fruit; an outpouring of goodness in our hearts can help us find the good in others.May you know a blessed Season of Goodwill that truly celebrates the birth of the Prince of Peace.Christians in Sri Lanka and all over the world rejoice at Christmas which celebrates the birth of Jesus Christ, the Prince of Peace. The spirit of Christmas is shared universally and is a time to spread the goodwill, love and joy the birth of Christ brings. Born in a manger to parents from a humble background, Jesus Christ brought equality, compassion and fellowship to mankind. He chose to set the captives free from social injustice and their mental, physical and spiritual burdens. Today, we live in a society that seeks freedom from tyranny and injustice, stigma and prejudice. One in which people will be free from religious and ethnic strife, able to live together in harmony and a spirit of tolerance. The Holy Bible tells us that good trees bear good fruit; an outpouring of goodness in our hearts can help us find the good in others. May you know a blessed Season of Goodwill that truly celebrates the birth of the Prince of Peace.      Ranil Wickremesinghe     Prime Minister", 
  "title": "Prime Minister's Christmas Message", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1780-prime-minister-s-christmas-message-2"
}