{
  "date": "January 01, 2018", 
  "text": "It reminds us that we still have a task ahead - that of consolidating the true meaning of that victory.When we established the Government of Good Governance, the country was facing a time of social, economic and political decline.Amidst great challenges, we were able to steer forward in restoring economic stability and a process of sustainable development.We have been successful in presenting Sri Lanka to the world as a country that respects and recognizes human dignity, one in which all have access to social and political freedom. A country that abides by the principles of good governance. In the process, we have been able to generate a greater sense of goodwill among the international community towards Sri Lanka.We take this opportunity to thank everyone who accompanied us on the journey of emerging as a country with the highest regard for the principles of democracy and ethics. It is my most sincere hope that you would continue to be with us as we go forward.May 2018 be a year of hope and courage for all.Ranil WickremesinghePrime MinisterIt reminds us that we still have a task ahead - that of consolidating the true meaning of that victory.When we established the Government of Good Governance, the country was facing a time of social, economic and political decline.Amidst great challenges, we were able to steer forward in restoring economic stability and a process of sustainable development.We have been successful in presenting Sri Lanka to the world as a country that respects and recognizes human dignity, one in which all have access to social and political freedom. A country that abides by the principles of good governance. In the process, we have been able to generate a greater sense of goodwill among the international community towards Sri Lanka.We take this opportunity to thank everyone who accompanied us on the journey of emerging as a country with the highest regard for the principles of democracy and ethics. It is my most sincere hope that you would continue to be with us as we go forward.May 2018 be a year of hope and courage for all.Ranil WickremesinghePrime Minister2018 dawns on us as we recall the victory won in restoring political and social values, in realizing a dream long cherished by the people of this country.  It reminds us that we still have a task ahead - that of consolidating the true meaning of that victory. When we established the Government of Good Governance, the country was facing a time of social, economic and political decline. Amidst great challenges, we were able to steer forward in restoring economic stability and a process of sustainable development. We have been successful in presenting Sri Lanka to the world as a country that respects and recognizes human dignity, one in which all have access to social and political freedom. A country that abides by the principles of good governance. In the process, we have been able to generate a greater sense of goodwill among the international community towards Sri Lanka. We take this opportunity to thank everyone who accompanied us on the journey of emerging as a country with the highest regard for the principles of democracy and ethics. It is my most sincere hope that you would continue to be with us as we go forward. May 2018 be a year of hope and courage for all.  Ranil Wickremesinghe Prime Minister", 
  "title": "Prime Ministers message for the New Year", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1788-prime-minister-s-message-for-the-new-year"
}