{
  "date": "January 06, 2018", 
  "text": "Even though the construction works of the flyover was scheduled to be completed by the end of this year, steps were taken under the guidance of the President to complete the construction works 11 months ahead of the schedule for the convenience of the public.The construction works commenced in 2016 jointly by a Spanish company and a local company. The cost of the project is Rs. 4,700 million.The total length of the flyover is 533 meters and the total width, 21.4 meters, and comprises of total of four lanes, two lanes each way.In parallel to this project, several roads around the Rajagiriya area will be developed and an alternative road towards Narahenpita will be developed as well as the road towards Buthgamuwa will be developed with a total of three lanes.The flyover built using high standard modern technology as well as in accordance with high quality engineering, and this will be added to our roadways history as the first flyover constructed filling concrete surfaces on metal. This is also the most beautiful flyover in Sri Lanka.During the times of heavy traffic congestion in Rajagiriya, the speed of the vehicles moving on this road is slower than 2 kilometers per hour and it is expected after the completion of this flyover the speed limits of the vehicles to be increased by eightfold.This flyover can be considered as one of the most significant road development projects implemented by the present Government under the leadership of President Maithripala Sirisena, giving the benefits of the sustainable development for the country and it is also can be considered as an important milestone in the process of strengthening the economy of this country.President Maithripala Sirisena will vest the Rajagiriya flyover with the public on 8th January, providing long term solutions for the heavy traffic congestion in the Rajagiriya area. Even though the construction works of the flyover was scheduled to be completed by the end of this year, steps were taken under the guidance of the President to complete the construction works 11 months ahead of the schedule for the convenience of the public. The construction works commenced in 2016 jointly by a Spanish company and a local company. The cost of the project is Rs. 4,700 million. The total length of the flyover is 533 meters and the total width, 21.4 meters, and comprises of total of four lanes, two lanes each way. In parallel to this project, several roads around the Rajagiriya area will be developed and an alternative road towards Narahenpita will be developed as well as the road towards Buthgamuwa will be developed with a total of three lanes. The flyover built using high standard modern technology as well as in accordance with high quality engineering, and this will be added to our roadways history as the first flyover constructed filling concrete surfaces on metal. This is also the most beautiful flyover in Sri Lanka. During the times of heavy traffic congestion in Rajagiriya, the speed of the vehicles moving on this road is slower than 2 kilometers per hour and it is expected after the completion of this flyover the speed limits of the vehicles to be increased by eightfold. This flyover can be considered as one of the most significant road development projects implemented by the present Government under the leadership of President Maithripala Sirisena, giving the benefits of the sustainable development for the country and it is also can be considered as an important milestone in the process of strengthening the economy of this country.", 
  "title": "President to vest Rajagiriya flyover with public on January 08", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1793-president-to-vest-rajagiriya-flyover-with-public-on-january-08"
}