{
  "date": "January 07, 2018", 
  "text": "Addressing the media at the press conference on the event, Mr. Fernando said that Morgahakanda Project will make remarkable contribution to the food production in this country.To mark the opening of the project, social events including a cycle race have been organized by the committee, he added.Stating that the Mahaweli Projects have been irrigated around 100, 000 hectares paddy lands in the country, the Presidents Secretary said that Moragahakanda Project alone will additionally irrigate 82, 000 hectares of farm lands towards the upliftment of agricultural lands.Dr. R.H.S. Samaratunge, Secretary to the Ministry of Finance and Media said that Rs.181 billion worth this Moragahakanda Project will intensify the average land productivity value by 181% in the beneficiary area, with the generation of four billion worth of benefit.In addition to the production of 3,000 MT of inland fishing worth Rs.225 million, the project will save fuel worth of Rs.336 million by producing hydro-electricity.Under the electricity power generation development program in the country, Moragahakand and Uma Oya projects will add150 megawatts to the national grid, which remains present at 1, 000 megawatts.Since the water irrigated in these projects are used for several purpose including drinking and production of electricity, in addition to agricultural irrigation, the Secretary said, these projects can be identified as multi-purpose development projects.Several ministry officials including Director General of Government Information Attorney-at-Law Sudarshana Gunawardhane and Director General of Mahaweli Authority of Sri Lanka, Gotabhaya Jayarathne also participated at this conference.To mark the inauguration of irrigated water distribution among the people from the largest water reservoir in the country by President Maithripala Sirisena and to commemorate the commencement of the Mahaweli Development Project, a state ceremony will be held tomorrow (8th Jan.) at Mahaweli project locations of Moragahakanda and Polgolla, the Secretary to the President, Austin Fernando revealed this morning. Addressing the media at the press conference on the event, Mr. Fernando said that Morgahakanda Project will make remarkable contribution to the food production in this country. To mark the opening of the project, social events including a cycle race have been organized by the committee, he added. Stating that the Mahaweli Projects have been irrigated around 100, 000 hectares paddy lands in the country, the Presidents Secretary said that Moragahakanda Project alone will additionally irrigate 82, 000 hectares of farm lands towards the upliftment of agricultural lands. Dr. R.H.S. Samaratunge, Secretary to the Ministry of Finance and Media said that Rs.181 billion worth this Moragahakanda Project will intensify the average land productivity value by 181% in the beneficiary area, with the generation of four billion worth of benefit. In addition to the production of 3,000 MT of inland fishing worth Rs.225 million, the project will save fuel worth of Rs.336 million by producing hydro-electricity. Under the electricity power generation development program in the country, Moragahakand and Uma Oya projects will add150 megawatts to the national grid, which remains present at 1, 000 megawatts. Since the water irrigated in these projects are used for several purpose including drinking and production of electricity, in addition to agricultural irrigation, the Secretary said, these projects can be identified as multi-purpose development projects. Several ministry officials including Director General of Government Information Attorney-at-Law Sudarshana Gunawardhane and Director General of Mahaweli Authority of Sri Lanka, Gotabhaya Jayarathne also participated at this conference.", 
  "title": "State ceremony of Moragahakanda Project inauguration tomorrow", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1796-state-ceremony-of-moragahakanda-project-inauguration-tomorrow"
}