{
  "date": "2018-01-12", 
  "text": "The incumbent President who was elected on January 8, 2015 had assumed duties in the office of President on January 9, 2015 for a period of six years. Any changes of the term of President would be an alienation of the sovereignty of the people, Attorney General Presidents Counsel Jayantha Jayasuriya said.There is no provisions in the 19th Amendment to operate same with retrospective effect. Constitutions cannot be amended with retrospective effect, the Attorney General said making submissions on a determination sought by President Maithripala Sirisena from the Supreme Court as regards the duration of the term of his presidency.The Supreme Court yesterday concluded arguments put forward in support and against the reference application forwarded by President Sirisena seeking an opinion whether it is constitutional for him to serve for a period of six years in the office of President and all parties in the application were directed to file their written submissions by today (12).Later on, the Supreme Courts determination over the reference application is to be communicated to the President before January 14.Attorney General Jayantha Jayasuriya PC yesterday informed the Supreme Court that people had exercised their sovereignty through the right of franchise to elect President Maithripala Sirisena to the office of President for a period of six years prior to the operation of 19th Amendment to the Constitution.He submitted that the incumbent President was elected by the people for the office to the term of 6 years. It is the sovereignty of the people who exercise their franchise to elect him as President. The power emanated from the franchise of the people. The commencement of his office should be considered from the date on which he is elected.He said it is the Constitutional structure where the incumbent President was elected. The 19th Amendment to the Constitution is operative after the incumbent President was elected for a term of 6 years by the people.He continued that therefore the issue is whether the Article 3 and 4 of the 19th Amendment made operative where the term of office has already commenced.Meanwhile, Presidents Counsel Manohara de Silva appearing for an intervenient petitioner informed the Supreme Court that Presidents term should be confined to five years in accordance with the 19th Amendment to the constitution. The President in his website also insisted that he would like to limit his term of office. He agreed to have it for five years, Counsel stated.Seven intervenient petitioners filed their papers and made oral submissions regarding the Presidents reference.Presidents Counsel Saliya Peiris, Manohara de Silva PC, Ali Sabry PC, Faiz Musthapha PC, Senior Counsel Kalyananda Thiraanagama, Senior Court Chrismal Warnasuriya appeared for the intervenient petitioners.The court said it will convey its decision to President Maithripala Sirisena.Meanwhile the Presidents Media Division, issuing a statement, said that two different views have been expressed in legal, civil and political circles about the duration of the term of Presidency after the enactment of the 19th Amendment to the Constitution.In order to dispel this confusion, the President has sought the opinion of the Supreme Court regarding the actual term of office.According to the powers vested on the President under the Constitution, the President has the right to seek the opinion of the Supreme Court, it said, adding, that the former Presidents who held office had also sought the opinion of the Supreme Court during their tenures.President invoked the Consultative jurisdiction of the Supreme Court under article 129. (1) If at any time it appears to the President of the Republic that a question of law or fact has arisen or is likely to arise which is of such nature and of such public importance that it is expedient to obtain the opinion of the Supreme Court upon it, he may refer that question to that Court for consideration and the Court may, after such hearing as it thinks fit, within the period specified in such reference or within such time as may be extended by the President, report to the President its opinion thereon.", 
  "title": "Attorney General says: President's term covers six years ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1799-attorney-general-says-president-s-term-covers-six-years"
}