{
  "date": "January 12, 2018", 
  "text": "Sri Lanka is forecast to accelerate to 5 percent in 2018, mainly reflecting strong private consumption and investment growth the World Bank (WB) says in its latest economic prediction.Referring to the south Asia the WB says that Growth in the region is forecast to accelerate to 6.9 percent in 2018. Consumption is expected to stay strong, exports are anticipated to recover, and investment is on track to revive as a result of policy reforms and infrastructure upgrades it added.India is expected to pick up to 7.3 percent growth in FY 2018/19, which begins April 1, and to 7.5 percent in FY 2019/20, supported by strong private consumption and public spending on wage increases and infrastructure investments. Private investment is expected to revive as the private sector adjusts to the Goods and Services Tax and a global trade recovery lifts exports.Excluding India, growth in the region is projected to pick up to 5.8 percent in 2018 and to 5.9 percent the following year as domestic demand remains robust and exports recover. Pakistan is expected to accelerate to 5.8 percent in FY 2018/19, which begins July 1. Bangladesh will grow at 6.7 percent in FY 2018/19, benefitting from strong domestic demand and strengthened exports. Sri Lanka is forecast to accelerate to 5 percent in 2018, mainly reflecting strong private consumption and investment growth.RisksRisks to the outlook are mainly domestic. Setbacks to reform efforts in the corporate and financial sectors, disruptions due to natural disasters, and challenges that weaken domestic demand could subdue growth prospects. Increasing liabilities across the region could also derail fiscal consolidation efforts, with weaker debt sustainability dampening financial market confidence.Externally, an upswing in global financial volatility could slow growth. However, on the upside, stronger-than-expected global growth could result in faster growth than anticipated in the more open economies in the region.World Bank AssistanceThe World Bank approved $6.0 billion in lending to the region for 51 projects in fiscal 2017, including $2.2 billion in IBRD loans and $3.8 billion in IDA commitments, of which $0.9 billion came from the IDA Scale-Up Facility. The Bank also delivered 122 advisory services and analytical products, providing technical advice on such issues as competitiveness, energy sector reform, and fragility. The Banks regional strategy continues to emphasize sustaining inclusive growth at a high rate. It focuses on providing support to private sector development through such actions as climate-resilient investments, greater social and financial inclusion, strengthening governance, and addressing fragility.", 
  "title": "World Bank says SL economy accelerates to 5% in 2018 ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1800-world-bank-says-sl-economy-accelerates-to-5-in-2018"
}