{
  "date": "January 12, 2018", 
  "text": "The Secretary to the President has handed over a copy of the report of the Commission of Inquiry to Investigate, Inquire and Report on the Issuance of Treasury Bonds (COI) during the period from 1st February 2015 to 31st March 2016 to the Governor on 10, January.The Monetary Board of the Central Bank of Sri Lanka (CBSL) yesterday (January 11TH) issued a statement relating to the Recommendations of the Commission of Inquiry and measures taken to improve the management and control of the Public Debt and the Employees Provident Fund. The statement listed the regulatory actions taken on Perpetual Treasuries Limited and Pan Asia Banking Corporation.Based on the supervisory concerns and non-compliances identified in the on-site examination report of Perpetual Treasuries Limited (PTL) and other investigations, the Monetary Board issued Directions to PTL on 07/11/2016 curtailing their levels of operation in the primary and secondary market and preventing the alienation of funds.Based on continuing investigations, further Directions have since been issued from time to time and as of now their business activities are suspended; and PTL are prevented from the disposal of assets, distribution of profits and making payments without the prior approval of CBSL.The Directions are in force until 6th July 2018. CBSL has frozen the assets of PTL held with CBSL and has informed the Securities and Exchange Commission to take appropriate action with regard to assets of PTL coming under its purview.The Central Bank said it will initiate measures to carry out forensic audits carried out in relation to the issuance of Treasury bonds during the 2008 to 2014 and the Treasury bond auctions held in March 2016.The statement also lists various measures taken to improve transparency and governance of the investment decision making process as well as the internal control framework of the EPF.It further said that measures have been taken to increase the efficiency and enhancing the transparency of debt management operations and this include the introduction of new Auction System for Primary Issuances of Government Securities and improve secondary market for Sri Lanka Development Bonds (SLDBs).The Governor of the Central Bank of Sri Lanka has been handed a copy of the report of the Bond Commission, entrusting the task of considering giving effect to the recommendations contained in the Report. The Secretary to the President has handed over a copy of the report of the Commission of Inquiry to Investigate, Inquire and Report on the Issuance of Treasury Bonds (COI) during the period from 1st February 2015 to 31st March 2016 to the Governor on 10, January. The Monetary Board of the Central Bank of Sri Lanka (CBSL) yesterday (January 11TH) issued a statement relating to the Recommendations of the Commission of Inquiry and measures taken to improve the management and control of the Public Debt and the Employees Provident Fund. The statement listed the regulatory actions taken on Perpetual Treasuries Limited and Pan Asia Banking Corporation. Based on the supervisory concerns and non-compliances identified in the on-site examination report of Perpetual Treasuries Limited (PTL) and other investigations, the Monetary Board issued Directions to PTL on 07/11/2016 curtailing their levels of operation in the primary and secondary market and preventing the alienation of funds. Based on continuing investigations, further Directions have since been issued from time to time and as of now their business activities are suspended; and PTL are prevented from the disposal of assets, distribution of profits and making payments without the prior approval of CBSL. The Directions are in force until 6th July 2018. CBSL has frozen the assets of PTL held with CBSL and has informed the Securities and Exchange Commission to take appropriate action with regard to assets of PTL coming under its purview. The Central Bank said it will initiate measures to carry out forensic audits carried out in relation to the issuance of Treasury bonds during the 2008 to 2014 and the Treasury bond auctions held in March 2016. The statement also lists various measures taken to improve transparency and governance of the investment decision making process as well as the internal control framework of the EPF. It further said that measures have been taken to increase the efficiency and enhancing the transparency of debt management operations and this include the introduction of new Auction System for Primary Issuances of Government Securities and improve secondary market for Sri Lanka Development Bonds (SLDBs).The Governor of the Central Bank of Sri Lanka has been handed a copy of the report of the Bond Commission, entrusting the task of considering giving effect to the recommendations contained in the Report. The Secretary to the President has handed over a copy of the report of the Commission of Inquiry to Investigate, Inquire and Report on the Issuance of Treasury Bonds (COI) during the period from 1st February 2015 to 31st March 2016 to the Governor on 10, January. The Monetary Board of the Central Bank of Sri Lanka (CBSL) yesterday (January 11TH) issued a statement relating to the Recommendations of the Commission of Inquiry and measures taken to improve the management and control of the Public Debt and the Employees Provident Fund. The statement listed the regulatory actions taken on Perpetual Treasuries Limited and Pan Asia Banking Corporation. Based on the supervisory concerns and non-compliances identified in the on-site examination report of Perpetual Treasuries Limited (PTL) and other investigations, the Monetary Board issued Directions to PTL on 07/11/2016 curtailing their levels of operation in the primary and secondary market and preventing the alienation of funds. Based on continuing investigations, further Directions have since been issued from time to time and as of now their business activities are suspended; and PTL are prevented from the disposal of assets, distribution of profits and making payments without the prior approval of CBSL. The Directions are in force until 6th July 2018. CBSL has frozen the assets of PTL held with CBSL and has informed the Securities and Exchange Commission to take appropriate action with regard to assets of PTL coming under its purview. The Central Bank said it will initiate measures to carry out forensic audits carried out in relation to the issuance of Treasury bonds during the 2008 to 2014 and the Treasury bond auctions held in March 2016. The statement also lists various measures taken to improve transparency and governance of the investment decision making process as well as the internal control framework of the EPF. It further said that measures have been taken to increase the efficiency and enhancing the transparency of debt management operations and this include the introduction of new Auction System for Primary Issuances of Government Securities and improve secondary market for Sri Lanka Development Bonds (SLDBs).", 
  "title": "Central Bank to initiate forensic audits on issuance of T-bonds", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1801-central-bank-to-initiate-forensic-audits-on-issuance-of-t-bonds"
}