{
  "date": "January 14, 2018", 
  "text": "As a festival that commemorates the harvest, it is also an occasion to be thankful to nature for the bountiful supply.The agrarian society possesses a deep reverence for the Sun God that goes back centuries. The Thai Pongal Festival personifies this tradition with meaning by consecrating the first fruits to Sun God who enables a rich harvest every year. The animals who contribute towards a successful crop are also taken into account at Thai Pongal. These vibrant traditions reinforce the close bond between man and nature in a meaningful way.Thai Pongal Festival confirms to us the blessings of being at peace with nature and the value of equality; it helps us to ponder on being thankful for everything nature has provided for us.As Tamils all over the world celebrate this special day, they join hands with all Sri Lankans in a poignant message of goodwill among all.May this Thai Pongal Day be a time to reflect on our respect for nature and an opportunity to share fellowship as an equal society.I wish all a blessed Thai Pongal Day. Ranil WickremesinghePrime MinisterAs a festival that commemorates the harvest, it is also an occasion to be thankful to nature for the bountiful supply.The agrarian society possesses a deep reverence for the Sun God that goes back centuries. The Thai Pongal Festival personifies this tradition with meaning by consecrating the first fruits to Sun God who enables a rich harvest every year. The animals who contribute towards a successful crop are also taken into account at Thai Pongal. These vibrant traditions reinforce the close bond between man and nature in a meaningful way.Thai Pongal Festival confirms to us the blessings of being at peace with nature and the value of equality; it helps us to ponder on being thankful for everything nature has provided for us.As Tamils all over the world celebrate this special day, they join hands with all Sri Lankans in a poignant message of goodwill among all.May this Thai Pongal Day be a time to reflect on our respect for nature and an opportunity to share fellowship as an equal society.I wish all a blessed Thai Pongal Day. Ranil WickremesinghePrime MinisterThai Pongal is celebrated by Tamils all over the world as an occasion of considerable religious significance. As a festival that commemorates the harvest, it is also an occasion to be thankful to nature for the bountiful supply. The agrarian society possesses a deep reverence for the Sun God that goes back centuries. The Thai Pongal Festival personifies this tradition with meaning by consecrating the first fruits to Sun God who enables a rich harvest every year. The animals who contribute towards a successful crop are also taken into account at Thai Pongal. These vibrant traditions reinforce the close bond between man and nature in a meaningful way. Thai Pongal Festival confirms to us the blessings of being at peace with nature and the value of equality; it helps us to ponder on being thankful for everything nature has provided for us. As Tamils all over the world celebrate this special day, they join hands with all Sri Lankans in a poignant message of goodwill among all. May this Thai Pongal Day be a time to reflect on our respect for nature and an opportunity to share fellowship as an equal society. I wish all a blessed Thai Pongal Day.   Ranil Wickremesinghe Prime Minister", 
  "title": "Prime Ministers Thaipongal Day Message", 
  "url": "https://www.dgi.gov.lk/news/latest-news/1803-prime-minister-s-thaipongal-day-message"
}