{
  "date": "2016-09-14", 
  "text": "(13-09-2016) -Public Utilities Commission of Sri Lanka ( PUCSL), the electricity sector regulator, today announced the implementation of national standard for plug and socket outlet in Sri Lanka for Non-industrial Applications with the aim of uplifting the safety of electricity consumers.The Government has decided that the Type G plug and socket outlet , widely known as the 13 ampere plug and socket outlet, commonly referred to as the square pin plug and socket is to be the only national standard in Sri Lanka. However the transition to the type G standard plug and socket should not require any premises to be re-wired purely for the purpose of accommodating the new standard, and that the existing wiring may remain until the end of its useful life. Also from 16th August 2016, wiring of new installations, addition of circuits to existing installations or complete re-wiring of existing installation, should be wired with 2.5 mm2 (7/0.67 mm Cu) to be compatible for the requirements of type G 13 A socket outlets.Sri Lanka currently use different types of plugs and sockets to make a connection to a wall socket, to which the plug on an appliance does not often fit, electricity users adopt a variety of methods and devices, most of which are unsafe and cause the connection to be unreliable. Sri Lanka reported about 95 electrocutions in 2015 up from 76 in 2013 and 73 in 2014. Use of various substandard plugs, sockets, electrical accessories, adaptors, and extension cords are one of the main causes for electrocution and fire.The Standard received the Cabinet approval which proposed by Hon. Prime Minister RanilWickremesinghe in his capacity as the Minister of National Policies and Economic Affairs, to apply G grade as the sole standard for plugs and socket used in Sri Lanka, and to allow the use of plugs and socket outlets which are sold within next two years, to the end of their lifetime.The Standard was finalized through a wider public consultation where general public, industrialist, manufacturers, energy sector experts and other stakeholders involved in the decision making process. This standard is effective from 16th August 2016, the Commission said. Time FrameThe Commission has issued the following time table for the standardisation of a single plug and socket outlet in Sri Lanka: National Standard for plugs and socket outlet is effective from 16th August 2016 Manufacturing and importing of nonstandard plugs and socket outlets will be banned from 16th August 2017. The sale of such appliances will be banned from August 16, 2018, with any remaining stocks to be sold after being replaced with a square pin plug. The grace period for manufacturing, importing and sale of non-standard plugs and socket outlets will effect from 16th of August 2016, the date of the cabinet approval The Government expects the country will totally transform and use Type G plugs and socket outlets by year 2038.", 
  "title": "SRI LANKA SETS NATIONAL STANDARD FOR PLUGS AND SOCKET OUTLETS FOR  NON-INDUSTRIAL APPLICATIONS", 
  "url": "https://www.dgi.gov.lk/news/latest-news/181-sri-lanka-sets-national-standard-for-plugs-and-socket-outlets-for-non-industrial-applications"
}