{
  "date": "September 20, 2016", 
  "text": "President Maithripala Sirisena attended the Open Plenary of the Bill Clinton Foundations Clinton Global Initiative (CGI) meeting, in which the Plenary Session of the Partnering for Global Prosperity was held today September 19 at the Sheraton Hotel in New York.Former US President Bill Clinton welcomed President Sirisena and other leaders who attended the meeting and said their presence was a great strength to the CGI endeavour to eradicate poverty, improve health and sanitation in poorest segments of the people in least developed countries.Chelsea Clinton, the daughter of former President, delivered the opening remarks as Vice President of the Clinton Foundation. She said the people today are caught up increasingly in three extremes  extreme climate change, extreme poverty and extreme ideology. It is very relevant that the CGI Plenary on Partnership for Global Prosperity drew attention towards extreme ideology in the back drop of recent bomb attacks in New York, believed to be the handiwork of an organized group supporting extreme ideology of ISIS.President Sirisena held informal discussions with several Heads of State attending the CGI. After the CGI, the President hosted a luncheon for the group of media personnel covering the United nations General Assembly (UNGA). In an informal chat with the media, he expressed happiness over the rapid improvement in Sri Lankas external relations, mainly due to the policies of the government and its global interaction during the last one and half years.The President will attend the opening session of the UNGA tomorrow (Sept 20) morning, which will be preceded by the 1st Anniversary celebrations of the Sustainable Development Goals (SDGs). In the afternoon he is scheduled to hold bilateral discussions with Australian Prime Minister Malcolm Turnbull and few other leaders. He will also attend the luncheon hosted by UN Secretary General Ban Ki-moon.In the evening of September 20, President Sirisena will participate in the Open Government Partnership with the leaders of several leading nations at the UN Headquarters 20.President Maithripala Sirisena attended the Open Plenary of the Bill Clinton Foundations Clinton Global Initiative (CGI) meeting, in which the Plenary Session of the Partnering for Global Prosperity was held today September 19 at the Sheraton Hotel in New York. Former US President Bill Clinton welcomed President Sirisena and other leaders who attended the meeting and said their presence was a great strength to the CGI endeavour to eradicate poverty, improve health and sanitation in poorest segments of the people in least developed countries.Chelsea Clinton, the daughter of former President, delivered the opening remarks as Vice President of the Clinton Foundation. She said the people today are caught up increasingly in three extremes  extreme climate change, extreme poverty and extreme ideology. It is very relevant that the CGI Plenary on Partnership for Global Prosperity drew attention towards extreme ideology in the back drop of recent bomb attacks in New York, believed to be the handiwork of an organized group supporting extreme ideology of ISIS.President Sirisena held informal discussions with several Heads of State attending the CGI. After the CGI, the President hosted a luncheon for the group of media personnel covering the United nations General Assembly (UNGA). In an informal chat with the media, he expressed happiness over the rapid improvement in Sri Lankas external relations, mainly due to the policies of the government and its global interaction during the last one and half years.The President will attend the opening session of the UNGA tomorrow (Sept 20) morning, which will be preceded by the 1st Anniversary celebrations of the Sustainable Development Goals (SDGs). In the afternoon he is scheduled to hold bilateral discussions with Australian Prime Minister Malcolm Turnbull and few other leaders. He will also attend the luncheon hosted by UN Secretary General Ban Ki-moon.In the evening of September 20, President Sirisena will participate in the Open Government Partnership with the leaders of several leading nations at the UN Headquarters 20.", 
  "title": "President, a special invitee at the Clinton Global Initiative (CGI) Annual Meeting", 
  "url": "https://www.dgi.gov.lk/news/latest-news/186-president-a-special-invitee-at-the-clinton-global-initiative-cgi-annual-meeting"
}