{
  "date": "October 06, 2016", 
  "text": "The national carrier SriLankan Airlines focus on re-structuring its operations to effect a turnaround is recording a significant reduction in losses, coupled with a rationalization of routes and aircraft.Stringent cost controls underscored by heightened accountability and transparency have been cornerstones of the new strategy. The new management, supported by the incumbent government, is successfully shedding its past legacy as a loss-making institution by adopting a leaner approach and making strategic moves to strengthen its position as a leading regional airline.In the Financial Year ending 31st March 2016, the airline recorded a significantly improved performance compared to the previous year. Despite many challenges still remaining, it is encouraging to note that the airlines performance in the first five months of the current financial year has seen a similar trend of improved performance. At the end of the last financial year, without the one-off payment relating to cancellation of the lease of one A350 aircraft, the airlines Group Loss stood at LKR 9.03 billion, which represents a 45% improvement for the 2015/16 financial year compared to the previous year. The net loss after taking the one-off item into consideration is LKR 11.59 billion, compared to the net loss of LKR 16.33 billion during the previous year. The performance for the first five months of the current financial year witnessed a 37% improvement, with a lower Group Loss of LKR 2.32 billion compared to the previous years Group Loss of LKR 3.71 billion. The interest cost alone for this period was LKR 2.53 billion.Whilst the steep drop in fuel prices contributed to the improved performance of the previous year and the first five months of the current financial year, this benefit was significantly eroded with the airlines declining revenue. This is due to the addition of capacity to the Colombo market by other airlines, accompanied by a dramatic drop in airfares in certain markets. The performance was further impacted by the depreciation of the Sri Lankan Rupee. In fact, it has been impacted by a loss of LKR 1.03 billion just for the five months of this financial year alone. It is also a significant fact that the airline carries a huge finance cost, which again contributes to the increase in the Groups Loss. The total interest bearing liabilities as at 31st August 2016 to banks/ financial institutions is USD 478.5 million (LKR 69.7 billion). The interest cost for the current financial year is estimated at LKR 6.2 billion. As part of the restructuring of the airline, the GOSL is expected to restructure the balance sheet by taking off this debt, which substantially will improve the financial position of the Company. Re-structuring an airline is no easy task. Re-structuring a legacy airline towards making it a sustainable entity is even more challenging. Therefore, given the complexity of the business, the re-structuring is being approached in a responsible manner in consultation with the shareholders.In a bold and informed step, the airline, in conjunction with the relevant government authorities, reversed the A350 aircraft deal which was signed in 2013. After careful consideration of a multitude of factors, including current and foreseeable future market conditions, the onset of fierce competition, the inherited adverse financial situation of the company, and the very high lease rentals of the A350 aircraft, it became clear that these aircraft could not be operated economically. Although significant one-off costs had to be agreed to in order to terminate the contracts, it was recognized that inducting and operating these aircraft would not augur well for a sustainable bottom line going forward. The Fleet strategy for the future will complement the network strategy of more medium and short haul destinations using narrow-body aircraft and wide-body aircraft with lower ownership costs. The network rationalization has seen some unprecedented decisions having been made on the routes. By the first week of November, routes to Continental Europe will no longer be operated by the airline. SriLankans gateway to Europe will be London, with Continental Europe being served by a number of code shares with partners, offering passengers a seamless product. This decision too was the result of a careful study of the network. While the strategy of network rationalization is not uncommon in most airlines restructuring, SriLankan further recognized that rationalization alone will not bring about sustainability. Hence, it has identified certain new markets which it can serve profitably, as well as existing destinations that can be served with increased frequencies.Gan, in the Maldives, will be the first such new destination, and SriLankan will be the only international airline serving Gan. Other potential destinations in India and South East Asia are being evaluated and will be introduced as the narrow-body fleet deliveries come on stream from the next financial year.The integration of the Mihin Lanka routes with SriLankan has helped to consolidate the schedule enabling more productive and efficient inventory management which is forecast to improve the revenues. With this integration, additional frequencies operated will be operated to the Seychelles and Dhaka will receive wide-body flights.No restructuring effort can be successful towards bring about sustainability, without a clear focus on costs while at the same time not compromising on safety and security. Notwithstanding numerous challenges, the airline has been able to contain its costs and make savings in certain controllable items. This has been due to increased scrutiny of expenses across all areas. The airlines staff have come forward to make constructive suggestions towards cost-saving initiatives and also worked hard at negotiating cost reductions with vendors. Aircraft Lease costs, being the second-largest cost item for the airline next to fuel, had to be addressed. The Wet Lease of an A330-300 aircraft to Pakistan International Airlines (PIA) is an initiative towards this end. It is expected that the airline will negotiate a longer term dry lease with PIA for three A330-300 aircraft at the end of the wet lease period.The revenues from this project will offset the high lease rentals on these aircraft.Commenting on the ongoing restructuring activities and performance of the airline, Capt. Suren Ratwatte, CEO of SriLankan Airlines, explains, The new management is committed to building revenues, consolidating operations and controlling costs, which are already helping to strengthen the companys bottom line. As a company, we are consciously sweating our assets harder to ensure optimal utilization of all resources. The strategic decision to position the airline as a regional player has been followed up by rationalization of our fleet to consist of more narrow-body aircraft rather than A350s, which are meant for long haul destinations. We have a clear blueprint mapping our trajectory to become a leaner and more efficient operator, which is being achieved steadily, after years of loss-making operations. More than anything else, we are proud of the culture of transparency and accountability that has been instilled in the organization which in time will restore the reputation enjoyed by the airline in the first few decades of its establishment.The Airlines Aviation College is steadily becoming a magnet for students from Sri Lanka and the region wanting to build a successful career in the aviation industry. It is the only European Aviation Safety Agency (EASA) certified aviation college in the region offering engineering, ground handling and cabin crew training in-house. The airlines EASA certified MRO capability is held in high esteem with the airline being awarded contracts by several airlines for third party work, which is expected to grow in the future and be a significant source of revenue for the airline.While a great deal of attention has been paid to the re-structuring efforts, the management has kept a close watch on service and standards which are the cornerstone of this industry. The airline has continued to invest in people and training to maintain service standards to complement its product, which is on par with the best-in-class. When asked to comment on the Public Private Partnership (PPP) for the airline, Chairman of SriLankan Airlines, Ajith Dias, stated The negotiation is being initiated by the Government of Sri Lanka, which is negotiating with several prospective partners who have communicated their expressions of interest. The lead manager for this transaction is the National Savings Bank. Our objective is to focus on re-structuring the airline in order to ensure a framework for sustainability is in place for a PPP that the shareholder will enter into.", 
  "title": "SriLankan Airlines chartering a course towards a sustainable future", 
  "url": "https://www.dgi.gov.lk/news/latest-news/188-srilankan-airlines-chartering-a-course-towards-a-sustainable-future"
}