{
  "date": "2016-10-06", 
  "text": "The President Dalia Grybauskait expressed interest on the development taking place in Sri Lanka and commended the advances made by the incumbent Government of Sri Lanka and underlined the fact that Lithuania and the European Union wish to support Sri Lanka in ensuring further progress, prosperity and lasting peace to prevail in Sri Lanka.The President of Lithuania and the Ambassador reaffirmed the intention, to further strengthen diplomatic relations between the two countries and the need to intensify bilateral exchanges in the fields of academic,cultural, tourism and student exchange programmes.The two countries established Diplomatic relations on 20thAugust 1996.This year marks the 20th anniversary of Diplomatic relations between Lithuania and Sri Lanka.Ambassador of Sri Lanka in Sweden Mrs. Damayanthie Rajapakase, concurrently accredited to the Republic of Lithuania presented Letters of Credence to Her Excellency Dalia Grybauskait, the President of the Republic of Lithuania at the Presidential Palace in Vilniuson 29th of September 2016. Ambassador extended the greetings of the President and the Prime Minister of Sri Lanka to the President of Lithuania. Ambassador discussed withthe Lithuanian President the measures taken bythe National Unity Government of Sri Lanka on democratization, reconciliation and growth achieved in the socio-economic front. The President Dalia Grybauskait expressed interest on the development taking place in Sri Lanka and commended the advances made by the incumbent Government of Sri Lanka and underlined the fact that Lithuania and the European Union wish to support Sri Lanka in ensuring further progress, prosperity and lasting peace to prevail in Sri Lanka. The President of Lithuania and the Ambassador reaffirmed the intention, to further strengthen diplomatic relations between the two countries and the need to intensify bilateral exchanges in the fields of academic,cultural, tourism and student exchange programmes. The two countries established Diplomatic relations on 20thAugust 1996. This year marks the 20th anniversary of Diplomatic relations between Lithuania and Sri Lanka.", 
  "title": "Ambassador of Sri Lanka in Sweden presents Credentials to Lithuanian President F", 
  "url": "https://www.dgi.gov.lk/news/latest-news/191-ambassador-of-sri-lanka-in-sweden-presents-credentials-to-lithuanian-president-f"
}