{
  "date": "October 11, 2016", 
  "text": "Forty children whose parents sacrificed their lives for the nation or became disabled while they were members of the armed forces, were given a very special World Childrens Day indeed, as three pioneering organisations in Sri Lankas travel and tourism industry joined hands once again in a unique corporate social responsibility effort.SriLankan Airlines, the national carrier, Galle Face Hotel, one of the countrys most famous heritage hotels, and Ebert Silva Holidays, a pioneer in travel and tourism, created an undoubtedly unforgettable day for the children and their family members on 1st October, for the second consecutive year.The day-long event included a ride from Colombo to Katunayake on board Ebert Silva Holidays double decker busses, a tour of Bandaranaike International airport with lunch and movies on board an aircraft, and a ride back to Colombo for a sumptuous tea party at Galle Face Hotel.The day started with the kids gathering at Galle Face Hotel. They then hopped on to two of Ebert Silva Holidays famed red open-deck double deckers, decorated with colourful balloons and ribbons. With the children waving cheerfully to the gathered crowds, the double deckers rumbled out of Galle Face Hotel.It was a thrilling ride with children clapping and singing to music and treats served on board. Threading their way through Colombos streets that Saturday morning, they headed to Bandaranaike International Airport where they were greeted by beaming SriLankan staff.The children received an interesting tour of the airport, experiencing the procedures of checking in as passengers. Then with great excitement the kids boarded a state of the art Airbus A330 and had the treat of viewing a movie of their choice with lunch being served on board by smiling SriLankan staff. The excited kids also had the rare opportunity of getting a view of the cockpit, and airline staff briefed them on various aspects of air travel.After an unforgettable experience they boarded the double deckers again to returnto Colombo.Back at the Galle Face Hotelthey were greeted with a welcome drink and cold towels, and a fantastic tea party had been prepared for them to the famed standards of the hotel. There was a sumptuous range of food items in true Galle Face Hotel style, topped off with a magic show andan amazing breakdance performance, both by talented SriLankan Airlines staff members, musical entertainment by a three-piece band, and gifts for all.The spread of food included everything kids love - marshmallows, ice cream, chocolates, pasta, pizza, etc.A very special moment took place when medals were presented to the children in honour of their parents supreme sacrifice. Many of the childrens mothers became very emotional at this demonstration of love and care on behalf of the nation, as it was an acknowledgement of the sacrifice of their husbands.", 
  "title": "Making dreams come true on World Childrens Day", 
  "url": "https://www.dgi.gov.lk/news/latest-news/198-making-dreams-come-true-on-world-children-s-day"
}