{
  "date": "2016-10-11", 
  "text": "The Government of Japan extendsa loan package up to the amount of Japanese Yen 33,137 million (approximately Rs. 48 billion) to the Government of Sri Lanka consisting of two loans aimed at facilitating the economic and social development in the country.The details of the program and project financed under the loans are as follows;(1) Development Policy Loan (Private Sector Development, Governance Improvement and Fiscal Consolidation) (Japanese Yen 10,000 million)In 2015, Sri Lankan economy recorded 4.8 percent real GDP growth. In order to achieve more sustainable economic growth, the government of Sri Lanka has prioritized a package of policy and institutional reforms in macro-economic and public financial management, as well as the promotion of the private sector.This loan is to provide untied financial support directly to the treasury upon completion of the package of policy and institutional reforms by the Government of Sri Lanka.Co-financed with the World Bank Group, this loan supports the Government of Sri Lankas efforts toi) reduce obstacles to private sector competitiveness, ii) establish transparent and well managed public institutions, and iii) improve fiscal sustainability. (2) Anuradhapura North Water Supply Project (Phase 2)(Japanese Yen 23,137 million)Located in North Central Sri Lanka, Anuradhapura District is an arid region without any nearby rivers or other water sources, and residents rely on limited groundwater drawn from wells for daily living.A high concentration of fluoride, which is harmful to the human body, has been detected in the groundwater, and the harm being inflicted on personal health is a major priority. Furthermore, Chronic Kidney Disease (CKD) is prevalent in the area, of which exact cause is still unknown, but some researchers consider that contaminants in the groundwater may be one of the causes. The Anuradhapura North Water Supply Project (Phase 2) will improve the water supply facilities and switch the water source from groundwater to safe surface water, improving the access of area residents to safe drinking water.The Phase 2 of this projectis to supplement and broaden the project implementation area of the Phase 1, whichis now ongoing with the loan amounting to Japanese Yen 5,166 million extended in March 2013.These loans offered on highly concessional terms and conditions are administered by the Japan International Cooperation Agency (JICA). The signing of the Exchange of Notes took place today between H.E. Mr. Kenichi Suganuma, Ambassador of Japan to Sri Lanka and Ms. G.D. Chandra Ekanayake, Deputy Secretary to the Treasury,Ministry of Finance,followed by the signing of a Loan Agreement between Mr. Hidetoshi Irigaki, Vice President of JICA and Ms. G.D. Chandra Ekanayake, Deputy Secretary to the Treasury, Ministry of Finance, at the Ministrys premises. Dr. Hiroto Izumi, Special Advisor to the Prime Minister of Japan, who is currently in Sri Lanka, and Hon. Niroshan Perera, State Minister of National Policies and Economic Affairs,testified the signings.", 
  "title": "Japan Provides Rs. 48 billion Loan Package to Sri Lanka:  Development Policy Loan and  Anuradhapura North Water Supply Project", 
  "url": "https://www.dgi.gov.lk/news/latest-news/199-japan-provides-rs-48-billion-loan-package-to-sri-lanka-development-policy-loan-and-anuradhapura-north-water-supply-project"
}