{
  "date": "October 11, 2016", 
  "text": "A goldmine of ideas to convert Police into a people friendly law and order maintenance machinery emerged at the international conference Future Policing: Prospects and Challenges for South Asia held in Colombo to coincide with the 150th anniversary of Sri Lanka Police.The conference, which was held under the patronage of President Maithripala Sirisena, was organized jointly by the National Police Commission (NPC) and the Colombo-based South Asian think-tank, Regional Centre for Strategic Studies (RCSS) and the Police in collaboration with the United Nations.The three-day conference, which concluded on 6 October, discussed the South Asian policing methods and suggested steps needed to make reforms in the Police service while identifying the common issues in the region and understanding the diversity among them.Post-conflict societyPromising to implement major reforms, IGP Jayasundara said a dynamic post-conflict society in Sri Lanka demands qualitatively and quantitative modernized Police, with a democratic outlook and commitment towards its responsibilities and accountability under the Constitution of Sri Lanka. Human Rights form the basis for Sri Lanka Police service which is legally and morally bound to serve and protect the people, he said.The IGP said the forum discussed a broad range of themes that are of great importance to South Asian countries such as Oversight and Accountability, Community Policing, Technology and Policing, Gender and Policing, Child Protection, Terrorism and Human Rights and Environment and Policing.He said the proposals emerged at the conference would lead to formulate a South Asian model to policing in the region, which can be adopted to better suit the diversities and norms of the nations. Experts and Police officers from 21 countries including Indonesia, Malaysia, Bangladesh, Australia, Pakistan, China, Nepal, Bhutan and officials from INTERPOL as well as scholars and experts who have research and practical experience on policing in South Asia attended the conference.Democratic policingNPC Chairman Prof. Siri Hettige, in his speech referred to democratic policing and the imperative need to transform the Police to be a key player in the State mechanism that protects Human Rights, maintains order and guarantees stability.During the deliberations, many important issues were discussed. The experts pointed out that the Police have the powers to arrest and detain and to use force, placing the Police in a unique and sensitive position within the democratic State. Police will enhance the legitimacy of the State if it is responsive to public needs and expectations; and use the authority of the State in the peoples interest and the Police are the most visible manifestation of government authority.There is an urgent requirement for Police reforms as policing in Sri Lanka continues to be governed by the Police Ordinance of 1861 still relying on colonial policing laws and structures despite political independence of the country more than 60 years ago and the introduction of various democratic institutions.Colonial economyInitially, the Police force was established to protect the establishment ie. the colonial order, colonial economy and other interests. The British model defined Police constable as not the servant of anyone, saviour of the law itself, responsibility for law enforcement lies on him. He is answerable to the law and to the law alone. (Lord Denning)The duties of the Police include maintenance of public tranquility and law and order, protect and respect the individuals fundamental rights and freedoms, prevent and combat crime and provide assistance and services to the public.Social developmentPolicing in a modern State has to be both fair and effective for economic and social development of the country and the role of policing in todays context is diverse and complex. It is vital to build good community relations, enhance professionalism by using modern technology and employing new operational tactics and focusing on crime  a growing threat to societies in the 21st century.United Nations recognizes policing as a vital component of broader security which is critical to prevent conflict, contribute to peacebuilding and to ensure safety and security for sustainable development. All these have enormous impacts on the State, economy and development. 2030 UN Agenda for Sustainable Development recognize 17 SDGs of which policing is also critically important to create a sense of security.Sustainable developmentAnother aspect is that Sri Lanka aims to achieve sustainable development for which a vital requirement is both domestic and foreign investments. To attract investors peace and stability are essential pre-requisites. Hence maintaining law and order and rule of law is essential. Role of policing is rapidly going beyond traditional / limited maintenance of law and order and prevention and detection of crime to include new roles of protecting human rights, disaster management, protection of environmental resources, ecotourism, and biodiversity conservation.Though situation changed with arrival of peace and the Police service gradually shifted from security form of policing to community oriented policing, process is taking place at a slow pace. Powers of independent Commissions, including National Police Commission, established as oversight bodies in 2001 short-lived with the 18th Amendment, Police analysts pointed out at the conference. However, they were reinstituted under the 19 A.The drawbacks include limited resource and organizational weakness that constrain the effective and efficient deployment of available personnel both functionally and territorially.Community policing In recent years, community policing has emerged as a major strategy of policing to make the Police more effective at crime prevention and control. Yet, the experts lamented that the transition is slow due to diverse circumstances.", 
  "title": "From wartime to peace, Transition of Policing", 
  "url": "https://www.dgi.gov.lk/news/latest-news/200-from-wartime-to-peace-transition-of-policing"
}