{
  "date": "2016-10-12", 
  "text": "Secretary to the Ministry of Defence Eng. Karunasena Hettiarachchi who in China attending the 7th Xiangshan Forum in Beijing was among the distinguished speakers of the second plenary session on Tuesday (11th September 2016).Making his speech during the second plenary session on \"The Role of Militaries in Global Governance' Secretary Hettiarachchi said, that Asia is home to three of the world's nuclear powers and is a space of constant reconfigurations of political and security alignment since British decolonization. The global political and economic balance of power is undergoing major shifts with the rise of the Asian economies and the re-emergence to prominence of the Indian Ocean in global developments and trade. The dramatic changes that have occurred in the scope of international connectivity in the second half of the 21st century, has led to monumental changes in the intensity, speed and volume of global interactions and significantly increased global interdependence not only among states but also a number of non-state actors that have become key stakeholders of global governance.Further speaking he said, the proliferation of stakeholders has led to the creation of a new architecture of global governance that has moved from a state-centric model to embrace complex interactions among states, intergovernmental organizations (IGOs), and non-state actors, ushering in an age of global partnerships. In this backdrop, militaries across the globe are adjusting to new strategic realities and their role in global governance is being constantly reinvented. The role of militaries in global governance is being evolved not only to counter traditional and non-traditional security threats but also to proactively contribute to Human Security, he added.Secretary Hettiarachchi went on to say that with the change of government in January 2015 Sri Lanka reaffirmed its adherence to a policy of non-alignment with an emphasis on building positive relations with all States. Sri Lanka is committed to countering security threats in the region and looks forward to working together with its partners and friends in the region and beyond to find innovative and collaborative ways in which to meet these challenges.Speaking on the concept of civil-military cooperation he said that in Sri Lanka, the role of the military is evolving with the changes that have taken place in the internal security environment of the country since the defeat of terrorism in 2009. Particularly in the immediate post conflict phase the military was used to deliver assistance in the North and East where civilian administration needed assistance. Gradually the military was removed from involvement in civilian administration in these areas. It has become evident however, that in some cases the Armed Forces have the capacity and capability of delivering quick assistance on matters of national importance where civilian administration is gathering momentum in its delivery capability and being a developing country with resource constraints Sri Lanka needs to avail itself of such assistance as and when requested and needed.While mentioning of the country's military involvement in development activities and disaster management and humanitarian response activities he mentioned the role of the Sri Lankan armed forces personnel in disaster management efforts in Maldives and Nepal.While speaking of Sri Lanka's involvement in UN Peacekeeping efforts he said that, President Maithripala Sirisena has reaffirmed of Sri Lanka's commitment to increase contribution to UN peacekeeping missions. Sri Lanka has contributed to peacekeeping missions in the Central African Republic, Western Sahara, Haiti, Lebanon, Democratic Republic of the Congo, Darfur, Liberia, and South Sudan among others.He opined that the Indian Ocean is a region where the interests and influence of India, China and the United States has begun to overlap and intersect. In this realm, the role of small yet effective militaries such as that of Sri Lanka is important. Sri Lanka together with its partners also has responsibility to ensure the safety, security and livelihoods of the millions of people who inhabit the Indian Ocean littoral spaces and hinterlands. In this context building stronger cooperation in the maritime sphere and ensuring maritime safety and security is critical. The potential 'Soft Power' that Sri Lanka could wield considering our critical location in the Indian Ocean region is yet to be fully exploited.He was of the view that global governance needs to comprehensively address the issue of climate change, environmental degradation and man's growing ecological footprint. It is critical for governments to be alert at all times with regard to the ecological impact of military exercises and military operations.In conclusion the Secretary said that Sri Lanka is committed to high level dialogue with regions through platforms such as this to ensure a safe and prosperous future for its citizens and the world at large.The Xiangshan Forum , initiated by the China Association for Military Science (CAMS) in 2006 is a track 1.5 high-end dialogue platform on Asian Security and defense issues. The theme for this year is 'Build a New Type of International Relations through Security Dialogue and Cooperation' and the four topics for discussion at the plenary sessions are 'Role of Militaries in Global Governance', 'Responding to New Security Challenges in the Asia-Pacific through Cooperation', 'Maritime Security Cooperation' and 'International Terrorist Threats and Countermeasures'. This defence conclave is sponsored by Chinese Academy of Military Science and the China Institute for International Strategic Studies.", 
  "title": "Secretary speaks at Xiangshan Forum", 
  "url": "https://www.dgi.gov.lk/news/latest-news/202-secretary-speaks-at-xiangshan-forum"
}