{
  "date": "October 13, 2016", 
  "text": "Referring to a news story recently telecasted on television channels including state media of a boy committing suicide by keeping his neck on the train track, he said that this was a gross violation of ethical practices by those media.Although it was not the role of the Department of Government Information, or the Director General of the Department, I have to intervene in this case in the large context of public interest, he added today addressing the weekly Cabinet briefing. Dr. Kalansooriya while thanking the media institutions, who positively responded to his humble request during the last weekend, asked all broadcasting media not to conduct their competition through blood sheddings or dead bodies of the people.According to him, the government is preparing the discussion paper which would be issued very soon for public discussion. Then the public would be able to present their views on that. A specific Act for an Independent Media Regulatory System would come within a very specific time with the deadline.Joining the Director General Kalansooriya, the Deputy Minister Karunarathne Paranawithana was also thankful to the media who did not broadcast, and positively reacted on the DGs request. He also requested to remove the relevant video clips from social media as the damage caused to the society by them is enormous.Violation of media ethics continuously by broadcasting media (televisions) in the recent past shows the need for a proper and an independent regulatory system for broadcasting media, said the Director General of Government Information Dr. Ranga Kalansooriya. Referring to a news story recently telecasted on television channels including state media of a boy committing suicide by keeping his neck on the train track, he said that this was a gross violation of ethical practices by those media.Although it was not the role of the Department of Government Information, or the Director General of the Department, I have to intervene in this case in the large context of public interest, he added today addressing the weekly Cabinet briefing. Dr. Kalansooriya while thanking the media institutions, who positively responded to his humble request during the last weekend, asked all broadcasting media not to conduct their competition through blood sheddings or dead bodies of the people.According to him, the government is preparing the discussion paper which would be issued very soon for public discussion. Then the public would be able to present their views on that. A specific Act for an Independent Media Regulatory System would come within a very specific time with the deadline.Joining the Director General Kalansooriya, the Deputy Minister Karunarathne Paranawithana was also thankful to the media who did not broadcast, and positively reacted on the DGs request. He also requested to remove the relevant video clips from social media as the damage caused to the society by them is enormous.", 
  "title": "Behavior the cause for regulation of media ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/208-behavior-the-cause-for-regulation-of-media"
}