{
  "date": "2016-10-13", 
  "text": "Addressing the weekly Cabinet briefing today at the Department of Government Information, Deputy Minister also the Acting Minister added that although there were dissent opinions in the country in this regard, different religious leaders have expressed their consent for Buddhism to be given priority. Finally, the matter will be resolved at the Constitutional Assembly.When the minister was asked about establishing of a branch of a religious movement in Vavuniya, he replied that although how many Senaa were there, there was no Senaawa (People) with them.Replying to a question as to whether the Buddhism would be declared as the state religion of the country, he added that they are not going to declare Buddhism as the state religion. In Sri Lanka we dont have a state religion. What we have done is we have given Buddhism the first and foremost place, he said.Primacy or the priority that has been given to Buddhism by the Constitution does not need to change as there is a big consent among all political parties to keep it as it is, said the Deputy Minister of Parliamentary Reforms and Mass Media Karunarathne Paranawithane. Addressing the weekly Cabinet briefing today at the Department of Government Information, Deputy Minister also the Acting Minister added that although there were dissent opinions in the country in this regard, different religious leaders have expressed their consent for Buddhism to be given priority. Finally, the matter will be resolved at the Constitutional Assembly.When the minister was asked about establishing of a branch of a religious movement in Vavuniya, he replied that although how many Senaa were there, there was no Senaawa (People) with them.Replying to a question as to whether the Buddhism would be declared as the state religion of the country, he added that they are not going to declare Buddhism as the state religion. In Sri Lanka we dont have a state religion. What we have done is we have given Buddhism the first and foremost place, he said.", 
  "title": "Primacy for Buddhism need not change  Dep. Minister", 
  "url": "https://www.dgi.gov.lk/news/latest-news/209-primacy-for-buddhism-need-not-change-dep-minister"
}