{
  "date": "2016-10-18", 
  "text": "President of Russia Vladimir Putin, expressing his appreciation over the transformation being occurred in Sri Lanka and assured he will provide every required support to Sri Lanka.He made these remarks when he met President Maithripala Sirisena on the sidelines of the BRICS Outreach Summit yesterday (Oct. 16) in Goa, India.President Putin warmly welcomed President Sirisena and expressed his best wishes.President Sirisena thanked the Russian President for the unconditional support extended to Sri Lanka at the United Nations Human Rights Council. He assured that the government is fully committed to further enhance the friendship between the two countries.Meanwhile, the President also met with the Chinese President Xi Jinping in India, (16).During the meeting, both leaders discuss the ways and means as how to further strengthen the existing close relationship between the two countries as well as regarding the preparatory works of the ceremony to be held in Sri Lanka to celebrate the 60th anniversary of the Sri Lanka- China friendship.The President also appreciated the assistance given by the Government of China in preventing kidney disease in Sri Lanka and further discussed the programmes to be implemented on the prevention of kidney disease in parallel to the 60th anniversary celebrations of the Sri Lanka- China friendship.He also appreciated the assistance given by the Government of China for the Moragahakanda Development Project and further said that the development projects being implemented in Sri Lanka by China is a more support for the strategic development of Sri Lanka.Expansion of import and export activities between the two countries was discussed in detail.President of Russia Vladimir Putin, expressing his appreciation over the transformation being occurred in Sri Lanka and assured he will provide every required support to Sri Lanka. He made these remarks when he met President Maithripala Sirisena on the sidelines of the BRICS Outreach Summit yesterday (Oct. 16) in Goa, India.President Putin warmly welcomed President Sirisena and expressed his best wishes.President Sirisena thanked the Russian President for the unconditional support extended to Sri Lanka at the United Nations Human Rights Council. He assured that the government is fully committed to further enhance the friendship between the two countries.Meanwhile, the President also met with the Chinese President Xi Jinping in India, (16).During the meeting, both leaders discuss the ways and means as how to further strengthen the existing close relationship between the two countries as well as regarding the preparatory works of the ceremony to be held in Sri Lanka to celebrate the 60th anniversary of the Sri Lanka- China friendship.The President also appreciated the assistance given by the Government of China in preventing kidney disease in Sri Lanka and further discussed the programmes to be implemented on the prevention of kidney disease in parallel to the 60th anniversary celebrations of the Sri Lanka- China friendship.He also appreciated the assistance given by the Government of China for the Moragahakanda Development Project and further said that the development projects being implemented in Sri Lanka by China is a more support for the strategic development of Sri Lanka.Expansion of import and export activities between the two countries was discussed in detail.", 
  "title": "Putin assures fullest support to Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/218-putin-assures-fullest-support-to-sri-lanka"
}