{
  "date": "October 19, 2016", 
  "text": "As announced to the public on 10.10.2016, the Monetary Board at its meeting held on 14.10.2016 considered resolution issues pertaining to a number of non-bank financial institutions in the context of relevant legal provisions in the interest of protecting the public trust in the financial system.Accordingly, the Monetary Board approved a resolution mechanism for repayment of depositors of three finance companies and legitimate investors in government securities-linked investments in Entrust Securities PLC. The three finance companies are The Standard Credit Finance Ltd., City Finance Corporation Ltd. and Central Investments and Finance PLC. All three companies got into a chronic financial position in 2008 and 2009 due to fraud and mismanagement of funds and, therefore, these companies did not have assets to pay off deposits. All restructuring efforts made by the Central Bank, from time to time, could not produce envisaged results as those who managed these companies failed to arrange an infusion of new capital. As a result, these companies became insolvent and were out of business since then. The Entrust Securities PLC, a company with a primary dealer license to trade government securities, got into a chronic liquidity and insolvency crisis during latter part of 2015 as a result of fraudulent use of funds placed by customers for investment in government securities. The Central Bank on January 4, 2016 suspended the Board of Directors of the Entrust and vested its operations in the National Saving Bank to protect the investors. The Monetary Board reviewed the lack of progress so far and took cognizance of the fact that there was no further room to revive these companies to enable them to repay depositors and investors in the foreseeable future. Given the long-delay involved so far, the Monetary Board approved the company resolution plans submitted by the Department of Supervision of Non-banking Financial Institutions to repay deposits and investments annually commencing from 2017 over a reasonable period of time with a fair interest rate during this repayment period. In the case of the three finance companies, repayment will cover Rs. 4,868 mn of nearly 11,878 depositors. In the case of the Entrust, investments secured with government securities amounting to Rs. 3,100 mn belonging to 107 investors will be settled in the coming weeks. In respect of unsecured investments in the Entrust amounting to Rs. 8,508 mn belonging to 24 individuals and entities, government securities will be allocated and be repaid under the repayment plan to be implemented with the managing support of the Seylan Bank PLC. The Central Bank will complete the required administrative procedures and communicate details to all those depositors and investors. Once the repayment plan is legally finalized, those companies will be dealt with through applicable laws for liquidation. The Monetary Board is of the view that this is the only option that now remains as there are no assets in these companies and no investors have been willing to revive these companies and repay above depositors and investors. As part of the resolution plans, the Central Bank will set up a new Enforcement Division in the Department of Supervision of Non-bank Financial Institutions to institute legal action against Directors and managers who have been responsible for the fraud and misappropriation of funds and to make every effort to recover such funds from them. In the case of the Entrust, the law enforcement authorities, in association with the Central Bank, have already initiated legal actions. The Enforcement Division will also introduce a routine procedure to take legal action against parties who have committed similar fraudulent practices in existing companies, in the event such instances are detected by the examination staff. Further, action will be taken to address lapses in the Central Bank and to strengthen regulatory and supervisory mechanisms on a priority basis to ensure the safety and soundness of existing institutions. However, it is important to stress that the regulation and supervision do not mean a guarantee for each and every deposit and investment made by the public in banks and financial institutions. Those who make such deposits and investments and those who undertake businesses based on these funds are primarily responsible for their business decisions regarding prudent management of their funds. In fact, almost all funds placed in the above distressed companies have been mobilized through unauthorized financial products. Even large depositors and investors have been negligent in not undertaking the normal due diligence on risks and return, despite being sufficiently knowledgeable and skillful to do so. The responsibility of the Central Bank is only to provide an external safeguard through regulation and supervision to the extent permitted in law while facilitating institutions to carry on their businesses essential for the economy and general public in a safe and sound manner in a stable financial system. Therefore, all those who are stakeholders to these resolution plans are kindly requested to co-operate with the Central Bank in order to end this long-standing issue in the public interest. In the event of non-cooperation, the Central Bank will have no option but to reluctantly permit these companies to be wound up under the law.", 
  "title": "Central Bank resolves four insolvent financial institutions to protect depositors and promote the financial system stability", 
  "url": "https://www.dgi.gov.lk/news/latest-news/219-central-bank-resolves-four-insolvent-financial-institutions-to-protect-depositors-and-promote-the-financial-system-stability"
}