{
  "date": "October 24, 2016", 
  "text": " SriLankan Airlines (www.srilankan.com) enhanced its position of prominence in South Asias corporate sector by winning two prestigious accolades for Human Resources Practices and Corporate Social Responsibility at the Sri Lanka Best Employer Brand Awards and the South Asian Partnership Summit & Business Awards 2016 (SAPS) of the World HRD Congress respectively.Colonel Sunil Peiris, Director of SriLankan Airlines, said: Our national carrier has built a strong tradition of excellence over the years. These two awards underline SriLankan Airlines reputation as both an employer of choice through our HR practices, and as an exemplary corporate citizen which serves the community and the country with distinction through our community upliftment arm SriLankan Cares.Pradeepa Kekulawala, Head of Human Resources at SriLankan Airlines, who accepted the awards on behalf of the national carrier, said: I am delighted that the professionalism and commitment to excellence of our HR and CSR team has been recognized by these international awards. All credit to our team members for their consistent hard work and dedication.The Sri Lanka Best Employer Brand Awards were hosted by Employer Branding Institute and Stars of the Industry Group, with CHRO Asia as a strategic partner, and were endorsed by the Asian Confederation of Businesses. They were presented on 13th October at The Kingsbury Hotel in Colombo.Award winners were selected first through research by a specialized team of researchers, whose recommendations were evaluated by an eight-member panel of international judges.The awards are presented tothe best employers who create a culture of contribution and innovation at work; believe in consistent improvement in HR policy by measuring organizational health and inculcating values that help to achieve their vision; inculcate practices of being a social and equal opportunity employer; develop and nurture future leaders; are exemplary in learning and development nitiatives; communicate distinctiveness in employee hiring, training and retention practices; and demonstrate continuous nnovation. Meanwhile the airlines CSR arm, SriLankan Cares,received the Community Development Award in the Organisational Category at the South Asian Business Excellence Awards 2016 on the same day, 13th October, 2016, at the Waters Edge in Colombo.The South Asian Partnership Summit & Business Awards are hosted by World HRD Congress and Endorsed by Asian Confederation of Businesses. The Awards honour and celebrate leaders around the region working unitedly to strengthen economic opportunity.The goal of SAPS is to provide a forum to establish the standards of excellence for quality development and to honour the people and organisations responsible for developing the most effective actions that exemplify that excellence. More than 200 prominent individuals in leadership roles in the political, social, economic, financial and corporate arenas in South Asia attended the award ceremony.SriLankan Cares promotes the welfare of children in all areas of Sri Lanka, working with schools, hospitals and local communities and raising funding for all types of charitable causes which feature children.", 
  "title": "SriLankan Airlines wins two prestigious awards for HR Practices and CSR", 
  "url": "https://www.dgi.gov.lk/news/latest-news/226-srilankan-airlines-wins-two-prestigious-awards-for-hr-practices-and-csr"
}