{
  "date": "2016-10-31", 
  "text": "SriLankan Airlines emphasized its positioning as an airline of choice among discerning global travelers by winning the Best Full Service Airline in Central and South Asia at the Future Travel Experience Asia Awards 2016 in Singapore for the second consecutive year.Ajith Dias, Chairman of SriLankan Airlines, said: SriLankan Airlines is constantly enhancing and developing the standard of products and services that we provide our valuable customers and we are delighted to win this prestigious award yet again. This is especially relevant since we have commenced repositioning SriLankan with a greater focus on the Asia-Middle East travel markets. We are in the process of launching services to 11 exciting new destinations in the region before the end of the year, which will provide enhanced connectivity and convenience to all our passengers.SriLankan was among just five full service airlines which received awards at this prestigious event as the most customer-centric airlines and airports in Asia. The other winners in the Full Service Airline category included globally reputed brands such as Singapore Airlines, Cathay Pacific, Air New Zealand and Qatar Airways.SriLankans CEO Captain Suren Ratwatte said: The FTE Award is further evidence that we at SriLankan Airlines provide our passengers with a level of service that is truly of world class standard. We recently took delivery of several of the most sophisticated Airbus A330-300 aircraft, and we will be further enhancing our product by inducting two brand new A320neo and three A321neo aircraft in 2017, which will be deployed in our regional markets.The FTE Asia Awards (www.futuretravelexperience.com) are highly competitive with winners being chosen by a panel of experts from the airline industry who comprehensively examine the entire passenger experience. Full service airlines were judged on an extensive range of criteria in their products and service, including business class, economy and other classes, long-haul flights, short-haul flights, in-flight entertainment systems, cabin crew service, comfort, food and beverage, consistency of service and overall passenger experience.The awards ceremony was held during the Future Travel Experience Asia Expo 2016, Asias largest travel experience trade event, which was held at the Marina Bay sands in Singapore from 25-26 October and was attended by more than 3,500 senior travel professionals from around the world.A member of the prestigious oneworld global airline alliance, SriLankan Airlines now serves 102 cities in 47 countries with direct flights from Colombo to most major cities in the Middle East and Asia-Pacific. Its all-Airbus fleet is equipped with the latest entertainment systems, luxurious seating, and on-board cuisine that is among the finest in the sky.", 
  "title": "SriLankan Airlines named Best Full Service Airline in Central & South Asia yet again", 
  "url": "https://www.dgi.gov.lk/news/latest-news/231-srilankan-airlines-named-best-full-service-airline-in-central-south-asia-yet-again"
}