{
  "date": "2016-11-03", 
  "text": "On 3rd November 2016, the Government of Japan announced the conferment of The Order of the Sacred Treasure Gold Rays with Neck Ribbon upon Prof. Monte Cassim, in recognition of his significant contribution in promoting higher education at private institutions in Japan and mutual understanding between Japan and Sri Lanka.A congratulatory message was sent by Mr. Fumio Kishida, Minister of Foreign Affairs in Japan, on 3rd November upon the announcement stating Please accept my sincerest congratulations on the conferment of The Order of the Sacred Treasure Gold Rays with Neck Ribbon, in recognition of your outstanding contribution, and my best wishes for your continued good health and happinessAs a professor of Ritsumeikan University, Japan, Prof. Monte Cassim had tutored many students since 1994. He assumed the post of President of the Ritsumeikan Asia Pacific University in 2004 and expanded admission to over 5,000 students into the university, not only from Japan but also from over 90 countries and regions. As a result, Ritsumeikan Asia Pacific University became known as an innovative institute of higher education where more than half its student population was international students while approximately 40 percent of its faculty and staff were foreigners. A large number of its global minded graduates are now contributing immensely in many fields in various parts of the world.In addition, Prof. Cassim was appointed as Senior Advisor to the Prime Minister of Sri Lanka in 2015 and contributed to the success of the visit by Hon. Prime Minister Ranil Wickremasinghe to Japan in October 2015. He continues to promote exchanges between Japan and Sri Lanka particularly in the fields of research and development as well as science and technology.", 
  "title": "The Government of Japan confer a prestigious decoration on Prof. Monte Cassim", 
  "url": "https://www.dgi.gov.lk/news/latest-news/233-the-government-of-japan-confered-prestigious-decoration-on-prof-monte-cassim"
}