{
  "date": "2016-11-07", 
  "text": "India and Sri Lanka held Ministerial level talks on fishermen issues today, November 5, 2016, in New Delhi.External Affairs Minister Mrs. Sushma Swaraj and Minister of Agriculture & Farmers Welfare Mr. Radha Mohan Singh met with the Sri Lankan Minister for Foreign Affairs Mr. Mangala Samaraweera and Minister for Fisheries and Aquatic Resources Development Mr. Mahinda Amaraweera of Sri Lanka. Minister of State for Road Transport, Highways & Shipping Mr. Pon Radhakrishnan and Sri Lankan Member of Parliament Mr M.A. Sumanthiran were part of the two delegations. The Ministers exchanged views on possible mechanisms to help find a permanent solution to the fishermen issues. They agreed on the setting up of a Joint Working Group on Fisheries to meet every three months and a meeting between the Ministers for Fisheries every six months. The delegations would include representatives from the Ministries of Foreign Affairs, the Coast Guards and Navies of both countries. The 1st Ministerial Meeting would be held on January 02, 2017 in Colombo. The Terms of Reference for the Joint Working Group (JWG) would include (i) expediting the transition towards ending the practice of bottom trawling at the earliest, (ii) working out the modalities for the Standard Operating Procedures (SOPs) for handing over of apprehended fishermen, and (iii) ascertaining possibilities for cooperation on patrolling. The issue of the release of detained fishing vessels will be discussed at the first JWG meeting. Both Governments agreed on the setting up a hotline between the two Coast Guards. There was support for expediting the provision of communication tracking sets to the fishermen. Both Governments agreed to the request by the Fishermen Associations that there should be no violence and no loss of life in the handling of fishermen by the Navies and Coast Guards of the two countries. They agreed to encourage the Fishermen Associations of the two countries to meet every six months to take further their dialogue from the meeting held on November 2, 2016 in New Delhi. The Ministers noted that the process is underway for the release of fishermen presently in custody on either side.", 
  "title": "Ministerial level talks on fishermen issues between India and Sri Lanka ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/240-ministerial-level-talks-on-fishermen-issues-between-india-and-sri-lanka"
}