{
  "date": "November 08, 2016", 
  "text": "Malik Samarawickrama, stated that he was very proud and thankful to the organizers for having selected Sri Lanka as the venue for hosting the 10th Annual Forum.In his address Minister Samarawickrama stated that Sri Lanka and particularly the BOI recognized the very important role that investment has to play in developing the economies of the countries in the Asian Region. For this reason the Government of Sri Lanka has identified the attraction of FDI as one of its Key policies in bringing about the rapid development of the country.One vital element in the process for attracting investment is to create strong economic bonds between all countries by entering into investment agreements at the Intra regional level. This can be achieved by developing the necessary capabilities for negotiators to initiate discussions at the bilateral, regional and multilateral level.As far as Sri Lanka is concerned this forum will prove to be very useful as the country is engaged in the process of negotiating FTAs with several key partners in the Asian region such as China and Singapore.The Forum is very much an international event with over 50 countries represented and therefore an excellent platform where delegates with a vast knowledge and experience can share ideas and know how in many areas relating to investment negotiations.The Minister therefore concluded that the forum offers considerable potential for capacity building, networking and the exchange of ideas and experiences.Finally, Minister Samarawickrama elaborated on some of the many improvements that have taken place in Sri Lanka which international participants will be able to witness during their visit to the country. These include the rapid development taking place in the City of Colombo and the large scale development projects.He added that while developing Sri Lanka continues to be an island paradise with a rich cultural heritage and many natural beauties.Malik Samarawickrama, Minister of Development Strategies and International Trade welcomed the participants of the 10th Annual Forum of Development Countries investments Negotiations which was organized by the International Institute for Sustainable Development (IISD), the South Center and co-hosted by the Ministry of Development Strategies and International Trade and Board of Investment of Sri Lanka (BOI). ", 
  "title": "IFIN offers considerable potential for investment and capacity building ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/244-ifin-offers-considerable-potential-for-investment-and-capacity-building"
}