{
  "date": "2016-11-11", 
  "text": "The 23rd Bunka (Cultural) Awards ceremony, organized by the Japan Sri Lanka Friendship Cultural Fund, was held on Sunday 6th November at the Sri Lanka Rupavahini Corporation, Colombo 07.Hon. S. B. Navinna, Minister of Internal Affairs, Wayamba Development & Cultural Affairs, graced the occasion as Chief Guest while H. E. Mr. Kenichi Suganuma, Ambassador of Japan, graced the occasion as Guest of Honour. Mr. Shungo Yoshioka, President of the Japanese Solidarity Association of Sri Lanka, Prof. Carlo Fonseka, Co-Chairman of the Fund and other distinguished invitees including members of the diplomatic corps and renowned Sri Lankan artists were also present at this occasion.The Bunka Awards are presented annually by the Fund, which was established in 1993, on the initiative of the Japanese Solidarity Association and the Japanese Commerce and Industry Association in Sri Lanka, in collaboration with the Embassy of Japan. They aim to encourage and promote Sri Lankan artists with artistic remarkable talents in such fields as drama, theatre, dance, music, painting, sculpture, pottery, photography, lyric writing, literature, video animation and visual arts. For the past twenty three years, 124 individuals and organizations received the Bunka Awards for their outstanding creative activities in culture and arts. This year the following five Sri Lankan artistes received the prestigious Bunka Awards (in alphabetical order).At the stage each award winner displayed their versatile talents which had merited their selection.1. Ms. Ruwanthie de Chickera (Theatre)2. Mrs. Sulochna Dissanayake (Puppetry)3. Ms. Kishani Jayasinghe (Music)4. Mr. Vimukthi Jayasundara (Cinema) 5. Dr. S. Jayasankar (Theatre)Moreover, there was a special feature at this years Bunka Awards presentation ceremony, which were the live performances of drumming by the Japanese traditional drum troupe FUKAZAWAGUMI and of dancing by the Japanese traditional dance troupe KIKUNOKAI, both of which are professional performers flown down from Japan with courtesy from the Cathay Pacific Airlines Colombo office.The Bunka Awards presentation ceremony will be telecasted at one of Rupavahini channels shortly for the benefit of the Sri Lankan public.", 
  "title": "FIVE sri lankan artists honoured  with BUNKA (CULTURAL) AWARDS", 
  "url": "https://www.dgi.gov.lk/news/latest-news/261-five-sri-lankan-artists-honoured-with-bunka-cultural-awards"
}