{
  "date": "November 11, 2016", 
  "text": "A bridal show organized by the Small Enterprises Development Division (SEDD) of the Ministry of National Policies and Economic Affairs was held at Sarasi Reception Hall, Walgama, Matara under the patronage of Matara District Secretary, Mr. Pradeep Ratnayake.The event was organized to assess the skills of students who have participated in a three day workshop on bridal dressing and beauty culture, covering all Divisional Secretary's divisions in Matara District, with the association of Vocational Training Centre, Thalalla.The competition comprised of four sections. The Kandyan Bride competition was comprised of two sections and M.M. Maduka Deepali and L.P. Nilupa won its first place. L.P. Iresha won the first place in low country bride competion.First place of Western Bride competition was won by Shanika Perera and Goingaway Bride competition which comprised of two sections was won by K. Nirosha Lasanthi and L.P. Nilupa. Thirty two students have completed the course in 2016 and 43 studernts including members of Bride and Style Association established under the SEDD participate in the competition. Six each first, second and third places have been selected in the competition.All participants were presented presents and certificates. This programme is implemented according to a concept of Mr. Sudeera Jayaratne, Director of SMDD and under supervision and guidance of Mr. P.K. Pathirana, Assistant Director of the SEDD, Organizer of the programme, Enterprise Training Officer Ms. K.A.C. Dilrukshi said.Chief Accountant of the Matara District Secretariat Mr. Ranjith Weerasekara, Matara Divisional Secretary Mr. Ranith Yapa and public officers and beauticians have participated in the event. The programme was sponsored by Dreamron, Bellose, Dev Creations, Stylish and Devendra Trade Centre.", 
  "title": "Bridal Workshop by the Small Enterprises Development Division, Matara", 
  "url": "https://www.dgi.gov.lk/news/latest-news/262-bridal-workshop-by-the-small-enterprises-development-division-matara"
}