{
  "date": "2016-11-12", 
  "text": "Remarks by Dr. Harsha de Silva, Deputy Minister of Foreign Affairs at Regional Consultations on Transitional Justice in Asia-Pacific. (Hilton Colombo, 9 November 2016) It is a pleasure to be here with you this morning, and I extend to all of you, a very warm welcome to Sri Lanka.I understand that this meeting brings together State representatives, representatives of transitional justice mechanisms, national human rights institutions, NGOs, victims groups, UN officials, and representatives of regional organizations from the Asia-Pacific region to discuss and share experiences on transitional justice processes in the region.I was informed that in accordance with the mandate given by the Human Rights Council to the Special Rapporteur, he was requested by the Council to gather relevant information on national situations, including on normative frameworks, national practices and experiences; identify, exchange and promote good practices and lessons learned; and recommend ways and means to improve and strengthen the promotion of truth, justice, reparation and guarantees of non-recurrence.Accordingly, regional consultations have so far been held for the Middle East and North Africa, Latin America and the Caribbean, Africa, and Europe and North America. The region of the Asia-Pacific is the last on the list.I feel that we are fortunate that by accident or by design, the consultations for the Asia-Pacific was kept to be done last, giving us this wonderful opportunity to welcome not only Mr. Pablo de Greif, but all of you, to Sri Lanka. As you all know, since the election of President Maithripala Sirisena in a historical Presidential election last January, Sri Lanka has embarked on a process of reconciliation. The two main political parties in Sri Lanka  the Sri Lanka Freedom Party led by President Sirisena and the United National Party led by Prime Minister Ranil Wickremesinghe have come together to forge a Government of National Unity. This is a step that is unprecedented in our nations history. In the words of President Sirisena in his inaugural address to Parliament following the General Election last August, this was a necessary step to obtain the bipartisan consensus that is required to face the important challenges before our nation, which include reconciliation and peacebuilding.Therefore, Ladies and Genetlemen, this is an important moment in our history. We have acknowledged and recognised the need for reconciliation and the important contribution that transitional justice can make to this process of healing. Sri Lankas co-sponsorship of Resolution 30/1 titled Promoting reconciliation, accountability and human rights in Sri Lanka is a manifestation of our strong commitment to this process.Several initial steps in this long journey that we have embarked upon have been taken already. This includes the setting up, through an Act of Parliament, an Office on Missing Persons which is a component of the truth-seeking process. The legislation for this was enacted in August and the procedural steps for its establishment including the nomination of members by the Constitutional Council are now underway. A Task Force was appointed early this year, by the Government, comprising members of civil society, to hold public consultations, involving all stakeholders, to seek their views on the mechanisms for truth-seeking, justice and reparations. This important process of national consultations has just concluded and the Task Force is scheduled to hand over their report to the President and the Prime Minister, this month. The designing of the truth-seeking, justice and reparations mechanisms will be informed by the report of this Task Force.At the same time, we have undertaken a process of constitutional reform. A Resolution for the Parliament to sit as a Constitutional Assembly for this purpose was passed unanimously by our Parliament. The various drafting committees are presently at work.Ladies and Gentlemen,The processes that are underway here are in fact too numerous to list out and what I listed out are just a few.For this process in Sri Lanka to be successful, we have to also ensure that the people of our country receive a quick economic peace dividend, and this is also an area on which we are focusing significant attention at the moment.As contexts differ and there are no cookie-cutter models that can be adopted in sensitive processes such as transitional justice, this is a journey that our nation has to undertake and chart on its own. Yet, we cannot afford to experiment or make mistakes. Therefore, we rely on technical expertise as well as advice, and Pablo and the OHCHR officers have been excellent partners to us in our journey.We have a long way to go and I am sure we have a lot to learn from best practices elsewhere. This is probably true for a lot of you here as well. Reconciliation is not a box that can be ticked or a journey that can end as per a timeline. There are no magic portions to achieve what we set out to achieve. It requires hard work and constant striving, and a commitment towards which our nation should be bound across generations. National building and healing are not tasks that have an end. This, we understand; and we want to ensure that after so many years of conflict, our nation does not plunge into conflict once again. So with this aim in mind, we set out on pursuing transitional justice to build a nation which respects and upholds the rights of each and every individual citizen of our country.I wish your deliberations all success, and I hope that while you are here, you would also find the time to enjoy Colombo and Sri Lanka", 
  "title": "Deputy Minister at Regional Consultations on Transitional Justice in Asia-Pacific", 
  "url": "https://www.dgi.gov.lk/news/latest-news/268-deputy-minister-at-regional-consultations-on-transitional-justice-in-asia-pacific"
}