{
  "date": "November 16, 2016", 
  "text": "There are barriers, not only around corrupters but also around all our goals for a better country. But I have the self confidence and courage to win all of them, says President Maithripala Sirisena.The President made these remarks at the intellectual discussion held today (Nov. 15) at the BMICH to mark 30th Anniversary of the Ravaya Newspaper.I always face many a criticism by the media including Ravaya Newspaper. It is the wish of Ravaya as well as mine to make ours a beautiful country which wins everyones love and trust. It will be easy to go on the journey towards fulfilling that objective, with cooperation and understanding, he said. I was severely criticized by Victor Ivan and long term friends when I undertook the Presidency of the SLFP. But we cannot underestimate the support given by it to fulfill the objectives of the government of the good governance, including the passing of the 19th Amendment to the Constitution, the President said.He said the Hundred Days Program was handed over to him after January 08, with a Parliament of opposition-majority. My Presidency at the SLFP was helpful to win that challenge, he pointed out.Although there was criticism over the appointment of SLFP MPs to the Parliament through the National List, those SLFP members lost in the election because of an organized plan carried out by the former leaders to defeat them. I appointed them to Parliament because I wanted a group of trusted persons to carry out my policies, he said.President Sirisena handed over the awards and prizes to the winners of youth competitions held by the Ravaya newspaper to mark the 30th Anniversary. Prime Minister Ranil Wickremesinghe, Opposition Leader R Sambanthan, SLMC leader Rauff Hakeem, JVP leadr Anura Kumara Dissanayake and Editorial Adviser of Ravaya, Victor Ivan also addressed the gathering.Media Minister Gayantha Karunatilake, Deputy Minister Karunaratne Paranawithana, Ministers, MPs, newspaper publishers and editors and media personnel were among the large gathering attended the Anniversary meeting.", 
  "title": "I possess the self-confidence and strength to win over challenges to January 8 principles  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/274-i-possess-the-self-confidence-and-strength-to-win-over-challenges-to-january-8-principles-president"
}