{
  "date": "2016-11-24", 
  "text": "A free, independent and diverse media with high ethical standards and professional competence, dedicated to provide a wide range of information and ideas to citizens, while serving as a public forum for well-informed democratic dialogue, is indispensable for the building and maintaining of democracy in Sri Lanka. The government is committed to creating an enabling environment for the media sector which is based on respect for internationally recognised professional standards and practices, and which ensures media accountability to those who rely on the media as a credible source of news and information.The government has examined the comprehensive assessment of the overall environment for media development as set out in the report Rebuilding Public Trust: An Assessment of the Media Industry and Profession in Sri Lanka, which was presented to the Hon. Prime Minister on 3 May, World Press Freedom Day, 2016 by the multi-stakeholder partnership for media reforms. The report contained a set of evidence-based recommendations developed through a multi-stakeholder consultative process and based on UNESCOs widely accepted Media Development Indicators.Similarly, the recently concluded International Conference on RTI Sri Lanka and Media Reforms also deliberated several challenges of the media sector while making some cardinal recommendations.Some of the key recommendations of the report as well as the international conference require the adoption of enabling legislation. Based on this, the government wishes to undertake a consultation with all interested stakeholders on the measures needed to provide adequate legal protection for journalists and to strengthen systems for media self-regulation.The government is ready to ensure legal protection for freedom of the press, including by protecting the medias right to gather news and information, by repealing the SriLankaPress CouncilAct, No 5 of 1979, and by introducing an independent oversight mechanism to foster professional standards, with mandatory powers over media outlets.In this regard, the government invites the views of interested stakeholders in relation to its proposals to introduce legislation:1. To recognise media freedom and the right of the media: (a) to gather and disseminate news and information; (b) to engage in critical reporting on matters of public interest; and (c) to participate in the process of forming public opinion.2. To make it a penal offence for anyone wilfully to obstruct the legitimate collection of news and information by a journalist working for a media outlet.3. To put in place systems to promote the safety of journalists.4. To protect journalists right to not to disclose their confidential sources of information.5. To make it a penal offence to subject anyone to anylegaloremploymentrelatedsanctionorotherformof discriminationforproviding informationto journalistsworking foramediaoutletconcerning publicaffairsoronmattersofpublicinterest,exceptwherethe secrecyof theinformation is justified byalarger publicinterest.6. To make it illegal to impose sanctions on or to terminate the employment of an editor or a journalist because of his or her refusal to violate recognised professional codes of practice.7. To establish an independent Council with a mandate to develop and apply codes of practice for media outlets, based on internationally recognised standards for the media.The proposed Council will function as the oversight mechanism of a system of self-regulation and will the power to apply sanction for wilful violations of its codes of practice. The approaches towards ensuring the independence of the Right to Information Commission will also be applicable to the Council, which will comprise eminent persons of whom two-thirds are nominated by organisations representing the media and journalists and one-third are nominated by civil society organisations. To ensure the credibility of and the public confidence in the Council, a Judge of a court of law nominated by the Judicial Services Commission in consultation with the Bar Association of Sri Lanka will serve as Chairperson. The tenure of Council members will be protected and, in particular, removal will only be possible by vote of Parliament following a recommendation of the Constitutional Council.The functions and powers of the Council will include the following:a. Adopt professional Codes of Practice,followingapublic consultation involving journalists and editors associations, media unions and civil society.b. Monitor theperformanceofmedia outletstoensureduecompliancewith the Codes of Practice.c. Hold inquiries into alleged violations of theCodes of Practicebased on complaints or the monitoring ofthe Council,and issuedecisions.d. Conduct public consultationstoassess thepublicperception ofmedia outlets compliancewith the Codes of Practice.e. Maintain a database of information on registered media entities.f. Co-operate with or undertaketrainingandeducational activities, including by producing trainingmaterials on the effective implementation oftheCodes of Practice.g. Exercise powers which are similar to those wielded by the Right to Information Commission in terms of conducting inquiries, with provisions for appeals to the courts against the Council's decisions.h. In terms of sanctions, the Council will have the power to issue warnings to media outlets and to order amedia outlet to publish or broadcast the Councils decision in the manner prescribed bytheCouncil.i. Mediate between employersand employees ofmedia outlets in relation to disputes concerningtheenforcement of theCodesof Practice.The proposed legislation will be applicable to all print and broadcast media outlets, as well as to online media outlets which formally agree to comply with the Codes of Practice.It shall be an offence for any media outlet to refuse to comply with or to give effect to a decision of the Council, which may be punished by the imposition of a fine after a summary trial before a court of law. Similarly, obstructing the legitimate collection of news and information by a journalist, forcing a journalist to disclose a confidential source of information or discriminating against a journalist who refuses to violate the Codes of Practice will be offenses.The government invites media organisations, owners and publishers associations, journalists unions and associations, civil society organisations and members of the public to express their views on this proposal. Please send your views in writing to the address given below before 31st December 2016.Director General  Government Information Department (On behalf of the Secretary to Ministry of Parliamentary Affairs and Mass Media)No 163, Kirulapana Mawatha,Colombo 05.Email :This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak93c2967c395b188378dd2c1c248642f8').innerHTML = ''; var prefix = '&#109;a' + 'i&#108;' + '&#116;o'; var path = 'hr' + 'ef' + '='; var addy93c2967c395b188378dd2c1c248642f8 = 'r&#97;ng&#97;' + '&#64;'; addy93c2967c395b188378dd2c1c248642f8 = addy93c2967c395b188378dd2c1c248642f8 + 'dg&#105;' + '&#46;' + 'g&#111;v' + '&#46;' + 'lk'; var addy_text93c2967c395b188378dd2c1c248642f8 = 'r&#97;ng&#97;' + '&#64;' + 'dg&#105;' + '&#46;' + 'g&#111;v' + '&#46;' + 'lk';document.getElementById('cloak93c2967c395b188378dd2c1c248642f8').innerHTML += '<a ' + path + '\\'' + prefix + ':' + addy93c2967c395b188378dd2c1c248642f8 + '\\'>'+addy_text93c2967c395b188378dd2c1c248642f8+'<\\/a>'; Fax: 0112514753November 23, 2016", 
  "title": "Media standards and entitlements - (A discussion note for public consultation)", 
  "url": "https://www.dgi.gov.lk/news/latest-news/302-media-standards-and-entitlements-a-discussion-note-for-public-consultation"
}