{
  "date": "2016-11-28", 
  "text": "It was with profound sadness that I learnt of the passing away of His Excellency Fidel Castro Ruz, former President of the Republic of Cuba and an iconic revolutionary of the twentieth century, states Maithripala Sirisena in a condolence message Cuban President Raul Castro.On behalf of the Government and People of Sri Lanka, I extend my deepest condolences to Your Excellency, the Government and People of the Republic of Cuba and members of late President Castros family, at this time of national mourning.Late President Castro was an exemplary leader who dedicated his entire life and career to promoting the wellbeing of his people and development of Cuba in the face of formidable external challenges. Through these efforts, Cuba carved a niche in the world for its achievements in education and healthcare. Sri Lanka along with many countries in Asia, Africa and Latin America, continue to benefit from the advances Cuba had made in these areas.Sri Lanka and Cuba enjoy a longstanding friendship, based on our shared values within the Non-Aligned Movement and vision of human development. A strong sense of solidarity has also followed our friendship. Indeed, Sri Lanka has also lost a sincere friend in the passing away of this remarkable leader and we join the people of Cuba in mourning this irreplaceable loss.Please accept, Excellency, the assurances of my highest consideration.Maithripala Sirisena,President of the Democratic Socialist Republic of Sri LankaSri Lanka has lost a sincere friend: PMIt was with profound sadness that I learnt of the passing away of His Excellency Fidel Castro Ruz, former President of the Republic of Cuba and an iconic revolutionary of the twentieth century. On behalf of the Government and People of Sri Lanka, I extend my deepest condolences to Your Excellency, the Government and People of the Republic of Cuba and members of late President Castros family, at this time of national mourning. Late President Castro was an exemplary leader, who dedicated his entire life and career to promoting the wellbeing of his people and development of Cuba in the face of formidable external challenges. Through these efforts, Cuba carved a niche in the world for its achievements in education and healthcare. Sri Lanka along with many countries in Asia, Africa and Latin America, continue to benefit from the advances Cuba has made in these areas. Sri Lanka and Cuba enjoy a longstanding friendship based on our shared values within the Non-Aligned Movement and vision of human development. A strong sense of solidarity has also followed our friendship. Indeed, Sri Lanka has also lost a sincere friend in the passing away of this remarkable leader and we join the people of Cuba in mourning this irreplaceable loss. Please accept, Excellency, the assurances of my highest consideration.Ranil WickremesinghePrime Minister of Democratic Socialist Republic of Sri Lanka(Courtesy  Ceylon Daily News)A revolution is a struggle to the death between the future and the past. Fidel CastroMy heartfelt sympathies to the people of Cuba on the demise of their great leader, Commander Fidel Castro. The former Cuban leader who stood by his principles and convictions and led the people of Cuba for more than 50 years. He championed the revolutionary movement in 1959 and stood as one of the towering figures of the people of Cuba.During his Leadership, Fidel Castro brought a transformation to the people in Cuba especially to those who lived in extreme poverty. While focusing on the development and the wellbeing of his people Castro will also be remembered by some of the poorest countries in Africa for his support towards them.There were many movements and individuals who were inspired by this great leader of Cuba across the world, including people who did not assent to his ideologies. There is no doubt that for most Cubans, Castro has been the ubiquitous figure of their entire life.At this time of sorrow, I wish and pray that Fidel Castors dream for Cuba and its people become a reality.R. SampanthanLeader of the Opposition  Parliament of Sri LankaLeader of the Tamil National AllianceIconic revolutionary of the twentieth century: President ", 
  "title": "Condolence Messages for Fidel Castro", 
  "url": "https://www.dgi.gov.lk/news/latest-news/311-condolence-messages-for-fidel-castro"
}