{
  "date": "November 28, 2016", 
  "text": "Minister for Health, Nutrition and Indigenous Medicine, Hon. Rajitha Senarathne and the High Commissioner of Pakistan in Sri Lanka Maj. Gen. (R) Syed Shakeel Hussain jointly inaugurated Pakistans Food, Shopping and Cultural Festival with Painting and Photographic Exhibition at Waters Edge Hotel on 27th November 2016.The event was attended by several important personalities from the Sri Lankan business and trade sectors along with Sri Lanka based diplomatic corps and a large number of people from different walks of life. The exhibition will remain open until 29th November 2016 for visitors.The High Commissioner speaking on the occasion, said that Pakistan has a rich cultural diversity as the country is largely multilingual, multi-ethnic and multicultural. The primary aim to organize the festival is to introduce rich Pakistani food, diverse goods and commodities being produced in Pakistan to the Sri Lankan people, he added. He further emphasized that such exhibitions will not only promote the soft image of the country but also promote the national talents in the field of paintings, photography and other forms of art at the international level. H.E. Shakeel reiterated that the Government of Pakistan is making all out efforts to multiply the volume of two-way trade between the two regional countries.On the occasion, Minister for Health, Nutrition and Indigenous Medicine, Hon. Rajitha Senarathne said that exhibitions and festivals are a proven tool to promote bilateral trade and economic relations between the two countries. He said that large participation of Sri Lankan public in the festival is enough to make the point that the people of Sri Lanka are great lover of Pakistani products and food.The Festival in the vibrant city of Colombo would be remembered for a long time. Pakistani cuisine is a specialty of the event as Sri Lanka has a big majority of eastern food lovers and Pakistani food and its taste is not new to their taste buds. Painting and Photographic Exhibition is also a component of this colourful Festival. The Exhibition is showcasing masterpieces of famous Pakistani painters and photographers who specially flown to Sri Lanka to highlight the real image of Pakistan. Pakistani instrumentalists are keeping the visitors spell bound and the visitors are seen enjoying.The Festival is also displaying Pakistani quality products including home textiles, footwear, garments and apparel, handicrafts, traditional food, rice, fashion wear etc.Concurrently, the High Commissioner and the Minister for Health attended an induction ceremony of Dr. Lakkumar Fernando as the new President of Sri Lanka College of Pediatrician. The congratulatory video message of Pakistans Chief Minister of Punjab Province, Muhammad Shahbaz Sharif was also played on the occasion. Through video message, Chief Minister Punjab not only congratulated D. Lakkumar Fernando as being inducted as new President of the college, but also paid gratitude for the services he rendered along with a team of Sri Lankan doctors to control Dengue outbreak in Punjab Province in 2010-2011. The speech was greatly appreciated by the audience and host of the ceremony requested the High Commissioner to convey the sentiments to the Chief Minister.", 
  "title": "Pakistan has a rich cultural diversity as the country is largely multilingual, multi-ethnic and multicultural: H.E. Shakeel   ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/314-pakistan-has-a-rich-cultural-diversity-as-the-country-is-largely-multilingual-multi-ethnic-and-multicultural-h-e-shakeel"
}