{
  "date": "2016-11-29", 
  "text": "Finance Minister Ravi KarunanayakeNo subsidy or other welfare facility that have been increased for the people after this government came in to power has been slashed or removed. Despite huge allocations made for development projects in the Budget 2017, Rs.403 billion has been allocated for subsidies and welfare expenditures. This is an increase of Rs.143 billion when compared with Rs.260 billion allocated in 2014.After Finance Minister presented Budget 2017 in Parliament on November 10, the Finance Ministry has observed that certain politicians who partake in post-budget discussions and debates on audio and visual media and at the Press Conferences make baseless allegations to portray that the current government has cut back the public subsidies and welfare payments.None of the allocations already made available for subsidies on fertilizer, Samurdhi and school uniforms has been reduced. In-fact the payment for school uniforms are now being distributed to students at schools without any haphazard. The replacement of giving fertilizer at subsidized price and school uniforms to students with cash payment has not only brought the advantage of bringing down the use of chemical fertilizer but also streamlined the process with efficiency eliminating the middlemen whereby reducing the cost incurred on fertilizer and school uniforms. The special interest rate paid for the first Rs.1.5 million fixed deposit by senior citizens and Rs.2000 monthly payment for needy senior citizens introduced in 2015 after this government came in to power has not been reduced or removed as certain opposition politicians try to mislead the people.This government, for the first time in history, started to pay a higher interest rate for the deposits on senior citizens saving accounts in 2015. Rs.1, 450million and Rs.4000 million were allocated for this purpose by Budget 2015 and Budget 2016 respectively. It has been reported that expecting higher dividends, more and more retired senior citizens have deposited their pension funds in commercial banks. Therefore, in order to meet this increased demand to pay the higher interest rate to senior citizens the treasury of the Finance Ministry has allocated Rs.8000 million for 2017. In the meantime the Rs.20, 000 being paid for expectant mothers for a POSHANA MALLA over a period of 10 months is also being distributed without any curtailment.The present government of good governance, as it pledged, increased the Samurdhi allowance in 2015. Allocation made to pay Samurdhi allowance in 2014 was Rs.15 billion and, it has been increased up to Rs.44 billion in 2017. The minimum Samurdhi allowance paid in 2014 was minimum of Rs.210 and the maximum was Rs.1, 500. It has now been increased to a minimum payment of Rs.420 and a maximum payment of Rs.3, 500.Since the President has declared 2017 as the year of poverty eradication, the fertilizer subsidy that has been granted for paddy has been extended to cover tea, rubber and coconut from next year in order to uplift the agricultural economy. Additional Rs.1, 500 million has been allocated for this purpose in the Budget 2017. At the same time, a new subsidy scheme has been introduced from 2017, with the allocation of another Rs.450 million to give subsidy for domestic milk powder manufacturers as part of making the country self sufficient in milk.Meanwhile, the Finance Ministry has established a Welfare Beneficiary Board to ensure that the subsidies and welfare payments are being given to the needy and actual beneficiaries without being duplicated. This particular monetary board has been preparing a data base incorporating the particulars of the beneficiaries of all kind of subsidies welfare paymentsFinance Minister Ravi KarunanayakeNo subsidy or other welfare facility that have been increased for the people after this government came in to power has been slashed or removed. Despite huge allocations made for development projects in the Budget 2017, Rs.403 billion has been allocated for subsidies and welfare expenditures. This is an increase of Rs.143 billion when compared with Rs.260 billion allocated in 2014.After Finance Minister presented Budget 2017 in Parliament on November 10, the Finance Ministry has observed that certain politicians who partake in post-budget discussions and debates on audio and visual media and at the Press Conferences make baseless allegations to portray that the current government has cut back the public subsidies and welfare payments.None of the allocations already made available for subsidies on fertilizer, Samurdhi and school uniforms has been reduced. In-fact the payment for school uniforms are now being distributed to students at schools without any haphazard. The replacement of giving fertilizer at subsidized price and school uniforms to students with cash payment has not only brought the advantage of bringing down the use of chemical fertilizer but also streamlined the process with efficiency eliminating the middlemen whereby reducing the cost incurred on fertilizer and school uniforms. The special interest rate paid for the first Rs.1.5 million fixed deposit by senior citizens and Rs.2000 monthly payment for needy senior citizens introduced in 2015 after this government came in to power has not been reduced or removed as certain opposition politicians try to mislead the people.This government, for the first time in history, started to pay a higher interest rate for the deposits on senior citizens saving accounts in 2015. Rs.1, 450million and Rs.4000 million were allocated for this purpose by Budget 2015 and Budget 2016 respectively. It has been reported that expecting higher dividends, more and more retired senior citizens have deposited their pension funds in commercial banks. Therefore, in order to meet this increased demand to pay the higher interest rate to senior citizens the treasury of the Finance Ministry has allocated Rs.8000 million for 2017. In the meantime the Rs.20, 000 being paid for expectant mothers for a POSHANA MALLA over a period of 10 months is also being distributed without any curtailment.The present government of good governance, as it pledged, increased the Samurdhi allowance in 2015. Allocation made to pay Samurdhi allowance in 2014 was Rs.15 billion and, it has been increased up to Rs.44 billion in 2017. The minimum Samurdhi allowance paid in 2014 was minimum of Rs.210 and the maximum was Rs.1, 500. It has now been increased to a minimum payment of Rs.420 and a maximum payment of Rs.3, 500.Since the President has declared 2017 as the year of poverty eradication, the fertilizer subsidy that has been granted for paddy has been extended to cover tea, rubber and coconut from next year in order to uplift the agricultural economy. Additional Rs.1, 500 million has been allocated for this purpose in the Budget 2017. At the same time, a new subsidy scheme has been introduced from 2017, with the allocation of another Rs.450 million to give subsidy for domestic milk powder manufacturers as part of making the country self sufficient in milk.Meanwhile, the Finance Ministry has established a Welfare Beneficiary Board to ensure that the subsidies and welfare payments are being given to the needy and actual beneficiaries without being duplicated. This particular monetary board has been preparing a data base incorporating the particulars of the beneficiaries of all kind of subsidies welfare payments", 
  "title": "None of subsidies or welfare payments slashed under budget 2017 ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/318-none-of-subsidies-or-welfare-payments-slashed-under-budget-2017"
}