{
  "date": "November 30, 2016", 
  "text": "The Minister of Foreign Affairs and Emigrants, Minister Gebran Bassil, Secretary General to the Ministry of Foreign Affairs Ambassador Wafiq Rahimi, Director General of the Protocol to the Presidential Palace, Laoud Lahoud, Director of Protocol to the Foreign Ministry, Ambassador Mira Daher Viulides were also present.The Ambassador was accompanied by the senior diplomatic officials of the Embassy, Deepal Premaratne, Counsellor (E&W), Mrs. Kumari Jayaratne, Counsellor (Labour) and Mrs. Sriyani Pathirana (Attach).During the discussion followed the presentation of credential, the President referred to the presence of Sri Lankan expatriate community in Lebanon and appreciated their contribution to the development of Lebanon. He proposed a toast to the friendly relation between two countries and the prosperity of the people where the Ambassador reciprocated by extending warmest felicitations and good wishes from Maithreepala Sirisena, President of Sri Lanka and Prime Minister Ranil Wickremesinghe to the President and friendly people of Republic of Lebanon. She also reiterated her firm commitment to enhance close and cordial bi-lateral relations exists between two countries during her tenure as Ambassador. Ambassador Mrs. Wijeratne Mendis has 20 years experience of Sri Lanka Foreign Service and obtained her Masters in Advanced International Relations from the University of Vienna and the Post Graduate Degree in International Relations from the Diplomatic Academy of Vienna. She has obtained her Bachelors Degree in General Arts from University of Colombo. She was a past student of Holy Family Convent, Kurunegala and Mahamaya College, Kandy. Prior to her present appointment, she has served in Sri Lanka Missions in Hague-Netherlands, Vienna-Austria, Yangon-Myanmar, Abudabi-UAE, and Manila- the Philippines. She is married to D. A. D. Mendis, Attorney at Law and has two twin daughters Bindya Mendis and Bimansa Mendis.Ambassador of Sri Lanka to the Republic of Lebanon, Reethisri Rakthiya Kumari Wijeratne Mendis presented Credential to the, President of the Republic of Lebanon Michel Aoun at the Official Residence of the President (Baabda Palace) in Beirut on Wednesday 16th November 2016. The Minister of Foreign Affairs and Emigrants, Minister Gebran Bassil, Secretary General to the Ministry of Foreign Affairs Ambassador Wafiq Rahimi, Director General of the Protocol to the Presidential Palace, Laoud Lahoud, Director of Protocol to the Foreign Ministry, Ambassador Mira Daher Viulides were also present.The Ambassador was accompanied by the senior diplomatic officials of the Embassy, Deepal Premaratne, Counsellor (E&W), Mrs. Kumari Jayaratne, Counsellor (Labour) and Mrs. Sriyani Pathirana (Attach).During the discussion followed the presentation of credential, the President referred to the presence of Sri Lankan expatriate community in Lebanon and appreciated their contribution to the development of Lebanon. He proposed a toast to the friendly relation between two countries and the prosperity of the people where the Ambassador reciprocated by extending warmest felicitations and good wishes from Maithreepala Sirisena, President of Sri Lanka and Prime Minister Ranil Wickremesinghe to the President and friendly people of Republic of Lebanon. She also reiterated her firm commitment to enhance close and cordial bi-lateral relations exists between two countries during her tenure as Ambassador. Ambassador Mrs. Wijeratne Mendis has 20 years experience of Sri Lanka Foreign Service and obtained her Masters in Advanced International Relations from the University of Vienna and the Post Graduate Degree in International Relations from the Diplomatic Academy of Vienna. She has obtained her Bachelors Degree in General Arts from University of Colombo. She was a past student of Holy Family Convent, Kurunegala and Mahamaya College, Kandy. Prior to her present appointment, she has served in Sri Lanka Missions in Hague-Netherlands, Vienna-Austria, Yangon-Myanmar, Abudabi-UAE, and Manila- the Philippines. She is married to D. A. D. Mendis, Attorney at Law and has two twin daughters Bindya Mendis and Bimansa Mendis.", 
  "title": "Ambassador to Lebanon presents Credentials ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/319-ambassador-to-lebanon-presents-credentials"
}