{
  "date": "2016-11-30", 
  "text": "The Government announces that it will enforce the law strictly against persons who stormed into the opening of the multi-purpose building at Mawaramandiya, Biyagama and behaved in a disruptive manner. The building was constructed under provisions allocated under the Puraneguma project of the Ministry of Provincial Councils and Local Government. It was to be opened under the patronage of Provincial Councils and Local Government Minister Faiser Mustapha, State Minister for Defence Ruwan Wijewardene, Western Province Chief Minister IsuraDevapriya. A group of persons who stormed into the premises beforehand had tried to open it indiscriminately. Former Chairman of the Biyagama Pradeshiya Sabha and few of its members have been the leaders of that group.They have entered the premises without permission and damaged public property at a time when the Pradeshiya Sabha was dissolved. Thus their conduct and disruptive activities also constitutes a case of unlawful assembly. It was officials of the Biyagama Pradeshiya Sabha who had arranged the opening of the building. Former Chairman and members of the Pradeshiya Sabha have actually obstructed those officials in the performance of their duty. Hence the Police will take legal action against the former Chairman and members of the Biyagama Pradeshiya Sabha for causing damage to public property, unlawful assembly and causing obstructions to public officials in carrying out their duties.It has already been revealed by now that certain national level politicians have given their blessings and instigated these people to sabotage the official procedure to be followed when a public property is being handed over to the public. They who never cease repeating that democratic governance in the country has broken down are cunningly plotting anti-democratic activities. These political leaders rejected by the people try to create unlawful disturbances in the country. Their third degree political endeavors to obtain media publicity are further illustrated by their attempts to create various disturbances by provoking the people and claiming media is being suppressed. Such attempts to obstruct the present governments effort to create a decent political culture instead of the indecent culture that existed under the former regime goes counter to the aspirations of the people. Hence the Government has given instructions to the Police and other law enforcing agencies to apply the law strictly whenever any group of persons that tries to create disturbances and behave in a disruptive manner as they behaved at Mawaramandiya, Biyagama.", 
  "title": "Legal action against those who created disturbance in Biyagama", 
  "url": "https://www.dgi.gov.lk/news/latest-news/324-legal-action-against-those-who-created-disturbance-in-biyagama-2"
}