{
  "date": "December 01, 2016", 
  "text": "The world today is not governed by monarchy, but it has a true democratic system. Therefore, the politicians who take the leadership in this context should always have the qualities of democracy, said President Maithripala Sirisena. The President was speaking at the felicitation ceremony for the former Minister Raja Samaranayake, held yesterday (Nov. 30) at the Maithri Hall in Bandaragama.Though the power comes hand in hand with corruption, it is the corruption free magnanimous politician who will be honored by the people. The former Minister Raja Samaranayake is a good example for such a politician, the President said.Through the felicitation for the ideal political characters like Raja Samaranayake, the government expects to respect those characters as well as recall the examples can be taken from them to the contemporary politicians, he further said.Raja Samaranayake who is a corruption free, honest, efficient and exemplary leader entered into active politics according to an invitation from late Dudley Senanayake. He, who contested for Bandaragama Electorate from UNP in 1977, was elected to the Parliament with 28,097 votes. Raja Samaranayake who was appointed as the Deputy Minister of the Industry and Technological Affairs, re-elected to the Parliament at the Parliamentary election held in 1989 receiving 36,150 preferential votes.Following the election he was appointed as the State Minister of Trade and later appointed as the Minister of Export Development.He was the pioneer in the mammoth effort of transforming the Bandaragama into a modern city through developing many sectors including education, irrigation and electricity. He played a focal role in implementing many development projects like establishing a Central College in Bandaragama, turning the Maternity Hospital into a District Hospital, building of new roads, building Sathosa outlets and constructing more than 1,500 houses.He was a true gentleman politician and Raja Samaranayake gave his ancestral lands and properties to the Government to build institutions to fulfill needs of the public.The President also presented a felicitation award to Raja Samaranayake during the ceremony.Speaker Karu Jayasuriya, Ministers Kabir Hashim, Navin Dissanayake, Deputy Minister Ajith P. Perera, Parliamentarian Malith Jayathilake, family members of Raja Samaranayake and many others participated at this event.", 
  "title": "Former Minister Raja Samaranayake felicitated ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/327-former-minister-raja-samaranayake-felicitated"
}