{
  "date": "December 02, 2016", 
  "text": "President Maithripala Sirisena said the present need in the island is not for political heroes but individuals who can solve the countrys issues in a just manner.The President made this observation joining the Committee Stage debate on the budget proposal for financial year 2017 under the financial head of the National Integration and Reconciliation Ministry in Parliament. He said that the politicians attempting to become so-called patriots and heroes have never attempted to find solutions to genuine issues of the people. He pointed out that these politicians who create problems in the country aiming at votes are committing a national crime that would affect the future generation.President Sirisena said at a time when the government was attempting to bring about a new constitution to solve issues in the country, he was willing to invite politicians, scholars and the intelligent people of the country to join hands to make the endeavour a success.If we cannot strengthen reconciliation among all communities it is a massive disaster, President Sirisena said. The root cause of many of the wars, conflicts and bloodshed in world history has been mostly language, religious, racial and cast differences.He said the issue in Sri Lanka has not been something new, but dates back to ages. Every politician who came to power after independence used this issue to come into power. The conflict worsened and the development in the North stagnated, the President said. However we can see how the North and East was treated by the number of ministerial portfolios given to politicians hailing from those areas.The President said Black July aggravated the conflict and the conflict claimed peoples lives and even resulted in the attack on the Temple of the Tooth Relic in Kandy.Once President J.R. Jayewardene attempted to solve the issue through the Indo- Lanka agreement but failed, President Sirisena said. Even today around 100,000 people are living in camps in India as a result of this issue. Even I have been leveled threats at several occasions because of this issue. Nobody has been able to suppress the opinion of dividing the country by the gun. The then government did not attempt to bring about a lasting peace exploiting the victory achieved by the tri forces.He added that the lasting peace could be established in Sri Lanka on the day when the concept of Eelam was given up locally and internationally.We are attempting to introduce a new constitution, said President Sirisena. Discussions are made in that direction and some are trying to point out that the government is attempting to divide the country. They spread baseless rumours among the Sinhalese and the Buddhists. If we could not solve the issue, those spreading false rumours should take the responsibility for the unfortunate incidents that could happen in the future.He said the new constitution would include a solution that all Sinhalese, Tamils and Muslims would accept.President Sirisena said he was ashamed of what the former President said on the constitution that it is to be formulated.He said it was the former President who proposed to even grant more powers than the 13th amendment to the constitution.He said there should be a fair devolution of power. The best representative from the North in solving this issue is with us, he is R. Sampanthan, said the President.Finding solutions should not be delayed. When we attempt to solve the issues of the people who lost their houses and land, some say we are dividing the country, he said.We need a mechanism that would bring about lasting peace and reconciliation among the communities. We are not solving the issues by the gun as ours is a harmless government. Everyone should join hands with us to find a solution.The President said patriotism, humanism, creating a healthy society, freedom, democracy, must contribute to a just society. President Sirisena said seeking power instead of solving issues will not help towards addressing the issue at hand.Maithripala Sirisena added if a country does not have national unity, then that too is considered a national disaster. The President added the Ministry of Disaster Management mainly addresses concerns that arise as a result of natural disasters.However the President added a country that has no national peace, unity and reconciliation, especially if unity among ethnicities does not exist, then that is also considered a national disaster.", 
  "title": "Need of the hour is leaders who can find just solutions  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/333-need-of-the-hour-is-leaders-who-can-find-just-solutions-president"
}