{
  "date": "December 05, 2016", 
  "text": "Motor traffic accidents have reduced by 10 percent during the last two weeks with the announcement of heavy traffic fines on motorists, Police said. According to the Traffic Police Division ASP W. D. A. Dhananjaya, the number of traffic accidents reported daily was around 100-125 and has now reduced to 90 to 100 incidents. About 40-50 out of them are reported as serious accidents.In 2015, more than 40, 000 accidents were reported to the Police. Out of them, 2,799 were fatal accidents while 15,000 were critically injured.According to police records, seven to eight persons died in road accidents in 2015/2016 which is an increase compared to 2014.However, the number of deaths due to road accidents has dropped during the last one and half months to around five to six per day. The Police pointed out that this drop is the result of the new rules and regulations introduced by the government to curb the number of road accidents.The daily statistics on victims hospitalized due to road accidents to the Colombo National Hospital Accident Ward has also reduced from 22 percent to 18 percent, National Coordinator of Training and team leader of Triage and Information Unit of National Hospital, Colombo, Pushpa Ramyani Zoysa said.Meanwhile the Motor Traffic Department officials highlighted the increase of the number of people coming to their Werahera branch office to obtain the driving license during the last few days.According to the Finance Minster Ravi Karunanayake, the transformation taking place due to the new rules and regulations introduced by the government is a great victory from the point of view of the public. The government is determined to ensure public safety and will not waver on its stand in this regard and give in to unreasonable demands of certain groups.The government is thankful to the public for supporting it on these rules and regulations, Minister added.", 
  "title": "Road accidents reduce with new traffic fine  Police", 
  "url": "https://www.dgi.gov.lk/news/latest-news/336-road-accidents-reduce-with-new-traffic-fine-police"
}