{
  "date": "December 07, 2016", 
  "text": "On behalf of the President, the Government and the people of Sri Lanka, Ambassador Sarath Dissanayake also paid his respect to the late Cuban President at the Jose Marti Memorial in the Revolution Plaza, in capital Havana where the remains of the late President was kept for the public to pay their condolences. He was accompanied by his wife and the Attach of the Mission.The Ambassador signed the condolence book at the Jose Marti Memorial. In his message of condolence, Ambassador Dissanayake, conveyed his deepest condolences and heartfelt sympathies to the government and the people of Cuba on the loss of their beloved leader who fought for the rights, freedom, political and socio-economic emancipation of the Cuban people.While echoing the sentiments expressed by President Maithripala Sirisena, Prime Minister Ranil Wickremesinghe and Foreign Minister Mangala Samaraweera in their messages of condolences to their respective Cuban counterparts, Ambassador Dissanayake indicated that the people of Sri Lanka always held the late President Fidel Castro in high esteem for what he stood for and believed in, as a true revolutionary humanist. While emphasizing the fact that the relations between Sri Lanka and Cuba have strengthened during his presidency and after, Ambassador remarked that Fidel Castro will be long remembered by progressive people across the world including Sri Lankans as a courageous, legendary and visionary leader of the 21st century. A bouquet of flowers was placed at the Memorial as a tribute to the late leader.Sri Lankas Ambassador to Cuba, Sarath Dissanayake represented Sri Lanka at the state funeral ceremony of the former Cuban President and leader of the Cuban Revolution, Fidel Castro Ruz on 29 November at the Revolution Square in central Havana, where a large gathering of distinguished personalities including foreign dignitaries and high level delegations around the world attended. ", 
  "title": "Sri Lankas Envoy pays tribute to Late Cuban Leader ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/347-sri-lanka-s-envoy-pays-tribute-to-late-cuban-leader"
}