{
  "date": "December 08, 2016", 
  "text": "The government is committed to fulfill its responsibilities for the national security. We will not weaken the security sectors but strengthen them. The government will take steps to provide required training, modern technology and the resources to our security sectors, to be able to face the situations like cyber crimes, he said.President Maithripala Sirisena requested not to create unnecessary fears among the people about the Indo-Lanka trade agreement. That agreement will be signed after presenting it to the Cabinet and then to the Parliament. If there will be contrary matters in that we will remove them and will sign it as an agreement which will be accepted by everyone, he added.The President made these remarks at the debate on financial heads of the Defense Ministry at the Parliament yesterday (Dec. 07).As a government, we will come into new agreements not only with India but also with all economically strong countries from which we can get economic cooperation, he further stated.The President lamented that misleading and incorrect opinions on the actions taken by the government are being spread by some interested parties. Those who consider the national security in the country and the betterment of the people, should act according to their own conscious, he said.The new constitution is still in the status of discussion and under the amendments. The government has not come into an agreement on that as yet, the President stated.He said that the government considers the ideas of the scholars and intellectuals when coming into trade or commercial agreements, establishing a new constitutions and bringing new acts.If the national security is used for the political advantages and gaining of power in the future, everybody will have to be saddened again. In this program for national security, not only criticism, but also proposals on better plans and suggestions are also essential, the President further stated.The government is committed to fulfill its responsibilities for the national security. We will not weaken the security sectors but strengthen them. The government will take steps to provide required training, modern technology and the resources to our security sectors, to be able to face the situations like cyber crimes, he said.", 
  "title": "Do not create unnecessary fear about Indo-Lanka trade agreement  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/360-do-not-create-unnecessary-fear-about-indo-lanka-trade-agreement-president"
}