{
  "date": "December 09, 2016", 
  "text": "The government has to utilize correct and timely long-term strategies to liberate the country from the economic crisis and achieve economic development on a correct path.One method is to re-structure businesses and enterprises which sustain economic losses. Accordingly the government will have to re-structure loss-making businesses and enterprises through agreements with local and foreign entrepreneurs. Otherwise people will have to incur debt payments for certain State institutions that have huge losses. Our country has fruitful experience ofre-structuring such institutions in the past. It is in this background that the Government has taken steps to convert the Hambantota Port into a joint venture with a private company belonging to the Chinese government. It is a joint concern entered into with the Sri Lanka Ports Authority.Already over Rs.150,000 million has been taken as a loan from China to build the Hambantota Port. Though a colossal amount has to be paid as debt instalments and interest the port does not make any profit.Sri Lanka Ports Authority has earned an income of Rs.32, 202 million from January to October 31, 2015. Of it 91.15 % has been earned from the Colombo Port. However, this income had to be allocated for the maintenance of the Hambantota Port and to pay its debts. The maintenance expenses of the Hambantota Port during that period amounted to Rs.2597 million. In addition Rs.8482 had been paid as debt instalments and interest. However, the total income from the Hambantota Port during the relevant period was only Rs.1730 million. Thus every citizen of the country has a debt burden of Rs.10, 000 for the Hambantota Port alone. The only strategy to salvage the Hambantota Port is to make it an income generating enterprise. The government has undertaken a correct economic strategy to fulfill that responsible task. Accordingly the objective of the government is to make the Hambantota Port an income generating enterprise retaining its ownership and leasing it on a 99-year lease agreement. Another objective is to convert it from the present position of a White Elephant to a prime commercial center of the economy. The target of the present government is to make this port a center of active economic operations by converting it as a hub connecting the East and the West and as an entry point into the Sri Lankan economy.It is a genuine task aimed at sustainable economic development of the country. It is not an attempt to sell the Hambantota Port to a foreign country or a betrayal of the country, as some allege.", 
  "title": "Statement of Development Strategy and International Trade Minister Malik Samarawickrema on the contract between the Hambantota Port and a Chinese State-owned Company", 
  "url": "https://www.dgi.gov.lk/news/latest-news/364-statement-of-development-strategy-and-international-trade-minister-malik-samarawickrema-on-the-contract-between-the-hambantota-port-and-a-chinese-state-owned-company"
}