{
  "date": "December 19, 2016", 
  "text": "State revenue has increased by 23 percent during the first 9 months of this year compared with the same period in 2015. Accordingly, the state revenue in the first nine months of 2016 rose to Rs. 1,180 billion from the Rs. 959 billion earned during the same period in 2015.Finance Minister Ravi Karunanayake attributed the rise in income to increased efficiency and eradication of corruption in the process of revenue collectors such as Sri Lanka Customs, the Inland Revenue Department and the Excise Department. Large percentage of state revenue is from the income taxes which has increased to Rs 1067 billion from Rs 882 billion on Year on Year basis within the first nine months of this year During the last few years due to increased heavy public debt the revenue gradually came down to an average of 11 percent of the GDP in 2014. However, benefitting from the reforms in the tax revenue process the state revenue is expected to increase to 13.5 % of the GDP by the end of this year.The Finance Minister Ravi Karunanayake said that the government would be able to cover the recurrent expenditure through the state revenue this year benefitting the people as a result of the reforms introduced by the Good Governance(yahapaalana) government for the development of the country. Though the previous government made various claims that the country was developed during its regime, the state revenue was not sufficient even to cover the debt servicing for the last 5 years since 2011.As a favourable result of the increase in the state revenue up to 13.5% of the GDP, the deficit has also come down from Rs 573 Billion in the first nine month of the yester year to Rs 506 billion this year enabling the government to reach its deficit target of 5.4% conveniently by the end of the year.The government is in the process of implementing a series of focused legislative, administrative, institutional and capacity improvement measures for revenue and expenditure management. Accordingly, the budget-2017 has paved the way for allocation of funds to line ministries and the Provincial Councils based only on the action plan submitted by them considering the governments priority areas deviating from the hitherto practiced policy of allocating fund based on the previous years list of expenses The system of zero based budget allocation commenced with the budget 2017 is a prelude to introduce the performance based budget by the year 2020.Meanwhile, the government has initiated several reforms to improve tax administration with minimal enforcement costs enabling the introduction of automation to the tax system. This will facilitate the tax payers a number of web based services such as registration, returns, tax payment, collection and appeals. Further, the changes introduced under the budget -2017will help to deviate from the heavy reliance on the indirect tax gradually. With the increase in the threshold for PAYE tax none of the persons earning up to Rs 100,000 per month will be subject to taxes from next April said the Minister of Finance Mr. Ravi Karunanayake.", 
  "title": "State Revenue has increased by 23 % in the first nine months of the year -Finance Minister Ravi Karunanayake", 
  "url": "https://www.dgi.gov.lk/news/latest-news/386-state-revenue-has-increased-by-23-in-the-first-nine-months-of-the-year-finance-minister-ravi-karunanayake"
}