{
  "date": "December 20, 2016", 
  "text": "President Maithripala Sirisena says that steps are being taken by the Government to establish a reasonable salary system for those who are employed in the field of judiciary.He made these remarks participating at the Annual Conference of Judges held at the Pegasus Reef hotel in Wattala, today (19).The Government has understood the issue of not having a reasonable salary system for the employees in the field of judiciary, the President said that adding the Government will act accordingly its policy to provide reasonable salary to all irrespective of their ranks to deliver impartial and just service to the public with an independent mind.The President emphasized that without limiting the good governance concept to the banners the Government will ensure the impartiality and the democracy that should prevail in all the fields including the judiciary and public service. President Sirisena said all of us can see by studying the past few decades how the Executive influenced the Judiciary and said that the Government should fulfill its responsibility to ensure the impartiality and the independence of the Judiciary. The President said that the judiciary and the law should be fair to all, and the persons who are in this field should pay their immediate attention to the allegations levelled by the general public and various sections as some prisoners receive different facilities at the prison considering their social status.The priority should be given to the experiences and talents when giving appointments and promotions in the Judicial Service Commission, the President said, adding that the Government has made room in this regard. The President presented a memento to Chief Justice K. Sripavan appreciating his service to the field of the Judiciary. Minister of Justice, Wijedasa Rajapakse, President, Secretary and members of the Judicial Service Association, intellectuals and many others participated in this event.", 
  "title": "Reasonable salary structures for all levels in judiciary system  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/387-reasonable-salary-structures-for-all-levels-in-judiciary-system-president"
}