{
  "date": "2016-12-21", 
  "text": "A special international award to President in recognition of his commitment on preventing CKDu in Sri LankaThe International Society of Nephrology presented a special award to President Maithripala Sirisena in recognition of his commitment and dedication on preventing the chronic kidney disease of unknown etiology (CKDu) in Sri Lanka.The Secretary General of the International Society of Nephrology, Professor Mrs. Adheera Levin presented this award to the President at a ceremony held at the Galle Face Hotel in Colombo.Expressing his views regarding this award the President said that this award strengthens the programme carried out by the Government for the welfare of the innocent kidney patients. He further said that he would like to express his gratitude on behalf of all the Sri Lankans to the International Society of Nephrology for presenting this award.President Sirisena said that the government has a long journey to go to save innocent poor people of the country who are faced with this dreaded disease over the past two decades. He also requested for the contribution of everybody in this regard.President Maithripala Sirisena also presented an award to Mrs. Adheera Levin in recognition of her contribution at the international level to prevent CKDu in Sri Lanka. Awards were also presented to Consultant Physician Dr. Thilak Abeysekera, Dr. Abraham and Project Director of Presidential Task Force on Prevention of Chronic Kidney Disease, Mr. Asela Iddawela in recognition of their great service for the prevention of CKDu in Sri Lanka.Ministers Ravi Karunanayake, Mahinda Samarasinghe,Patali Champika Ranawaka, John Amaratunga, Arjuna Ranatunga, MPs, Secretary to the President P.B. Abeykoon, the United States ambassador to Sri Lanka, Atul Keshap, The Chairman of Galle Face Hotel and the Brand Ambassador of the Presidential Task Force for Kidney Disease Prevention, Mr.Sanjeewa Gardiner and dignitaries participated in this event.", 
  "title": "A special international award to President in recognition of his commitment on preventing CKDu in Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/391-a-special-international-award-to-president-in-recognition-of-his-commitment-on-preventing-ckdu-in-sri-lanka"
}