{
  "date": "December 22, 2016", 
  "text": "The approval of President Maithripala Sirisena and the Cabinet of Ministers have been received to the agreement to be signed with China Merchant Holdings on Hambantota Port, said the Minister of Development Strategies and International Trade Malik Samarawickreme. He said that the Framework agreement in this regard had already been signed and the Concessionary agreement is expected to be signed early January next year. Accordingly, 80 per cent of shares of the Port of Hambantota will be given to this Chinese company for USD 1.12 billion.The minister further said that it is also expected to immediately sign a few other agreements to commence Cement manufacturing plants, LNG Plants, Oil refineries, and Dockyards within the land extent of 1,200 acres owned by the port of Hambantota with an investment of approximately USD 4 billion.In addition, a Special Economic Zone covering Monaragala, Embilipitiya, Matara and, Hambantota areas will also be established with the support of the Government of China. This will be implemented under three phases in a land extent of 15, 000 acres. Around 2,400 factories which generate nearly 400,000 direct and indirect job opportunities, especially for the younger generation are also expected to be established in this area, he said. We expect a huge development in South, Monaragala, and Embilipitiya areas.Specially, under the new agreement, the Hambantota Port will only be used for financial purposes, but not for military purposes at any time except by Sri Lanka Navy.This will be a joint venture. There will be no Chinese working here other than several essential technicians etc. Only Sri Lankans are there. Spending about 60 percent of the profit of the Port of Colombo for Hambantota Port is useless, he said and added same action will be taken to develop the Trincomalee harbor too. Nearly 90 per cent of lands used under the new agreement is owned by the government. They will be given only for 99 years, the minister said.", 
  "title": "Govt. to go ahead with Htota port  China agreement", 
  "url": "https://www.dgi.gov.lk/news/latest-news/398-govt-to-go-ahead-with-h-tota-port-china-agreement"
}