{
  "date": "December 25, 2016", 
  "text": "Jesus Christ was a great messenger of reconciliation and social righteousness to the world, President Maithripala Sirisena stated. In his Christmas Message, he described Jesus as an eternal savior to people around the world.Jesus Christ was born into this world in an era when immorality, chaos and cruelty was the order of the day. Since then, the new religious vision that emerged centering a humble dwelling shines eternally as a mark of human greatness, he said in his message.Following is the full text of the Message:MESSAGEReligion is one of the most precious guiding lights of the human civilization. Religion makes people show compassion and kindness to others and be empathetic towards others.Over 2,000 years ago, the Jesus Christ was born into this world in an era when immorality, chaos and cruelty was the order of the day. Since then, the new religious vision that emerged centering a humble dwelling shines eternally as a mark of human greatness.The Christmas, which is celebrated by all the Christians around the world as a universal festival, embodies loving kindness. Jesus Christ, who could reduce power-crazy kings such as Herod to a mere mention in the history was a great messenger of reconciliation and social righteousness to the world. This makes Jesus Christ an eternal savior to people around the world.I extend my warmest greetings for a wonderful Christmas to all Christians who nourish the teachings of universal love, peace, happiness and kindness.I wish for a Happy Christmas full of Peace and Joy to all Christians.Maithripala SirisenaJesus Christ was a great messenger of reconciliation and social righteousness to the world, President Maithripala Sirisena stated. In his Christmas Message, he described Jesus as an eternal savior to people around the world.Jesus Christ was born into this world in an era when immorality, chaos and cruelty was the order of the day. Since then, the new religious vision that emerged centering a humble dwelling shines eternally as a mark of human greatness, he said in his message.Following is the full text of the Message:MESSAGEReligion is one of the most precious guiding lights of the human civilization. Religion makes people show compassion and kindness to others and be empathetic towards others.Over 2,000 years ago, the Jesus Christ was born into this world in an era when immorality, chaos and cruelty was the order of the day. Since then, the new religious vision that emerged centering a humble dwelling shines eternally as a mark of human greatness.The Christmas, which is celebrated by all the Christians around the world as a universal festival, embodies loving kindness. Jesus Christ, who could reduce power-crazy kings such as Herod to a mere mention in the history was a great messenger of reconciliation and social righteousness to the world. This makes Jesus Christ an eternal savior to people around the world.I extend my warmest greetings for a wonderful Christmas to all Christians who nourish the teachings of universal love, peace, happiness and kindness.I wish for a Happy Christmas full of Peace and Joy to all Christians.Maithripala Sirisena", 
  "title": "Jesus Christ, an eternal savior of mankind  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/408-jesus-christ-an-eternal-savior-of-mankind-president"
}