{
  "date": "December 31, 2016", 
  "text": "President Maithripala Sirisena has given instructions to the relevant authorities to issue a gazette notification declaring a larger Wildlife Reserve, including the surrounding forest area which is not under the purview of the Department of Wildlife; further expanding the forest area belongs to the Wilpaththu National Park. Furthermore, the President instructed to the expeditious implementation of a program to continuous forest monitoring, including the Wilpaththu National Park with aerial monitoring utilizing the modern technology.The President gave these instructions during a special meeting with the officials of the Ministry of Environment at the Presidential Secretariat, yesterday (30th Dec.).President Sirisena further instructed the officials to enforce the law against the persons who are responsible for the forest destruction irrespective of their social status. He further said that he will request the Judicial Service Commission to fully implement the penalties and sentences within the existing laws against the deforestation and forest degradation.He also told the officials to appoint a special investigation team to look into the allegations leveled by some section of the society regarding the deforestation taking place in the Puttalam and Mannar districts.The President also said that this investigation team should comprise officials of the Ministry of Environment, Department of Forest Conservation and the Department of Wildlife Conservation, representatives of the environmental organizations as well as the journalists.During the meeting the officials apprised the President that there is no forest degradation taking place in the Wilpaththu National Park. Some incidents emphasized by some media institutions and the environmental organizations are taking place beyond demarcated areas of the Wilpaththu National Park and those incidents taking place as a result of giving permission during the past regime in 2007 to resettle the people in those areas. Nevertheless, if any, illegal forest degradation occurred in those areas, the President instructed the officials to enforce the law against them and instructed the officials to implement a special program to identify land outside the forest areas for the purpose of Resettlement.The officials pointed out recently they have taken steps to take legal actions against two persons who are caught with equipment including a backhoe during a raid conducted on deforestation in Musali Divisional Secretariat Division in Mannar.Secretary to the President, P. B. Abeykoon, Udaya R. Senevirathne, Secretary Ministry of Mahaweli Development and Environment, R.M.D.B. Meegasmulla, Secretary, Ministry of Sustainable Development and Wildlife, Additional Secretary, L.J.M.G.C. Bandara, K.H. Muthukudaarachchi, Director General of Central Environmental Authority, Manjula Amararathna, Deputy Director of Wild Life Conservation and other officials participated at this meeting.", 
  "title": "President instructs to expand Wilpattu national park", 
  "url": "https://www.dgi.gov.lk/news/latest-news/425-president-instructs-to-expand-wilpattu-national-park"
}