{
  "date": "2017-01-01", 
  "text": "The minister of Finance Ravi Karunanayake assuring sustained economic development in the New Year said he was delighted to announce the introduction of a bonanza for all school children from 2017. As envisaged in the Budget  2017 over 4.5 million school going children in the country from the age of 5  19 will be provided with free health insurance policy certificate worth Rs 200,000 per annum to each and every student irrespective of the number of children in a family.Karunanayake said that Rs 2,700 million has been set aside for this and it will be worked out through the ministry of education shortly. Each child will be given a policy certificate for Rs 200,000 covering both the in and outpatient services subject to a maximum of Rs 100,000 for hospitalization and Rs 10,000 for outpatient services.The major significance of this scheme is it covers all the students whether they study in the government or private schools said the minister Ravi karunanayake.It is a sigh of relief to parents of entire student population of the country as they need not worry about the continuation of the study of their children in future. The Minister of Finance said that with the introduction of the free medical insurance the government has given a new impetus to the free education as already there are five welfare programmes in place for the well being of the students.Distribution of free text books, uniforms, nutritional mid day meal to needy children, glass of milk to needy students in the primary classes and distribution of a pair of shoes to those who need it are the other welfare benefits implemented by the government.In the meantime the Minister of Finance further said that as the President Maithripala Sirisena has directed that hereafter no schools should be reported which has the shortcoming of the basic needs including desks and chairs the government has earmarked a plan to provide the basic infrastructure facilities such as electricity, sanitation and water to remaining 1500 schools in the year 2017 with an additional allocation of Rs 7000 million.The government in 2016 had increased the allocation to the ministry of Education by three fold than it was in 2014 to provide the basic needs to all 10,000 government schools and this year (2017) Rs 61 billion worth capital projects will be implemented among the schools to complete the basic needs of all the schools in the country.The secretary to the Ministry of Finance Dr R.H.S. Samarathunge expressed the belief that as the allocations have been made to ministries based on the action plan submitted by the respective line ministries from this year all projects earmarked for augmentation of the facilities in schools would be carried out on time. He said that the transfer of funds to projects that are not in their action plans will not be allowed under any circumstances in future the zero based budget making process.", 
  "title": "Finance Minister announces big bonanza for school children in New Year", 
  "url": "https://www.dgi.gov.lk/news/latest-news/432-finance-minister-announces-big-bonanza-for-school-children-in-new-year-2"
}