{
  "date": "January 03, 2017", 
  "text": "Yet another phase of the Community Service Project of the Sri Lanka Navy, operated under the directives of the Commander of the Navy, Vice Admiral Ravindra Wijegunaratne came to its successful end yesterday (02).Accordingly, a Reverse Osmosis (RO) plant built at Mahasen Maha Vidyalaya in Padaviya was declared open by the Commander North Central Naval Area, Rear Admiral Merril Wickramasinghe for the use of the school children and community in the area.The Navys Research and Development Unit utilized their expertise to produce and install this facility along with the financial provision made by the PINA Organization which is a humanitarian, development-aimed organization functioning in Sri Lanka. Due to this installation, over 1,000 school children, 60 teachers and 1,000 families in the area are now facilitated with safe drinking water provided free of charge.Performing a praiseworthy cause, the Research and Development Unit of the Navy has thus far installed 83 RO units for the benefit of 39,250 families and 29,200 school children in different parts of the county where a high prevalence of the renal disease is recorded,. Further, their latest installation in Padaviya marks the first RO plant assignment accomplished by the Research and Development Unit in year 2017. Moreover, the Navy is determined to continue this noble task being an example to other departments and institutions of the country as well. Besides, the Navy believes that this magnanimous effort will immensely pave the way to eradicate the renal disease from Sri Lanka.Venerable Maha Sangha, Catholic Priests, Chairman of PINA Organization, Dr. Aruna Abeygunawardena along with the local and foreign members of the organization, members of Naval Association, Divisional Secretariat of Padaviya, school children and a large number of residents were also present on this occasion.", 
  "title": "Another Reverse Osmosis plant declared open in Padaviya  ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/437-another-reverse-osmosis-plant-declared-open-in-padaviya"
}