{
  "date": "2017-01-04", 
  "text": "Having taken over the Onboard Security Team Operations (OBST) from Avant Garde Maritime Services Ltd the Sri Lanka Navy was able to earn Rs. 2.26 billion for the Government of Sri Lanka, from its operations in year 2016.Accordingly, during the year 2016 the Navy had carried out a total of 6,371ship movements.Out of the total of 6,371 ship movements 5,928 and 443 movements were derived from the centres in Galle and Colombo respectively. Meanwhile, since the inception of OBST operations from 13th November 2015 until 02nd January 2017 the Navy had earned an income of Rs. 2.63 Billion for a total of 7,457 ship movements. Galle and Colombo operation centres have carried out 6,922 and 535 movements respectively averaging approximately 573 moves per month.The Galle and Colombo operation centres look after the receiving, holding and issuing of weapons, ammunitions and other related equipment belonging to foreign as well as local On Board Security Teams. The earnings generated through OBST operations are directly deposited in the Consolidated Fund of the Sri Lanka Government.With the annulment of the previous agreement, the Sri Lanka Navy was entrusted the task of providing security to Merchant Vessels and supplying services to Security Firms involved in providing onboard security for Merchant Ships. The Navy took over these duties following a special directive issued by His Excellency the President Maithripala Sirisena.Since taking over the duties, naval personnel were involved in providing services to Merchant Ships carrying mainly weapons and ammunitions. Since taking over these tasks, the Navy ensured that the security requirements of the Merchant Vessels which are frequenting the High Risk Area (HRA) are provided services efficiently by the naval personnel at Galle and Colombo horbours.", 
  "title": "Navy earns Rs. 2.26 billion for the Government through OBST operations in the year 2016  ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/445-navy-earns-rs-2-26-billion-for-the-government-through-obst-operations-in-the-year-2016"
}