{
  "date": "January 07, 2017", 
  "text": "R.A. Nisal Punsara of Rahula College in Matara has received the best results in the Biology stream while Amaya Darmasiri from Maliyadeva Girls College in Kurunegala has topped the list in the Physical Science stream of the 2016 G.C.E Advanced Level examination.Akalanka Rajapaksa of Ananda College in Colombo has obtained the best results in the Commerce stream while Indeevari Gawarammana from Girls High School Kandy is the first in the Arts stream.2016 A/L Best Results:Physical Science1.  Amaya Darmasiri - Maliyadeva Girls College, Kurunegala2.  Chathura Jayasanka  Richmond College, Galle3.  Sawindu Dimal Thanuka  Royal College, ColomboBiology1.  R.A. Nisal Punsara - Rahula College, Matara2.  Roshane Akthar - Kinniya Madya Maha Vidyalaya3.  Klerin Dilujan - Carmel Fatima College, KalmunaiCommerce1.  Akalanka Rajapaksa - Ananda College, Colombo2.  Vindula Perera  St. Josephs College, Colombo3.  Nipuni Rupasinghe  Ananda Balika Vidyalaya, HingurakgodaArts1.  Indeevari Gawarammana - Girls High School, Kandy2.  P. Kurupareshan  Hindu College, Manipai3.  Amanda Paramee - Viharamahadevi Balika Vidyalaya, KiribathgodaEngineering Technology1.  J. Kanakasundaram - Skandavarodaya College, Chunnakam2.  Nisal Kobbekaduwa  Govt. Science College, Matale3.  A. Ranatunga  Ratnawali Balika Vidyalaya, GampahaBio Systems Technology1.  Malithi Dilrangi - Swarnajayanthi Maha Vidyalaya, Kegalle2.  M. Thatharani  Devi Balika Vidyalaya, Colombo3.  Ilyas Pathima - Fathima Balika Maha Vidyalaya, OddamavadiOther1.  T. Ekanayake - Musaeus College, Colombo2.  D. Karunaratne  private candidate3.  Lahiru Sasanka  private candidateR.A. Nisal Punsara of Rahula College in Matara has received the best results in the Biology stream while Amaya Darmasiri from Maliyadeva Girls College in Kurunegala has topped the list in the Physical Science stream of the 2016 G.C.E Advanced Level examination.Akalanka Rajapaksa of Ananda College in Colombo has obtained the best results in the Commerce stream while Indeevari Gawarammana from Girls High School Kandy is the first in the Arts stream.2016 A/L Best Results:Physical Science1.  Amaya Darmasiri - Maliyadeva Girls College, Kurunegala2.  Chathura Jayasanka  Richmond College, Galle3.  Sawindu Dimal Thanuka  Royal College, ColomboBiology1.  R.A. Nisal Punsara - Rahula College, Matara2.  Roshane Akthar - Kinniya Madya Maha Vidyalaya3.  Klerin Dilujan - Carmel Fatima College, KalmunaiCommerce1.  Akalanka Rajapaksa - Ananda College, Colombo2.  Vindula Perera  St. Josephs College, Colombo3.  Nipuni Rupasinghe  Ananda Balika Vidyalaya, HingurakgodaArts1.  Indeevari Gawarammana - Girls High School, Kandy2.  P. Kurupareshan  Hindu College, Manipai3.  Amanda Paramee - Viharamahadevi Balika Vidyalaya, KiribathgodaEngineering Technology1.  J. Kanakasundaram - Skandavarodaya College, Chunnakam2.  Nisal Kobbekaduwa  Govt. Science College, Matale3.  A. Ranatunga  Ratnawali Balika Vidyalaya, GampahaBio Systems Technology1.  Malithi Dilrangi - Swarnajayanthi Maha Vidyalaya, Kegalle2.  M. Thatharani  Devi Balika Vidyalaya, Colombo3.  Ilyas Pathima - Fathima Balika Maha Vidyalaya, OddamavadiOther1.  T. Ekanayake - Musaeus College, Colombo2.  D. Karunaratne  private candidate3.  Lahiru Sasanka  private candidate", 
  "title": "GCE A/L Best Results Released", 
  "url": "https://www.dgi.gov.lk/news/latest-news/461-gce-a-l-best-results-released"
}