{
  "date": "January 08, 2017", 
  "text": "Former President Mahinda Rajapaksha is the one who first understood the necessity of the industrialization for Hambantota area to develop the Hambantota port and the only thing done by the Present government is implementing it, said Prime Minister Ranil Wickremesinghe. He was addressing the inauguration ceremony of the Sri Lanka  China Logistics and Industrial Zone (SLCLIZ) to be set up within the Ruhunu Economic Development Area in Hambantota last morning.The Premier said that the former President had discussed in this regard with the Chinese President during his time and had signed agreement on 16th September 2014 to begin industries in this area.The Chinese EXIM bank loan of USD 1.4 billion should be settled from this year and therefor the VAT had to be increased, he said. When 80 percent of shares are given to the China Merchant Company it will cover about USD 1.1 billion. As well Sri Lanka will have a special administrative right with the other 20 per cent of shares.Speaking about the acquisition of land for the Ruhunu Economic Development Area, the Premier assured that any religious or archeological lands will not be acquired for the project and 95 per cent of lands acquired are owned by the government.According to him, there had been a discussion on Friday in Tissamaharamaya with Tissamaharamaya chief prelate and the Former Speaker Chamal Rajapaksha and the issues pertaining to the acquisition of lands have been discussed there in detail.The Premier further added that an economic zone called South  West Corridor from Kandy to Wellawaya covering Central, North-Western, Western, Southern, Sabaragamuwa and Uva provinces will be established. The Western Province is to be the largest city of this corridor. With the implementation of South  West Corridor initiative about 70 per cent of the population of the country will have a good income. In parallel to that, the North-East Corridor initiative covering Northern, Eastern, and North Central Provinces will also be set up. He said that the funds will be received from China, Singapore, Indian, and Japan for the successful implementation of this initiatives and added a powerful Sri Lanka will be created in the future.", 
  "title": "PM clears doubts on Ruhunu Development Area", 
  "url": "https://www.dgi.gov.lk/news/latest-news/463-pm-clears-doubts-on-ruhunu-development-area-2"
}