{
  "date": "January 09, 2017", 
  "text": "President Maithripala Sirisena said that the National Unity government will stay to fulfill the mandate it received two years ago on this day from the 6.2 million people who voted for the pledge in the election manifesto to form a consensual government.He further said that he is not worried about statements or actions of those who are wanting to topple the government this year.Speaking at a colorful function held at the Bandaranaike Memorial International Conference Hall (BMICH) to mark the second anniversary of his Presidency, he pointed out that people voted him to power to restore democracy, media freedom, bring about ethnic reconciliation, draft a new constitution, lift the economy from the depths of indebtedness, and improve relations with the international community by following a non-aligned foreign policy.He acknowledged that people are asking him what he has done in the last two years and said that while the openly hostile ones are declaring that they will topple the government, some in his midst have developed doubts about their own electoral fortunes if they stay on with the government.But he asserted that his government has many critical achievements to its credit.I dare say that this strong government cannot be toppled and no one will be allowed to topple this national unity government which was formed amidst challenges and obstacles, the President said.Certain politicians, who no longer have the peoples support, are boasting that the government will be toppled. But, I must say that this is only a pipe dream he added.He also identified the abolition of the 18th Amendment to the Constitution which gave extraordinary powers to the President as a bigger victory than the passing of the 19th amendment which pruned the powers of the Executive President.The President went on to say It was vital to nullify the 18th Amendment than passing the 19th amendment to the Constitution as it is of paramount importantance to safeguard democracy, he said.The President while speaking on the action plan of the country especially in the economic development sector, said the country will be subjected to a radical changes in several key fields. Speaking on the moves to agriculture sector development, President Sirisena said that it has been planned to renovate all small tanks including channel system.However, the present unity government is being praised by many world leaders at various occasions. As a result of the democratic and people-friendly good-governance existing in the country, many challenges could be overcome and moreover the country is being widely accepted in the international arena especially at international forums. The country has achieved a significant progress in the spheres of protecting and safeguarding human rights, strengthening democracy, media freedom, freeing the judiciary system from the clutches of politics and many more positive achievements in various sectors as described in the election manifesto, the President said.As a consequence of the failure to protect human rights, inability to face the economic crisis and failure to build up ethnic harmony was the very reason for the former government to dissolve it two years before the due period, President Sirisena said.The bad economic management of the then government, there is a liability of Rs 9,000,000 million to be settled by this government, the President said.Certain people tend to ask what this government has done during the last two years. I must say that this government has laid the foundation for democracy, freedom, ethnic harmony, achieving economic freedom and many more positive moves. Unlike the previous regime, no journalist was killed on the road or no one left the country for death fear to save the life. This is how everyone is experiencing media freedom, established by this government during the last two year period. Despite the fact that a mountain of loan amounting Rs. 9,000,000 million to be settled, several key development projects are being carried out. Even though, illuminated development projects are not carried out by this government, the economy of the country is gradually strengthening, the President said.The President said that the opposition is spreading falsehoods saying that the new constitution will divide the country and that Buddhism will lose its pre-eminent position. He appealed to these elements not to indulge in scaremongering and said that he will never change the unitary character of the country. He appealed to the doubters in his midst and also the opponents, not to give importance to their electoral fortunes but concentrate on putting the country back on its feet by supporting the government.No need to talk about toppling the government. Your duty is to take the country forward with this politically elected government the President said.The Chief Guest at the second-anniversary function was the Andhra Pradesh Chief Minister Chandrababu Naidu who delineated the steps he had taken to modernize his administration with IT solutions and other forms of modern technology. He offered to help Sri Lanka in the use IT and agriculture and proposed that Sri Lanka guides Andhra Pradesh as to how it can improve health, education, and tourism.The Andhra Pradesh Chief Minister underlined the fact that the new capital of the state, Amaravathi, was a famous center of Buddhism and the home of the First Century AD Buddhist philosopher Nagarjuna.Referring to the idea behind inviting distinguished Indians to be the Chief Guest on two consecutive anniversaries, President Sirisena said that inviting Indians only reflected the exceptionally close ties between Sri Lanka and India.Relations with India are not based on agreements but on religion and culture, he said.", 
  "title": "Abolition of 18th Amendment, a bigger victory than the passing of the 19th  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/467-abolition-of-18th-amendment-a-bigger-victory-than-the-passing-of-the-19th-president"
}