{
  "date": "January 09, 2017", 
  "text": "The smooth functioning of SriLankan Airlines codeshare partnerships in the Western and Central Europeanregion contributed in a significant manner to the growth of tourist arrivals to Sri Lanka in 2016, which expanded by 14% and crossed the 2 million milestone. SriLankan made a significant change in strategy in the fourth quarter of 2016 by expanding services to the Middle East, South Asia and East Asia which included the launch of 11 new destinations and the increase of frequencies to existing destinations, while suspending services on three loss-making European routes. The changes resulted in SriLankan expanding its global route network to 101 destinations in 47 countries. It is also now the largest foreign carrier into India where it serves 11 cities with over 100 frequencies, as well as being the largest airline operating to both Sri Lanka and the Maldives.SriLankan arranged efficient codeshare agreements with its partner airlines to carry passengers to Colombo from much of Europe, as it suspended services to Paris, Frankfurt and Rome in November 2016. Significantly, each of these tourism markets recorded significant increases in growth of tourists to Sri Lanka and growth was not affected by the suspension of direct air services, due to the convenient codeshare services offered by SriLankans partner airlines. Arrivals from Germany for December 2016 totaled 11,994, an increase of 5.9% over December 2015; and arrivals from France in December 2016 totaled 7,061, an 11.5% increase over the 7,871 of December 2015.SriLankan has codeshare arrangements with many airlines around the world, which provide air services that strengthen the national carriers global network and help market Sri Lanka as a tourism destination.Western and Central Europe was the largest tourism generating region to Sri Lanka in 2016 by contributing643,333 visitors, according to the Sri Lanka Tourism Development Authority, with a 16.5% growth over 2015. This was even more than South Asia (513,536) and East Asia (425,161), despite those two regions having the two single largest tourist market countries  India and China.Western and Central Europes contribution came mainly from the United Kingdom (188,159), Germany (133,275) and France (96,440), but significant numbers of tourists also came from the Netherlands, Italy, Switzerland, Sweden, Spain, Denmark, Austria, Belgium and Norway, each of which generated more than 10,000 visitors. Russia, Ukraine, Czech Republic and Poland, although classified by the SLTDA as Eastern European countries, also made significant contributions totaling a further 161,171 tourists.", 
  "title": "SriLankan Airlines codeshare partnerships contribute to 2 million tourists milestone ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/469-srilankan-airlines-codeshare-partnerships-contribute-to-2-million-tourists-milestone"
}