{
  "date": "2017-01-10", 
  "text": "Finance Minister Ravi Karunanayake has been selected as the Finance Minister of the Year for Asia-Pacific by the prestigious The Banker magazine for his efforts to steer Sri Lanka into a new era of economic reform and a change of mindset.The banker a prestigious international financial publication published in London inter alia select the finance minister of the year who has best managed to stimulate growth and stabilize the economy of their country . Accordingly for the 2016 Sri lankan minister of finance Ravi Karunanayake has been selected as the Finance minister of the year 2016 award.The Banker says Karunanayake secured a $ 1.5 billion International Monetary Fund (IMF) loan program that the country needed to avoid a balance of payments crisis, replenish reserves and rebuild confidence among international investors.Sri Lankas latest bond issues in the international capital markets suggest Karunanayake has indeed reached his objective. In 2015, the sovereign issued a $ 1.5 billion dual-tranche note  its largest since 2007. A year later, it printed a second bond of the same size, with order books of $ 6.6 billion, despite market volatility after the UK voted to leave the EU.Sri Lanka is also working towards fiscal consolidation. Sri Lankas budget deficit has dropped from 7% when Karunanayake took office in January 2015 to 5.4% in 2016  below the targeted expectations of 5.6%.After a visit in September 2016, the IMF said Sri Lankas tightening of fiscal and monetary policies has been effective and that it met the IMF programs targets through to the end of June 2016.According to latest Sri Lankas total government revenue grew from Rs. 1205 in 2014 to Rs. 1,461 billion in 2015. Tax revenue rose from Rs. 1,050 billion to Rs. 1,356 billion in the same period. This is crucial for Sri Lanka, which has a very low tax revenue-to-gross domestic product ratio.To raise tax revenue further, Parliament passed a bill to increase value-added tax from 11% to 15%. Karunanayake is also keen to continue simplifying the tax system as well as change peoples mindset towards taxes. But even without expected revenue from the increased VAT due to its late implementation the Finance ministry was able to increase the national revenue to 13.5% the GDP in 2016 from 11.4% in 2014 thus making it possible to cover the recurrent expenditure.The Gout inculcated in the minds of the people that paying taxes is not something bad, but a must for the country. Every person needs to pay a reasonable charge instead of relying on the Government for everything. As a result, Sri Lankas tax records have grown from having 700,000 files in January 2015 to having 1.4 million today.", 
  "title": "Banker Magazine picks Ravi K as Finance Minister of the Year, Asia-Pacific 2016", 
  "url": "https://www.dgi.gov.lk/news/latest-news/474-banker-magazine-picks-ravi-k-as-finance-minister-of-the-year-asia-pacific-2016"
}