{
  "date": "January 10, 2017", 
  "text": "President Maithripala Sirisena has instructed the relevant officials to take immediate steps to correctly implement the existing laws to prevent th abuse f intellectual property rights as well as to implement new rules and regulations if the existing laws are not adequate.The President gave these instructions at a discussion held yesterday (09) at the Presidential Secretariat with a group of artistes and relevant officials. During the meeting, attention was drawn towards proper payment of royalty to the writers and protecting the copyrights.The President further said that at present the rules and regulations on intellectual property rights properly enforced in every developed country and we also should pay our attention in this regard.President Sirisena directed the Ministry of Mass Media to implement a new program to educate the relevant sectors about the rules and regulations related to the intellectual property rights and the royalty.The ideas and suggestions were presented for a qualitative media and regarding the steps that should be taken to prevent the damage caused to the society through indecent visuals.Minister of Mass Media Gayantha Karunathilaka, Attorney General Jayantha Jayasuriya, Director General of the Government Information Department Ranga Kalansooriya,Director General of the National Intellectual Property Office of Sri Lanka, Mrs. Geethanjali Ranawaka and artistes participated in this meeting.President Maithripala Sirisena has instructed the relevant officials to take immediate steps to correctly implement the existing laws to prevent th abuse f intellectual property rights as well as to implement new rules and regulations if the existing laws are not adequate. The President gave these instructions at a discussion held yesterday (09) at the Presidential Secretariat with a group of artistes and relevant officials. During the meeting, attention was drawn towards proper payment of royalty to the writers and protecting the copyrights.The President further said that at present the rules and regulations on intellectual property rights properly enforced in every developed country and we also should pay our attention in this regard.President Sirisena directed the Ministry of Mass Media to implement a new program to educate the relevant sectors about the rules and regulations related to the intellectual property rights and the royalty.The ideas and suggestions were presented for a qualitative media and regarding the steps that should be taken to prevent the damage caused to the society through indecent visuals.Minister of Mass Media Gayantha Karunathilaka, Attorney General Jayantha Jayasuriya, Director General of the Government Information Department Ranga Kalansooriya,Director General of the National Intellectual Property Office of Sri Lanka, Mrs. Geethanjali Ranawaka and artistes participated in this meeting.", 
  "title": "President orders immediate steps to prevent abuse f intellectual property rights", 
  "url": "https://www.dgi.gov.lk/news/latest-news/475-president-orders-immediate-steps-to-prevent-abuse-f-intellectual-property-rights"
}