{
  "date": "January 11, 2017", 
  "text": "Many problems remaining in front of the country cannot be solved with the sword or other weapons but they should be faced with intelligence, said President Maithripala Sirisena. He was addressing the commemoration ceremony of the 1818 Uva  Wellassa rebellion and the war heroes who led it, which was held yesterday (10th Jan.) at BMICH. The event themed Uththamaabhiwandana was organized by the Department of Government Information.He said that, today the country needs not empty voices of empty people, but, the honest voices of the academics and patriots with a correct program.He added that he sees a silence in the state media, non-government media, and other responsible institutions, which are able to create patriotism among the people of the country including the young generation.Many times, we receive only the criticisms and issues. Many people have no solutions or directions for those issues, the President added. He also invited the academics, and the educated of the country to fulfill their responsibility to bring the country forward while learning lessons from the experience received from the past.He further added that there was an unending struggle from the past in the world for power and we must be able to face those foreign shadows with self-confidence.Keynote address of the event was made by Prof. K.N.O. Dharmadasa and Prof. J.B. Dissanayake delivered a special lecture. A documentary produced by the Government Film Unit and a book compiled by the Department of Government Information were also launched.Plaques engraved with the names of the patriots recently gazetted by the President were presented at this occasion to the heads of National Museum and Independence square museum, and the Diayawadana Nilame of the Temple of Tooth Relic, Kandy to establish in their respective places for the knowledge of the future generations.The Chairman and the Secretary of the Keppetipola Foundation handed over a list of another 980 war heroes who joined the Uva-Wellassa rebellion to the President requesting to name them as patriots as well.Minister of Parliamentary Reforms and Mass Media Gayantha Karunathilake delivering the welcome speech also thanked the President Sirisena for rectifying this historical mistake. The vote of thanks was delivered by Director General of Government Information Dr. Ranga Kalansooriya.", 
  "title": "Problems should be faced with intelligence  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/476-problems-should-be-faced-with-intelligence-president"
}