{
  "date": "2017-01-11", 
  "text": "SriLankan Airlines is partnering the Fairway Galle Literary Festival2017 as the Official Travel Partner., The airline is facilitating travel for some of the literary greats attending the high profile GLF from 11th to 15th January 2017 in the historic city of Galle.The Fairway Galle Literary Festival, since first launching in 2007 has become one of the most anticipated literary events in South East Asia for both authors and literary enthusiasts around the world. As the national carrier, SriLankan Airlines supports arts, culture and sports events that strengthen Sri Lankas standing in the global arena. SriLankan Airlines will fly down eminent authors Philippa Gregory, Amish Tripathi, Colm Tibn, Jemima Foxtrot, John Wright, John Gimlette, Ramsay Lawrence Nashef, Sophie Hannah Jones, Sara Wheeler, Dawn Burnham, Sunjeev Sahota, Jeeva Raghunath, Anitha Nair, Somini Sengupta, Nayanjot Lahiri, Anantha Padmanabhan, Christina Lamb, Neel Madhav, Charlotte Dunlop, Kate Tempest, Anjan Sundaram and Jason Licker.  SriLankan Airlines will also be sponsoring a few events during the festival, namely, the opening ceremony of the festival which takes place on 11th January at 6.00pm at Law court square, Galle Fort, followed by a reception at Fairway Pavilion (opposite Halle de Galle) at 7.30pm. The airline will also sponsor the popularChairmans brunch on 14th January at 11.00am to 3.00pm at Landesi, and also the 15th Jan closing day Lunch finale from 1pm to 2.30pm at Jetwing Light House in the Cinammon room.In return for facilitating the travel for the noted authors, SriLankan Airlines will be highly visible at the festival, leveraging on advertising and promotional opportunities to showcase its exciting route network to 47 countries and 101 destinations around the globe. Those wanting to learn more can visit the SriLankan Airlines stand-alone stall at the Lit Caf during the festival.Launched in 1979, Sri Lankas National Carrier is an award-winning airline with a solid reputation for service, comfort, safety, reliability, and punctuality. The airline provides convenient connections to its global route network of 94 destinations in 44 countries. SriLankan Airlines is the proud recipient of a number of awards in the airline industry. The awards hail from a number of prestigious aviation research agencies and travel magazines across the globe.", 
  "title": "SriLankan Airlines Supports Galle Literary Festival 2017 as Official Travel Partner", 
  "url": "https://www.dgi.gov.lk/news/latest-news/479-srilankan-airlines-supports-galle-literary-festival-2017-as-official-travel-partner"
}