{
  "date": "January 11, 2017", 
  "text": "Fashion plays an important role in the Apparel Industry of Sri Lanka which has now emerged as the leading export item.Therefore the boost that the Fashion Industry that can give in the Sri Lanka Apparel Industry which contribute to the overall Sri Lanka Economy as a whole. In this background the Embassy of Sri Lanka in Beijing together with the members of the Sri Lanka delegation participated at the Asia Fashion Awards 2017 which was held in Chongqing from 27th to 30th December, 2017. This event was organized by DBP, Chongqing headed by Mr. Kevin Zhang as the Chairman, supported by the Chongqing Peoples City Government and Keemun Black Tea, China. All East Asian Countries and three South Asian Countries namely Sri Lanka, India and Nepal participated at this event with their Fashion Industry representatives.H.E. Dr. Karunasena Kodithuwakku, Ambassador of Sri Lanka in Beijing and Mr. Dhanushka Karunaratne, Secretary (Tea Promotion) represented the Embassy of Sri Lanka. The Sri Lanka delegation included Ms. Jayamali Erangika Wijesuriya, a female model; Mr. Tymeron Carvalho, a male model; Ms. Nadilie Samarasinghe, a fashion singer, Mr. Lou Ching Wong, Stylist , Ms. Tamara Rebeira, a media personal accompanied by Mrs. Rosita Wickremasinghe, Sri Lanka representative of Fashion Asia China.It is an honur for Sri Lanka since following members of the Sri Lanka delegation was nominated for following Awards :-Ms. Jayamali Erangika Wijesuriya  Asian Top female model Mr. Tymeron Carvalho  Asian Top male modelMs. Nadilie Samarasnghe  Asian Top Fashion SingerMr. Lou Ching Wong  Asian Top StylistBoth Sri Lanka models as well as the Sri Lankan Fashion Singer performed extremely well at the Official Fashion Awards Ceremony. Mr. Tymeron Carvalho, a male model won the Award for the Best Male Model which can be considered as a unique achievement for Sri Lanka at the event.Embassy of Sri Lanka in Beijing", 
  "title": "  Asia fashion awards 2017. chongqing, China and best asian male model from Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/480-asia-fashion-awards-2017-chongqing-china-and-best-asian-male-model-from-sri-lanka"
}