{
  "date": "2017-01-11", 
  "text": "SriLankan Airlines is pleased to note that despite the closure of the runway during the daytime hours from 6th January to 6th April 2017, its services and operations at the Bandaranaike International Airport in Katunayake are proceeding seamlessly, with minimal inconvenience for both inbound and outbound tourists.The current smooth synergy between the Civil Aviation Authority, Airport and Aviation Authority of Sri Lanka(AASL), SriLankan Airlines (the ground handler) and the Defence authorities has resulted in a business as usual approach, resulting in operations continuing smoothly despite the ongoing renovation of the runway.As the key parties to ensuring uninterrupted services at the international airport, all partners have benefitted by cooperating fully with each other whilst ensuring strong team work and proactive attitude. Their combined foresight is helping the new arrangements to work smoothly. This renovation is a massive undertaking and marks the first time a renovation like this has taken place, which has required significant adjustments for all stakeholders. However, the stipulation by the authorities for passengers to report to the airport 5 hours before the flight has helped significantly.The CEO of SriLankan Airlines, Suren Ratwatte commented, I commend the support, patience and understanding displayed by all stakeholders, as we do our best to ensure uninterrupted services. I would especially like to thank all the airport employees for their untiring efforts to tide us over this challenging period by sustaining their commitment to enhanced customer care. I am also grateful to all our passengers for arriving early at the Bandaranaike International Airport in order for us to facilitate their travel with minimum hassle and delays.Passenger check-in counter have been opened 5 hours before the flights in order to carry out all procedures with ease, whilst encouraging online check-in as well.", 
  "title": "SriLankan Airlines ensures high level coordination to facilitate easy passage for passengers", 
  "url": "https://www.dgi.gov.lk/news/latest-news/481-srilankan-airlines-ensures-high-level-coordination-to-facilitate-easy-passage-for-passengers"
}