{
  "date": "2017-01-12", 
  "text": "As is the case with all GSP+ countries, the removal of customs duties for Sri Lanka would be accompanied with the rigorous monitoring on the countrys progress in the area of sustainable development, human rights and good governance. (CDN)The European Commission has proposed GSP+ concessions to Sri Lanka in exchange of the government's commitment to ratify 27 international conventions on human rights, labour conditions, protection of the environment and good governance. In a statement today the European Commission said, The European Commission today proposed that a significant part of the remaining import duties on Sri Lankan products should be removed by the European Union in exchange for countrys commitment to ratify and effectively implement 27 international conventions on human rights, labour conditions, protection of the environment and good governance.These one-way trade preferences would consist of the full removal of duties on 66% of tariff lines, covering a wide array of products including textiles and fisheries, the statement further said.It quoted Trade Commissioner Cecelia Malmstrm as saying  GSP+ preferences can make a significant contribution to Sri Lankas economic development by increasing exports to the EU market. But this also reflects the way in which we want to support Sri Lanka in implementing human rights, rule of law and good governance reforms. I am confident of seeing timely and substantial further progress in these areas and the GSP+ dialogue and monitoring features will support this reform process. This should include making Sri Lankan counter-terrorism legislation fully compatible with international human rights conventions.It also added that Granting access to the GSP+ scheme does not mean that the situation of the beneficiary country with respect to the 27 international conventions is fully satisfactory. Instead, it offers the incentive of increased trade access in return for further progress towards the full implementations of those conventions, and provides a platform for engagement with beneficiaries on all problematic areas.As is the case with all GSP+ countries, the removal of customs duties for Sri Lanka would be accompanied with the rigorous monitoring on the countrys progress in the area of sustainable development, human rights and good governance. (CDN)", 
  "title": "EC proposes to restore GSP+ trade concessions to SL", 
  "url": "https://www.dgi.gov.lk/news/latest-news/483-ec-proposes-to-restore-gsp-trade-concessions-to-sl"
}