{
  "date": "2017-01-16", 
  "text": "Leaders of nearly 40 countries are scheduled to attend the 2017 World Economic Summit which would study the worlds new economic trends in depth.Concurrent to the summit, Prime Minister Wickremesinghe will have several rounds of talks with top level world leaders and high ranking international entrepreneurs, the release stated.The 2017 World Economic Summit would lay the groundwork to ensure a more favorable atmosphere in the future world, bring plans of world leaders towards a common objective and make a collective effort towards formulating a universal and regional economic agenda.Ministers Ravi Karunanayake and Harin Fernando have also been invited to attend the summit.Prof. Maithree Wickremesinghe, Secretary to the Prime Minister Saman Ekanayake, Additional Secretary Saman Athaudahetty and Prime Ministers Special Assistant Sandra Perera will also join the delegation. (CDN)Prime Minister Ranil Wickremesinghe will leave for Switzerland today to attend the World Economic Summit to be held in Davos City from 17 to 21 January. The Prime Minister attended the World Economic Summit on invitation last year too, and the international ties he forged at the summit had been beneficial for Sri Lankas future economic development programs, a press release issued by the Prime Ministers Office stated.Leaders of nearly 40 countries are scheduled to attend the 2017 World Economic Summit which would study the worlds new economic trends in depth. Concurrent to the summit, Prime Minister Wickremesinghe will have several rounds of talks with top level world leaders and high ranking international entrepreneurs, the release stated.The 2017 World Economic Summit would lay the groundwork to ensure a more favorable atmosphere in the future world, bring plans of world leaders towards a common objective and make a collective effort towards formulating a universal and regional economic agenda.Ministers Ravi Karunanayake and Harin Fernando have also been invited to attend the summit.Prof. Maithree Wickremesinghe, Secretary to the Prime Minister Saman Ekanayake, Additional Secretary Saman Athaudahetty and Prime Ministers Special Assistant Sandra Perera will also join the delegation. (CDN)", 
  "title": "PM off to Switzerland today", 
  "url": "https://www.dgi.gov.lk/news/latest-news/495-pm-off-to-switzerland-today"
}