{
  "date": "2017-01-17", 
  "text": "The United Nations and its affiliated bodies would take a serious note on the impending drought situation in Sri Lanka and assured President Mainthipala Sirisena that they would extend fullest cooperation to the Presidential Task Force to provide drought relief.Top level UN officials, including, UN Resident Coordinator and UNDP Resident Representative, Una McCauley, the World Food Programmes (WFP) Representative and Country Director for Sri Lanka, Brenda Barton and Ms. Nina Brandstrup, Chief Technical Advisor at FAO called on President Sirisena at the Presidential Secretariat today (January 16) to discuss issues pertaining to the drought and the relief organization.The UN top officials thanked the President for establishing a Task Force to monitor and supervise the drought relief and assured that they would take every step to bring this impending calamity to the notice of the international community and seek their assistance.The UN representative said as the first step the UN could provide expertise in monitoring, evaluation and communication regarding the drought situation.WFP Representative said that her organization could extend the food or cash for work programme to provide employment to rural people who were denied work because of drought. She said that food/cash for work programme is already in operation in several districts. She said that such assurance of income to people would prevent them from indebtedness as there are instances of private money lenders providing the poor people with loans on exorbitant interest rates. She added that the people should be encouraged to take loans from government agencies that provide soft loans.The UN officials said that one of the main problems of the drought would be the drinking water shortage and that would lead to health issues in the long run. They also discussed the issue of finding an adequate number of bowsers to supply water to drought affected areas.President thanked the UN Heads for their concern over the drought situation and invited them to attend the Task Force meetings every week to further monitor the situation.", 
  "title": "President calls for UN, FAO and WFP involvement in drought relief", 
  "url": "https://www.dgi.gov.lk/news/latest-news/499-president-calls-for-un-fao-and-wfp-involvement-in-drought-relief"
}