{
  "date": "January 18, 2017", 
  "text": "Though the bus service is functioning from every route rail bus service is a solution to the congestion. At times the trains are not running rail bus service is a great option for commuters while the low fare is also a boost for the public to use this service.Since the maintenance cost of rail buses is low compared to trains operating this service is profitable to the Railway Department.The rail bus service from Peradeniya to Gampola was started with the patronage of minister Nimal Siripala De Silva and Deputy minister of Mahaweli Development and Environment Anuraha Jayarathna.Minister De Silva said that this service was a request from the public.At present only 7 percent of the population travel by train. To popularize this service among the public the government together with the ministry will launch a massive development program. For this we have to create a attitude change in the workers as well said the minister.To ease the congestion the Railway Department has decided to promote the rail bus service according to the instructions of Transport and Civil Aviation Minister Nimal Siripala De Silva.  Already the rail bus service is operational from Trincomalee to Galoya, Batticaloa to Galoya, Chilaw to Putlam, Anuradhapura to Medawachchiya, Kurunegala, Mahawa, Peradeniya to Kandy and from Maharagama to Kosgama. A rail bus service from Kandy to Matale will also commence paralelly.Though the bus service is functioning from every route rail bus service is a solution to the congestion. At times the trains are not running rail bus service is a great option for commuters while the low fare is also a boost for the public to use this service.Since the maintenance cost of rail buses is low compared to trains operating this service is profitable to the Railway Department.The rail bus service from Peradeniya to Gampola was started with the patronage of minister Nimal Siripala De Silva and Deputy minister of Mahaweli Development and Environment Anuraha Jayarathna.Minister De Silva said that this service was a request from the public.At present only 7 percent of the population travel by train. To popularize this service among the public the government together with the ministry will launch a massive development program. For this we have to create a attitude change in the workers as well said the minister.", 
  "title": "Rail bus service to be popularized ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/501-rail-bus-service-to-be-popularized"
}