{
  "date": "2017-01-18", 
  "text": "The proposal made by Hon. Lakshman Kiriella, Minister of Higher Education and Highways, to sign a Memorandum of Understanding between the Ministry of Education  Higher Education in United Arab Emirates and Ministry of Higher Education and Highways to strengthen the cooperation in higher education field, was approved by the Cabinet of Ministers.12. Agreement between Sri Lanka and Iran on Science, technology and innovation (Document No  24)The proposal made by Hon. Susil Premajayantha, Minister of Science, Technology and Research, to sign the above agreement during his oncoming official visit to Iran from 14 to 17 January 2017 for strengthening the ties related to above fields, was approved by the Cabinet of Ministers.13. Increasing the annual grant for Sri Lanka Cancer Society (Document No  27)Sri Lanka Cancer Society is a volunteer organization established in 1948 to help cancer patients with the contributions of various donors. Its hospice \"Shantha Sewana\" and \"Bandaranaike Memorial Cancer Home provides free of charge treatments for cancer patients. Considering the service rendered by the said society as a volunteer organization, the proposal made by Hon. (Dr.) Rajitha Senarathne, Minister of Health Nutrition and Indigenous Medicine, to increase the annual grant provided to them from Rs. 550,000 to Rs. 2,000,000, was approved by the Cabinet of Ministers.14. Amendment to the prevention of mosquito breeding act no. 11 of 2007 (Document No  28)Dengue has become a major issue in Sri Lanka and the most fruitful step to face this challenge is to prevent the breeding of mosquitoes. Above act provides the legal framework in this regard and the proposal made by Hon. (Dr.) Rajitha Senarathne, Minister of Health Nutrition and Indigenous Medicine, to instruct the Legal Draftsman to draft amendments to the said act for rectifying deficiencies currently prevailing in the act, was approved by the Cabinet of Ministers.15. Establishment of Public private partnership division (Document No  31)The government has paid its attention to implement its priority projects with public private partnership. Accordingly, the joint proposal made by Hon. Ravi Karunanayake, Minister of Finance and Hon. Malik Samarawickrama, Minister of Development Strategies & International Trade to setup a separate division under the Ministry of Finance with experts in this field to support and advice the relevant ministry on selection, implementation and management of such projects, was approved by the Cabinet of Ministers.16. Providing a land for NIBM to build a new building (Document No  32)Currently about 10,500 students participate in courses conducted by National Institute of Business Management in Colombo 07 and the demand for such courses are gradually increasing. However, there is no sufficient space to cater this demand. Accordingly, the joint proposal made by Hon. Mahinda Samarasinghe, Minister of Skills Development and Vocational Training, and Hon. Duminda Dissanayake, Minister of Agriculture, to grant a land of 45 perches belonging to the Ministry of Agriculture and located nearby, to the NIBM, was approved by the Cabinet of Ministers.17. Allocation of a land in Denzil Kobbekaduwa Mawatha, Battaramulla to the Department of Divineguma Development (Document No  36)The proposal made by Hon. Patali Champika Ranawaka, Minister of Megapolis and Western Development, to release the above land belongs to the Urban Development Authority for building the Head Office of the Department of Divineguma Development, was approved by the Cabinet of Ministers.18. Implementation of municipal solid waste processing projects in Karadiyana and Muthurajawela areas (Document No  37)It has been proposed to implement two projects for generating electricity through waste using the technology of incineration. They are to be implemented under public private partnership and accordingly, the proposal made by Hon. Patali Champika Ranawaka, Minister of Megapolis and Western Development, to award relevant contracts for investors selected through government's procurement procedure, was approved by the Cabinet of Ministers.19. Development and improvement of Godigamuwa Tank in Matale District (Document No  40)The Godigamuwa Tank has a capacity of about 45 acres feet. The proposal made by Hon. Wijith Wijayamuni Zoysa, Minister of Irrigation and Water Resources Management, to develop and improve the said tank to 202 acres feet at a cost of Rs. 165.9 million for providing irrigation water for 162 families in Dambagalla, Bambaragahawatta, and Halambagahawatta villages in Navula area, was approved by the Cabinet of Ministers.20. Amendment of Irrigation Ordinance No. 32 of 1946 to suit timely necessities (Document No  41)Department of Irrigation manages all irrigation related activities in the whole island except Mahaweli area. To perform that responsibility effectively the joint proposal made by Hon. Wijith Wijayamuni Zoysa, Minister of Irrigation and Water Resources Management, and Hon. Duminda Dissanayake, Minister of Agriculture, to amend the above ordinance to suit present day needs, was approved by the Cabinet of Ministers.21. Extension of expired agreement periods of the furnace oil power plants from six (06) months (Document No  48)The proposal made by Hon. Ranjith Siyambalapitiya, Minister of Power and Renewable Energy, to extend the agreement periods with following power plants to face the possible electricity deficit caused by drought, was considered by the Cabinet of Ministers and approved for six (06) months. Ace Power Plant Embilipitiya Ace Power Plant Matara Heladhanavi Power Plant Puttalam22. Procurement of 60 Mw of supplementary power for 06 month period to ensure uninterrupted power supply (Document No  50)According to recommendations made by Public Utilities Commission on the above matter, more generation capacity should be added to the national grid. Accordingly, the proposal made by Hon. Ranjith Siyambalapitiya, Minister of Power and Renewable Energy, to purchase generators of about 60 Mw through Open International Competitive Bidding, to be used in short term generation for about six (06) months, was approved by the Cabinet of Ministers.23. Providing relief under emergency disaster conditions to house holders adversely affected by the water leaks of the main tunnel of the Uma Oya Multipurpose development project (Document No  51)The Uma Oya project is implemented to provide water for Kirindi Oya basin. A leakage in its main tunnel caused damages to houses and wells have dried in 08 Grama Niladhari Divisions. To make this situation to normalcy, the proposal made by H.E. the President Maithripala Sirisena, in his capacity as the Minister of Mahaweli Development and Environment, to provide immediate reliefs such as building new houses for completely damaged houses and provide water supply for free of charge, was approved by the Cabinet of Ministers.24. Implementation of government borrowing programme 2017 (Document No  53)The proposal made by Hon. Ravi Karunanayake, Minister of Finance, to issue Sri Lanka Development Bonds of USD 1,500 million to strengthen the government borrowing programme 2017, was approved by the Cabinet of Ministers.25. Amendment to the Code of Criminal Procedure (Special Provisions) Act No. 2 of 2013 (Document No  54)A bill to provide provisions for securing the rights of detainees was drafted in 2016 but with comments of some interested parties it was not tabled in parliament and instead a new committee was appointed with representatives of Sri Lanka Bar Association and Attorney Generals Department to prepare a more acceptable draft. According to its recommendations, the proposal made by Hon. Wijayadasa Rajapaksa, Minister of Justice, to instruct the Legal Draftsman to draft legislations in this regard and publish in the gazette and subsequently to present it in parliament for approval, was approved by the Cabinet of Ministers.26. Policy and Legal framework relating to the proposed counter terrorism Act of Sri Lanka (Document No  56)The proposal made by Hon. Prime Minister Ranil Wickremesinghe, to forward the amended policy and legal framework for introduction of a new counter terrorism law to the observations of the Sectoral Oversight Committee on National Security and to initiate action to draft suitable legislation with regard to national security of Sri Lanka, Unity and territorial integrity, prevention of terrorism and procedure to be followed in terrorism related offences, was approved by the Cabinet of Ministers.01. Implementation of guidelines for maintaining buildings of public institutions as environmental friendly green buildings (Document No  09) The cabinet has already approved the guidelines for maintaining buildings in public institutions as green buildings. Accordingly, the proposal made by H.E. the President Maithripala Sirisena, in his capacity as the Minister of Mahaweli Development and Environment, to obtain the approval for comprehensive guidelines that include the method of measuring the betterment on environment and the institutional structure required for its implementation, was approved by the Cabinet of Ministers.02. Increasing the awareness of teachers on environmental studies according to the new syllabus (Document No  10)As per the various conventions adopted by politicians and environmental organizations environmentally sensitive sections have been introduced to the new syllabus of science subject from grade 6 to 11, with the view of educating students on facing future challenges of climate change. Accordingly, the proposal made by H.E. the President Maithripala Sirisena, in his capacity as the Minister of Mahaweli Development and Environment, to implement a programme to increase the awareness of teachers on environment studies for changing the attitudes of school children regarding the environment, was approved by the Cabinet of Ministers.03. Providing facilities for medical faculties of the Rajarata and Eastern Universities and Allied health Science faculty of the University of Peradeniya (Document No  11)Providing necessary medical equipment for above faculties is a priority need to uplift their standards. Accordingly, the proposal made by Hon. Prime Minister Ranil Wickremesinghe, in his capacity as the Minister of National Policies and Economic Affairs, to hold discussions and to enter into an agreement for obtaining a loan at concessionary conditions from a Bank in Austria on the above purpose, was approved by the Cabinet of Ministers.04. Agreement between Sri Lanka and Australia for development cooperation (Document No  12)The two countries hold development cooperation for more than 60 years and a memorandum of understanding has been signed in this regard in 1998. Considering the policy changes occurred in two countries the MoU has been prepared again and, the proposal made by Hon. Prime Minister Ranil Wickremesinghe, in his capacity as the Minister of National Policies and Economic Affairs, to sign the said agreement, was approved by the Cabinet of Ministers.05. Obtaining additional funds required for Kalu Ganga Development Project (Document No  13)The project is currently being implemented under the funding of Saudi Fund for Development, Kuwait Fund for Arabic Economic Development, Opec Fund for International Development, and is scheduled to be completed at 2018. USD 89.85 from the total cost of USD 140.35 has been provided by development partners and about USD 50.5 has to be obtained. Accordingly, the proposal made by Hon. Prime Minister Ranil Wickremesinghe, in his capacity as the Minister of National Policies and Economic Affairs, to enter into an agreement with the Kuwait Fund for Arabic Economic Development for obtaining another loan of USD 16.5 for the above purpose, was approved by the Cabinet of Ministers.06. Project for developing market facilities in tourism field (Document No  15)The government of Australia has presented a proposal to implement the above project investing 12 million Australian Dollars within 04 years. The project aims to attract more international customers related to tourism industry. Accordingly, the proposal made by Hon. John Amaratunge, Minister of Tourism Development and Christian Religious Affairs, to enter into an agreement with the Government of Australia with the financial assistance of Australia for implementing the above project, was approved by the Cabinet of Ministers.07. Puttalam Integrated tourism development plan (Document No  16)Puttalam and Kalpitiya are with a greater potential of developing as a main tourism zone in Sri Lanka. Accordingly, the proposal made by Hon. Gamini Jayawickrama Perera, Minister of Sustainable Development and Wildlife, to implement a project under the Puttalam Integrated tourism Development Plan within the two years from 2017 to 2018 with the view of developing this area as a sustainable tourism zone, was approved by the Cabinet of Ministers.08. Hosting the 10th Air Services Negotiation Event of the International Civil Aviation Organization (Document No  18)Above organization has been established as a UN representative agency for management and administration of International Civil Aviation Convention which was signed in 1944. Sri Lanka has obtained its membership in 1948. Conference on Aviation Negotiations has been held annually by this organization for providing a platform for all member states to enter into new negotiations in aviation field. The proposal made by Hon. Nimal Siripala de Silva, Minister of Transport and Civil Aviation, to host the above convention in 2017 to be held in Sri Lanka from 04-08 December 2017, was approved by the Cabinet of Ministers.09. Allocation of a block of land for the embassy of Palestine (Document No  20)The proposal made by Hon. Mangala Samaraweera, Minister of Foreign Affairs, to allocate a land for the Embassy of Palestine for constructing a permanent building in Hewa Avenue, Colombo 07, was approved by the Cabinet of Ministers.10. MoU between Academy of Labour and social Relations of the Russian Federation and the National Institute of Labour studies, Sri Lanka (Document No  21)National Institute of Labour Studies is operating for implementing researches and training programmes for widening the labour studies field and it expects to keep cooperation with foreign institutions and organizations to achieve its goals. Accordingly, the proposal made by Hon. W.D.J. Seneviratne, Minister of Labour and Trade Union Relations, to enter in to a MoU between NILS of Sri Lanka and Academy of Labour and social Relations of Russia, was approved by the Cabinet of Ministers.11. MoU between UAE and Sri Lanka for cooperation in Higher Education Field (Document No  22)The proposal made by Hon. Lakshman Kiriella, Minister of Higher Education and Highways, to sign a Memorandum of Understanding between the Ministry of Education  Higher Education in United Arab Emirates and Ministry of Higher Education and Highways to strengthen the cooperation in higher education field, was approved by the Cabinet of Ministers.12. Agreement between Sri Lanka and Iran on Science, technology and innovation (Document No  24) The proposal made by Hon. Susil Premajayantha, Minister of Science, Technology and Research, to sign the above agreement during his oncoming official visit to Iran from 14 to 17 January 2017 for strengthening the ties related to above fields, was approved by the Cabinet of Ministers.13. Increasing the annual grant for Sri Lanka Cancer Society (Document No  27)Sri Lanka Cancer Society is a volunteer organization established in 1948 to help cancer patients with the contributions of various donors. Its hospice \"Shantha Sewana\" and \"Bandaranaike Memorial Cancer Home provides free of charge treatments for cancer patients. Considering the service rendered by the said society as a volunteer organization, the proposal made by Hon. (Dr.) Rajitha Senarathne, Minister of Health Nutrition and Indigenous Medicine, to increase the annual grant provided to them from Rs. 550,000 to Rs. 2,000,000, was approved by the Cabinet of Ministers.14. Amendment to the prevention of mosquito breeding act no. 11 of 2007 (Document No  28)Dengue has become a major issue in Sri Lanka and the most fruitful step to face this challenge is to prevent the breeding of mosquitoes. Above act provides the legal framework in this regard and the proposal made by Hon. (Dr.) Rajitha Senarathne, Minister of Health Nutrition and Indigenous Medicine, to instruct the Legal Draftsman to draft amendments to the said act for rectifying deficiencies currently prevailing in the act, was approved by the Cabinet of Ministers.15. Establishment of Public private partnership division (Document No  31)The government has paid its attention to implement its priority projects with public private partnership. Accordingly, the joint proposal made by Hon. Ravi Karunanayake, Minister of Finance and Hon. Malik Samarawickrama, Minister of Development Strategies & International Trade to setup a separate division under the Ministry of Finance with experts in this field to support and advice the relevant ministry on selection, implementation and management of such projects, was approved by the Cabinet of Ministers.16. Providing a land for NIBM to build a new building (Document No  32)Currently about 10,500 students participate in courses conducted by National Institute of Business Management in Colombo 07 and the demand for such courses are gradually increasing. However, there is no sufficient space to cater this demand. Accordingly, the joint proposal made by Hon. Mahinda Samarasinghe, Minister of Skills Development and Vocational Training, and Hon. Duminda Dissanayake, Minister of Agriculture, to grant a land of 45 perches belonging to the Ministry of Agriculture and located nearby, to the NIBM, was approved by the Cabinet of Ministers.17. Allocation of a land in Denzil Kobbekaduwa Mawatha, Battaramulla to the Department of Divineguma Development (Document No  36)The proposal made by Hon. Patali Champika Ranawaka, Minister of Megapolis and Western Development, to release the above land belongs to the Urban Development Authority for building the Head Office of the Department of Divineguma Development, was approved by the Cabinet of Ministers.18. Implementation of municipal solid waste processing projects in Karadiyana and Muthurajawela areas (Document No  37)It has been proposed to implement two projects for generating electricity through waste using the technology of incineration. They are to be implemented under public private partnership and accordingly, the proposal made by Hon. Patali Champika Ranawaka, Minister of Megapolis and Western Development, to award relevant contracts for investors selected through government's procurement procedure, was approved by the Cabinet of Ministers.19. Development and improvement of Godigamuwa Tank in Matale District (Document No  40)The Godigamuwa Tank has a capacity of about 45 acres feet. The proposal made by Hon. Wijith Wijayamuni Zoysa, Minister of Irrigation and Water Resources Management, to develop and improve the said tank to 202 acres feet at a cost of Rs. 165.9 million for providing irrigation water for 162 families in Dambagalla, Bambaragahawatta, and Halambagahawatta villages in Navula area, was approved by the Cabinet of Ministers.20. Amendment of Irrigation Ordinance No. 32 of 1946 to suit timely necessities (Document No  41)Department of Irrigation manages all irrigation related activities in the whole island except Mahaweli area. To perform that responsibility effectively the joint proposal made by Hon. Wijith Wijayamuni Zoysa, Minister of Irrigation and Water Resources Management, and Hon. Duminda Dissanayake, Minister of Agriculture, to amend the above ordinance to suit present day needs, was approved by the Cabinet of Ministers.21. Extension of expired agreement periods of the furnace oil power plants from six (06) months (Document No  48)The proposal made by Hon. Ranjith Siyambalapitiya, Minister of Power and Renewable Energy, to extend the agreement periods with following power plants to face the possible electricity deficit caused by drought, was considered by the Cabinet of Ministers and approved for six (06) months. Ace Power Plant Embilipitiya Ace Power Plant Matara Heladhanavi Power Plant Puttalam22. Procurement of 60 Mw of supplementary power for 06 month period to ensure uninterrupted power supply (Document No  50)According to recommendations made by Public Utilities Commission on the above matter, more generation capacity should be added to the national grid. Accordingly, the proposal made by Hon. Ranjith Siyambalapitiya, Minister of Power and Renewable Energy, to purchase generators of about 60 Mw through Open International Competitive Bidding, to be used in short term generation for about six (06) months, was approved by the Cabinet of Ministers.23. Providing relief under emergency disaster conditions to house holders adversely affected by the water leaks of the main tunnel of the Uma Oya Multipurpose development project (Document No  51)The Uma Oya project is implemented to provide water for Kirindi Oya basin. A leakage in its main tunnel caused damages to houses and wells have dried in 08 Grama Niladhari Divisions. To make this situation to normalcy, the proposal made by H.E. the President Maithripala Sirisena, in his capacity as the Minister of Mahaweli Development and Environment, to provide immediate reliefs such as building new houses for completely damaged houses and provide water supply for free of charge, was approved by the Cabinet of Ministers.24. Implementation of government borrowing programme 2017 (Document No  53)The proposal made by Hon. Ravi Karunanayake, Minister of Finance, to issue Sri Lanka Development Bonds of USD 1,500 million to strengthen the government borrowing programme 2017, was approved by the Cabinet of Ministers.25. Amendment to the Code of Criminal Procedure (Special Provisions) Act No. 2 of 2013 (Document No  54)A bill to provide provisions for securing the rights of detainees was drafted in 2016 but with comments of some interested parties it was not tabled in parliament and instead a new committee was appointed with representatives of Sri Lanka Bar Association and Attorney Generals Department to prepare a more acceptable draft. According to its recommendations, the proposal made by Hon. Wijayadasa Rajapaksa, Minister of Justice, to instruct the Legal Draftsman to draft legislations in this regard and publish in the gazette and subsequently to present it in parliament for approval, was approved by the Cabinet of Ministers.26. Policy and Legal framework relating to the proposed counter terrorism Act of Sri Lanka (Document No  56)The proposal made by Hon. Prime Minister Ranil Wickremesinghe, to forward the amended policy and legal framework for introduction of a new counter terrorism law to the observations of the Sectoral Oversight Committee on National Security and to initiate action to draft suitable legislation with regard to national security of Sri Lanka, Unity and territorial integrity, prevention of terrorism and procedure to be followed in terrorism related offences, was approved by the Cabinet of Ministers.", 
  "title": "DECISIONS TAKEN BY THE CABINET OF MINISTERS AT ITS MEETING HELD ON 10-01-2017", 
  "url": "https://www.dgi.gov.lk/news/latest-news/503-decisions-taken-by-the-cabinet-of-ministers-at-its-meeting-held-on-10-01-2017"
}