{
  "date": "2017-01-18", 
  "text": "The Treasury Secretary has informed secretaries of all line ministries to take necessary actions to implement all development proposals made by Budget 2017 for each ministry.These proposals in the budget which have already been passed by parliament will be implemented through relevant ministries and their affiliated institutions.Certain budget proposals in the past were not implemented properly during the targeted period of time thereby the country lost expected benefits. The prime objective of this program is to ensure the proper implementation of all the development projects proposed by Budget 2017 in time.The Ministry of Finance has summarized in a report to all ministry secretaries about the projects coming under the purview of each ministry and, how such projects proposed by the budget are implemented. This report also includes details with regard to new laws to be introduced if necessary.The report has further advised ministry secretaries to prepare an action plan and implement all the projects and proposals made by the budget within this year in order to eradicate poverty, generate employment enabling the public to increase their income.Budget 2017 has proposed 325 projects to be implemented and, National Budget Department has allocated necessary funds for each ministry to implement them hassle free.Accordingly, Treasury Secretary Dr. R.H.S. Samaratunga has already informed ministry secretaries to prepare procurement plans and action plans with immediate effect and submit them to the Director General Budget Department to enable him to provide necessary grants for each project.Certain budget proposals were implemented with effect from the very midnight following the budget was presented to parliament and the responsibility of implementing the balance is left with the respective ministries and their regulatory bodies.Accordingly, prices of several essential commodities including kerosene, sugar, canned fish and powdered milk have already been dropped.Relevant Acts and regulations introduced under a move to simplifytax system will be implemented with effect from 01.04.2017. The specific feature in preparing budget this time is that the inclusion of proposals by people from all walks of life including ordinary people, businessmen and professionals. Tourism has been bouncing back in the country and a group of businessmen engaged in transporting tourists requested assistance to improve the sector. Accordingly, new regulations with regard to leasing loans for vehicles will not be applied to transport service providers in the tourism sector. They will be able to enjoy 100% loan facilities to lease out vehicles. At the same time, university scholars who brought forward research details pointed out the need for a regulatory body with regard to three wheelers. Budget 2017 which welcomed the argument by university experts has proposed new regulations in leasing out three wheelers. Accordingly, Finance Minister Ravi Karunanayake proposed in Budget 2017 that loan to value ratio should be 25% for three wheelers, 50% for motor cars and vans and 90% for lorries and buses.Therefore, Central Bank of Sri Lanka has advised commercial banks and leasing companies to follow new regulations in granting loans for vehicle leasing including three wheelers.Currently, loans can be borrowed after paying 10% of the total value of a three wheelerwhich a borrower intends to buy. In the future, under the new leasing regulations, 25% of the total value of a three wheeler should be paid instead. Proposed traffic laws and spot fines are scheduled to be revised in the near future and the Finance Ministry believes that the new regulations imposed on loans will make an impact on leasing out of three wheelers.325 projects have been proposed to be implemented within this year. Each line ministry and its affiliated bodies should prepare their own action plans to properly implement the proposed projects which have been earmarked for each ministry. Treasury Secretary Dr. R.H.S. Samaratunga has informed all ministry secretaries to set up task force to assess the performance of each project and inform the outcome monthly to the Treasury.", 
  "title": "New leasing scheme proposed by Budget 2017 to be implemented", 
  "url": "https://www.dgi.gov.lk/news/latest-news/505-new-leasing-scheme-proposed-by-budget-2017-to-be-implemented"
}