{
  "date": "January 23, 2017", 
  "text": "Chairman, Hinduja Group of companies Gopichand P. Hinduja said that they are interested in investing in the oil refinery sector in Sri Lanka. He also said that they are interested in the sectors of transport and tourism too.Chairman, Standard Chartered Bank Jose Vinals said that the bank is interested in getting involved practically in the development of Sri Lanka. He said that Standard Chartered Bank is organizing a high level Sri Lankan Business Summit in March in London.Chairman and CEO of Arsalar Mittal, Lakshmi N. Mittal, one of the biggest steel manufacturers in the world at a meeting with Prime Minister Ranil Wickremesinghe discussed about the investment opportunities opening in Sri Lanka in the future.CEO of Dubai International Investment Corporation Alsha Ibani during the meeting with PM Wickremesinghe explained about the international investments they have done and discussed about the investment opportunities in Sri Lanka.Chairman and CEO of PE Transport Company Ms Jamie Miller said that their company is keen to work closely with Sri Lanka and invest as well.Large number of internationally recognized entrepreneurs met Prime Minister Ranil Wickremesinghe and exchanged ideas about investing in Sri Lanka on the sidelines of the World Economic Summit in Switzerland. Chairman, Hinduja Group of companies Gopichand P. Hinduja said that they are interested in investing in the oil refinery sector in Sri Lanka. He also said that they are interested in the sectors of transport and tourism too.Chairman, Standard Chartered Bank Jose Vinals said that the bank is interested in getting involved practically in the development of Sri Lanka. He said that Standard Chartered Bank is organizing a high level Sri Lankan Business Summit in March in London.Chairman and CEO of Arsalar Mittal, Lakshmi N. Mittal, one of the biggest steel manufacturers in the world at a meeting with Prime Minister Ranil Wickremesinghe discussed about the investment opportunities opening in Sri Lanka in the future.CEO of Dubai International Investment Corporation Alsha Ibani during the meeting with PM Wickremesinghe explained about the international investments they have done and discussed about the investment opportunities in Sri Lanka.Chairman and CEO of PE Transport Company Ms Jamie Miller said that their company is keen to work closely with Sri Lanka and invest as well.", 
  "title": "Number of internationally recognized entrepreneurs met PM Wickremesinghe", 
  "url": "https://www.dgi.gov.lk/news/latest-news/523-number-of-internationally-recognized-entrepreneurs-met-pm-wickremesinghe"
}