{
  "date": "2017-01-24", 
  "text": "The European Investment Bank will provide EUR 50 million to support improvement and expansion of sewage networks across Colombo. The new loan will help Colombo Municipal Council to achieve its goal of providing full sanitation coverage to benefit people living and working in the greater Colombo area.   The new EIB loan is European Investment Banks first ever support for water investment in Sri Lanka and the first loan for public sector investment agreed with the new post civil-war government.New support from the European Investment Bank will help unlock essential new investment to improve sanitation in Colombo. I look forward to strengthening cooperation between the EIB and Sri Lanka in the years to come. confirmed Ravi Karunanayake, Minister of Finance of Sri Lanka following his meeting in Brussels with senior European Investment Bank officials responsible for lending in South Asia.Increased access to sanitation to be achieved by this project will improve the lives of thousands of people living in Colombo and contribute to achievement of sustainable development goals in Sri Lanka. The European Investment Bank is pleased to be working closely with partners in Sri Lanka to ensure an environmentally sustainable future for the countrys capital and is grateful for the excellent cooperation with the Asian Development Bank in our first joint support in the country.The fruitful discussions with Ministers Karunanayake and Samarawickrama have outlined how the EIBs global experience can support new investment to improve lives and enhance opportunities in Sri Lanka. said Andrew McDowell, European Investment Bank Vice President.\"This loan is a further example of the European Union's support for Sri Lanka's long-term development. Studies show that modern sanitation is one of the most important factors in people's health and well-being. In addition, water supplies in many developing countries are under growing pressure from urbanisation and climate change, which puts a premium on the efficient use of those resources. We are pleased to provide assistance to help address these challenges and improve access to water and sanitation for the people of Colombo,\" said Tung-La Margue, European Union Ambassador to Sri Lanka and the Maldives.The 25 year long-term was formally agreed at a signature ceremony in Brussels by Ravi Karunanayake, Minister of Finance Malik Samarawickrama, Minister of Development Strategies and International Trade of Sri Lanka and Andrew McDowell, European Investment Bank Vice President responsible for lending operations in South Asia. The new loan represented the EIBs fifth sovereign loan in the country.The existing water supply and sewage network in Colombo was built a hundred years ago and is not adequate for the citys needs. Once complete the upgraded water network will enable clean water to be supplied 24 hours a day and seven days a week, compared to the currently heavily restricted service.The new water investment program will include provision of a new sewage network in currently un-served areas of Kirillopone. Under the initiative a new wastewater treatment facility will also be built to reduce pollution at the Wellawatta sea outfall.\"It is encouraging to see others joining in this effort to improve Colombo city dwellers quality of life which will cater to the increasing demand in the city for improved water and wastewater services, said Sri Widowati, Country Director, Sri Lanka Resident Mission, Asian Development Bank.The new European Investment Bank loan to the Government of Sri Lanka will be used to finance investment work being undertaken by the Colombo Municipal Council. The Asian Development Bank will also support the water investment project and this new initiative marks the first time that the European Investment Bank has financed a project alongside another International Financial Institution in Sri Lanka.The European Investment Bank has supported investment in Sri Lanka since 2002 including backing climate related investment, private companies and post-tsunami recovery.The European Investment Bank is the worlds largest international public bank and one of the largest lenders for water investment worldwide. Over the last decade the European Investment Bank has provided more than EUR 37 billion for water related investment in 67 countries around the world.", 
  "title": "EIB confirms backing for Colombo water network", 
  "url": "https://www.dgi.gov.lk/news/latest-news/527-eib-confirms-backing-for-colombo-water-network"
}