{
  "date": "2017-01-25", 
  "text": "Marking yet another significant landmark in the naval history, the Sri Lanka Navys Inshore Patrol Craft (IPC) Construction Project was recognized with ISO 9001:2015 standards conferred by the Sri Lanka Standards Institution.The ISO certificate awarding ceremony which was held at the Admiral Somathilake Dissanayake Audititium at SLNS Parakrama yesterday (24) was graced by the Commander of the Navy, Vice Admiral Ravindra Wijegunaratne, as the Chief Guest.Speaking on the occasion, the Director General Engineering said that this facility which was inaugurated in early 2000, had grew from strength to strength over the years rendering its fullest assistance to the motherland with its indigenously built IPCs. Besides, the craftsmanship, ability and high class efficiency of the naval technicians have also brought much fame to the Navy through their innovation, he opined further.Addressing the distinguished gathering, the Commander of the Navy recalled the early days of the Inshore Patrol Craft Construction Project and expressed his heartfelt gratitude to all naval personnel who performed an admirable service to the development of the project right from its inception. He also appreciated the Sri Lanka Standards Institution and its officials for conferring the ISO 9001:2015 standards on the IPC Construction Project.Moreover, he made a special mention of the invaluable service rendered by the navy-built boats and craft for the elimination of terrorism from the motherland.Subsequently, the ceremony saw that ISO 9001:2015 certification was handed over to the Director General Engineering. The Chairman of Sri Lanka Standards Institution, Mr. Pradeep Gunawardana, Director General, Mr. Gamini Dharmawardena, Director Generals from the Navy, senior officers and sailors were also present on this occasion. Mementoes were also exchanged to mark the significance of this event.", 
  "title": "Navys Inshore Patrol Craft Construction Project recognized with ISO 9001:2015 standards", 
  "url": "https://www.dgi.gov.lk/news/latest-news/535-navy-s-inshore-patrol-craft-construction-project-recognized-with-iso-9001-2015-standards"
}