{
  "date": "2017-01-26", 
  "text": "The Ministry of Finance will be holding the eleventh Forum of the Ease of Doing Business tomorrow (27) January 2017 at 2.00 pm at the 4th Floor Auditorium of MILODA, Academy of Financial Studies, (Old Times Building), Sir Razik Fareed Mawatha, Colombo-01.Ease of Doing, a special forum held by the Finance Ministry under the patronage of Minister of Finance Ravi Karunanayake has so far paved dividend to businesses by way of removing the impediments that are on their way to bring investment and trade opportunities to the countryOffering of self-inquiry credit report online to public by the CRIB, removal of Radiation testing on imported fish, amending policies to permit abandoned fisheries harbours to carry out boat repairing and related activities thereby increasing the opportunity to bring foreign exchange revenue in to the country are some of the recent outcome of this forum.The Forum will be chaired by Honorable Ravi Karunanayake, Minister of Finance. Honorable Lakshman Yapa Abeywardena, State Minister of Finance, Honorable Rishad Bathiudeen, Minister of Industry and Commerce, Honorable Kabir Hashim, Minister of Public Enterprise Development, Honorable Malik Samarawickrama, Minister of Development Strategy and International Trade, Dr.Indrajith Coomaraswamy, Governor of the Central Bank of Sri Lanka, Dr. R H. S. Samarathunga, Secretary to the Treasury, Advisor to Hon. Prime Minister Mr. Charitha Ratwatte and Advisor to the Ministry of National Policy and Economic Affairs, Mr. R. Paskaralingam are expected to participate at this Forum.This Forum will provide a live platform to address the procedural and regulatory issues of the private sector entities and facilitate in finding on-the-spot solutions to uplift the doing-business environment in Sri Lanka. The Ministry of Finance cordially invites the private sector establishments and the general public to partake in this forum.", 
  "title": "Ease of Doing Business Forum which brings dividends to business  Meets tomorrow", 
  "url": "https://www.dgi.gov.lk/news/latest-news/545-ease-of-doing-business-forum-which-brings-dividends-to-business-meets-tomorrow"
}