{
  "date": "January 26, 2017", 
  "text": "The total debt stock of Sri Lanka has gone up by 233% to Rs.7, 391 billion during the period from 2005 to 2014. The total debt burden of Sri Lanka in 2005 was Rs.2, 222 billion and, within 5 years, it increased up to Rs.4, 590 billion in 2010. In addition there is another Rs 2,000 billion debt obtained by the Public owned Enterprises directly off the balance sheet.Accordingly, the debt servicing (loan installments and the interest) to be paid by Sri Lanka to foreign financiers is also increasing constantly. The debt servicing of US$ 1,828 million paid in 2016 will be increased by more than double to US$3,992 million being the highest debt repayment to be paid by Sri Lanka in a year due to colossal borrowings by the previous government. This could be considered as the highest sum of debt servicing to be repaid by Independent Sri Lanka within a year.According to Finance Minister Ravi Karunanayake, Sri Lanka is embroiled in a gigantic debt trap. The main reason is that the loans obtained by the previous regime for infrastructure development has not brought any returns on its investments. Further the national revenue and the export earnings constantly came down since 2011 up to year 2014.Developed countries use their own resources to build mega size infrastructure facilities such as ports and airports. Developing countries tent invite foreign investors to build such huge projects instead as their economies cannot afford the high cost of large scale projects. Alternatively, foreign investors are invited to construct such infrastructure under Build, Operate and Transfer basis or Build, Own and Operate called BOO/BOT basis as in such an instance the developing countries need not bear the burden of debt repayment .Sri Lanka also in the past eveloped telecommunication system in the island on BOO/BOT basis. While it enables investors to regain dividends for the investment during a given time and, simultaneously, it does not make developing countries to pass the burden of investment on its poor citizens.Before launching mega projects of Ports, Airports and Express ways, there were unsolicited proposals to build Hambantota Port, Mattala Airport and southern express ways which could be easily carried out on BOO/BOT basis during the previous regime. But, unfortunately, the former regime opted to borrow unprecedentedly to build them. Consequently, Hambantota Port and Mattala Airport became loss making entities while leaving the country and people in an unbearable debt trap.The previous government had obtained US$1,303 million for the Hambantota Port and the first phase of the credit of Rs.340 million was released on a 6% interest. In addition, 6% insurance premium should also be paid for the loan. Another US$ 4.5 billion had been obtained through International Sovereign Bond during the period between 2010 and 2014. This sovereign bond should be repaid in full as one billion dollar per annum from its maturity in 2019. However, the repayment of all these project loans and bonds began after 2014. Although the country or its people receive no dividends from these Port and Air Port projects built on foreign loans by the previous regime, the current government has been compelled to repay installments and interest for such loans with effect from 2015 though they do run at a loss.Accordingly, Sri Lanka is compelled to make the repayment on foreign loans as follows:Total amount paid in 2014 - US$ 1,442 millionTotal amount paid in 2015 - US$ 2,031 millionTotal amount paid in 2016 - US$ 1,828 millionTotal amount should be paid in 2017 - US$ 2,417 millionTotal amount should be paid in 2018 - US$ 2,564 millionTotal amount should be paid in 2019 - US$ 3,992 millionTotal amount should be paid in 2020 - US$ 3,463 million.This debt repayment covers only the project loans and the International sovereign bond. The liability on the loan obtained from the IMF and the investment by foreigners on the treasury bills and treasury bonds is to be paid separately.Its unfortunate that the previous government did not have any strategy to turn such giant loss making entities in to profit making ventures. Therefore, the current government has made arrangements to convert these credits in to equity under the Public Private Partnership concept thereby relieving the people from the debt burden. While the government is taking untiring efforts to convert these white elephants into profit making institutions, and generate income and employment for the youth in the country, an opposition group is engaged in sabotaging such efforts charging that the government is attempting to sell off national resources to foreigners. It is high time people thought rationally in response to such misleading remarks made by these rival groups.At the same time, people should ask the opposition who make an abortive attempt to jeopardize the well being of the people to show some avenues to generate income for the country to repay the massive loans accumulated by 2019 which were obtained by the previous government.Meanwhile, Finance Minister Ravi Karunanayake said the current government is engaged in a mission to bring investment to the country thereby generating employment and income to the country. He said that will save the country from the existing foreign debt burden. Therefore, Minister Karunanayake said that for no reason, opportunists will be allowed to sabotage the ongoing development operation by the current government.", 
  "title": "Sri Lankas highest foreign debt repayment of US D 4000 million due in 2019", 
  "url": "https://www.dgi.gov.lk/news/latest-news/546-sri-lanka-s-highest-foreign-debt-repayment-of-us-d-4000-million-due-in-2019"
}