{
  "date": "2017-01-27", 
  "text": "The proposal for the national policy on general education which includes the proposals on the reforms in the education sector of the country was presented to President Maithripala Sirisena yesterday (Jan. 26) at the Presidents Official Residence.These proposals have been formulated by the National Education Commission, established to advice the government on the education policies. When we pay attention on the education policies of the country, it is seen that policies havent been implemented for the children to rise with self-efforts without depending on the school syllabus, the President said speaking at this occasion.He pointed out the necessity to give the children an opportunity to come up with their skills and abilities through operating such education policies.He stated that the issue of unequal distribution of the human and physical resources in the education sector has not yet been solved. Still there are many schools island-wide even without basic facilities. The prior attention of all authorized people should be drawn towards this issue, the President said.President Sirisena also recalled the difficulty faced by the children due to the competition over the Grade 5 scholarship exam and the attitude of the parents on that regard. Comprehensive attention should be paid on this issue when forming educational reforms, he said.We cannot take advantages from any development activity if the children of the country would not get a better education, the President stated. He pointed out the importance of discussing about new changes to be made. National Education Commission, National Institute of Education and the provincial educational institutes should meet at least once in six months and discuss about these new changes, the President said.Secretary to the President P. B. Abeykoon, President of the National Education Commission Prof. Lakshman Jayathilaka and the Director of the National Institute of Education Dr. Jayanthi Gunasekara were among those participated in this occasion.", 
  "title": "Proposal for national policy on education presented to President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/547-proposal-for-national-policy-on-education-presented-to-president"
}