{
  "date": "January 27, 2017", 
  "text": "The Minister of Education Akila Viraj Kariyawasam instructed the Director General of Archeology Professor Senarath Dissanayaka to take immediate actions to maintain the archeological premises so as to attract the tourists and to reach speedily the expected targets in the work of archeological conservations. He mentioned this while participating in a meeting of the executive officers of the Ministry of Education. It was revealed at this occasion that nearly 120 vacancies in several posts such as the Director, Assistant Director, Regional Officers, Technical Officers, Designers and Management assistants have not been filled. Drawing his special attention to this matter The Minister of Education Akila Viraj Kariyawasam instructed the Director General of Archeology to publish these vacancies in the gazette. The archeological conservation activities in several parts of the country including the North and East have been already started by the Department of Archeology and the conservation activities of several places with archeological value including Buddhist shrines, Hindu religious centers and mosques in those areas are being implemented.The Minister of Education Akila Viraj Kariyawasam discussed in detail the future activities of the Department of Archeology and the practical problems they face and instructed the officers to expedite the conservation activities at the archeological places destroyed due to the war in the recent past and to take actions to conserve these places irrespective of racial and religious differences. The minister also instructed to take immediate measures to provide residential facilities to the members of Civil Defense Force appointed to protect the Archeological sites under the instructions of the President Maithreepala Sirisena. He also instructed the Director General of Archeology to make the minister aware of any practical problem arising in the work of archeological conservations", 
  "title": "Expedite the conservation of archeological places destroyed by war ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/548-expedite-the-conservation-of-archeological-places-destroyed-by-war"
}