{
  "date": "January 27, 2017", 
  "text": "This is a major step by our Foreign Ministry and our capable Minister Samaraweera since the time the Foreign Ministry was established in 1948 said Minister of Industry and Commerce Rishad Bathiudeen yesterday (26th Jan) in Jaffna. Minister Bathiudeen was addressing the inaugural event of Sri Lankas first Regional Consular Office (RCO) of Foreign Ministry in Jaffna. The RCO is the result of the vision of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe of enhancing the efficiency and effectiveness of service delivery to the public. The vision of the unity government of the President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe fulfils the need for obtaining the services of government institutions in Colombo to various provinces so that all citizens can access such important services without going through the trouble of long distance travel and other inconveniences said Minister Bathiudeen and added: This is a major step by our Foreign Ministry and our capable Minister Samaraweera since the time the Foreign Ministry was established in 1948. Sri Lanka is historically placed at a strategic location in the Indian ocean and for hundreds of years we have been functioning as a South Asian trading hub in addition to be recognized for our strategic location. For decades our international relations have been influenced by this location. All the governments of Sri Lanka since our independence conducted their international relations keeping this in their minds. On the other hand just as reaching out, our Foreign Ministry needs to spread internally as well and todays initiative supports this need greatly. Therefore Today we witness an important milestone pioneered by our capable Minister of Foreign Affairs Mangala Samaraweera and joined by many other leading figures of the Cabinet and opposition and we wish him great success in this.", 
  "title": "Establishing Consular Office in Jaffna Major Step by Foreign Ministry - Minister Bathiudeen ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/549-establishing-consular-office-in-jaffna-major-step-by-foreign-ministry-minister-bathiudeen"
}