{
  "date": "2017-01-31", 
  "text": "We should get together and jointly struggle not for the power but for solving problems by building the country, says President Maithripala Sirisena.Though some groups are fighting by demanding power, nobody can even think of getting the power before the decision of the people at an election to be held in 2020, he added.People can fight for political objectives during an election. But when a new government, elected by the people is taking the country forward it is the responsibility of all politicians who love the country to support the program of the government, forgetting their narrow political ambitions, he further stated.The President was speaking at the inauguration ceremony of the Moneragala, Kumbukkan Oya Reservoir Project held today (Jan. 28).The project is carried out at a cost of Rs. 31, 000 million to make the lives of the people in the areas prosperous.Under this project, the water will be provided for agricultural activities while supplying required pure drinking water to the people, helping the prevention of kidney diseases. The people in the areas; Moneragala, Buttala and Siyambalanduwa will receive the benefits of this project. The project aims to develop 3100 acres of agriculture, harvest of 10,315 acres and generate electricity.The President inaugurated the work of the project at the auspicious time at the Kumbukkan Oaya Amuna.Speaking further, the President said that the government has already started the required program to develop agricultural sector by enhancing the living standard of the people. The government has already taken actions to renovate small and medium tanks and implement of building of new tanks, he said.The President assured that no issue will be arisen in the resettlement of the people who will lose their lands due to mega irrigation projects.The government will act to allocate all required funds for the development of Moneragala District and solve the problems of the people living there, the President stated.Ministers Vijith Vijayamuni de Soysa, Ranjith Maddumabandara, Deputy Minister Sumeda G. Jayasena and the Director of the Special Projects of Uva Province Jagath Pushpakumara were among those participated in this event.", 
  "title": "We should jointly struggle to build nation, not for power  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/551-we-should-jointly-struggle-to-build-nation-not-for-power-president"
}