{
  "date": "2017-01-31", 
  "text": "He said that the government expects to develop tourism in the eastern coast. Anuradhapura will also be developed as a center of the Cultural Triangle.This is the last chance for the youth of the country as well as to develop the country. That is why we invite everyone to join us to bring the country forward without any division, the Premier said.I have not forgotten the difficulties suffered by the UNPers. We should assist them. They should be given jobs. I have already instructed the General Secretary of the Party Minister Kabir Hashim to first look into the party supporters who suffered revenge. Those who are to begin small enterprises should be given loans. Number of youth should be given job training, he added.PM Wickremesinghe further said that nobody would be allowed to disrupt these programs carried out by the Party and he had instructed the Chairman of UNP to begin the re-organization of the party. The development of the country and the National harmony should be protected, urged the Premier.Government has planned to develop Trincomalee harbor and discussions are being held with the governments of Japan and India, said Prime Minister Ranil Wickremesinghe. He said that developing the Harbor in Trincomalee will create more job opportunities for the youth from Horowpathana and Anuradhapura areas.The Prime Minister made these remarks at a meeting with UNP activists in the Anuradhapura district at the Anuradhapura Youth Resort auditorium.He said that the government expects to develop tourism in the eastern coast. Anuradhapura will also be developed as a center of the Cultural Triangle.This is the last chance for the youth of the country as well as to develop the country. That is why we invite everyone to join us to bring the country forward without any division, the Premier said.I have not forgotten the difficulties suffered by the UNPers. We should assist them. They should be given jobs. I have already instructed the General Secretary of the Party Minister Kabir Hashim to first look into the party supporters who suffered revenge. Those who are to begin small enterprises should be given loans. Number of youth should be given job training, he added.PM Wickremesinghe further said that nobody would be allowed to disrupt these programs carried out by the Party and he had instructed the Chairman of UNP to begin the re-organization of the party. The development of the country and the National harmony should be protected, urged the Premier.", 
  "title": "Discussions are underway to develop Trinco Harbor  PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/552-discussions-are-underway-to-develop-trinco-harbor-pm"
}