{
  "date": "January 31, 2017", 
  "text": "The two Ministers met with leading Belgian and European companies at a business roundtable hosted by Flanders Investment & Trade (FIT) and engaged in a productive interactive dialogue.These companies expressed keen interest to develop commercial ties with Sri Lanka following the recent announcement by the European Commission on the restoration of the GSP+ facility.Minister Karunanayake and Vice President of the European Investment Bank (EIB) Andrew McDowell signed a Euro 50 million Financing Agreement for the Greater Colombo Wastewater Management Project at the EIB Office in Brussels. Minister also met his Belgian counterpart Johan Van Overtveldt and discussed the possibility of upgrading Sri Lanka's credit rating within the OECD mandate and obtaining technical assistance from Belgium to train Sri Lankan officials in several key sectors. In this regard Minister Karunanayake also met with Dirk Terweduwe, CEO of Credendo, the Chair of the OECD Working Group of Experts and discussed modalities on expeditious upgrading of Sri Lanka's credit rating.Minister Malik Samarawickrama also met his counterpart Belgian Secretary of State for Foreign Trade Pieter De Crem and discussed ongoing projects in Sri Lanka to which Belgium has extended grant assistance amounting to USD 41.46 million including the 7 railway bridges project and the Moneragala-Buttala Water Supply Project which are to be completed this year. Belgium will make all efforts to benefit from the favourable investment climate in Sri Lanka following the decision of the EU to restore EU GSP+.The two Ministers met European Commissioner for Development Cooperation Neven Mimica at the European Commission and discussed ongoing development assistance programmes funded by the EU including the integrated rural development programme in the Central and Uva Provinces to improve livelihood, access to drinking water and healthcare services. They also sought EU assistance for the development of the SME sector and green energy projects. A programming mission is to shortly undertake a visit to Sri Lanka to identify projects in keeping with the priorities of the Government of Sri Lanka.The Ministers discussed follow up action on the discussions that took place during the visit of Prime Minister Ranil Wickremesinghe to Brussels in October last year.Sri Lanka's Ambassador to Belgium, Luxembourg and the European Union Rodney Perera and Embassy Officials participated in the meetings.Finance Minister Ravi Karunanayake and Development Strategies and International Trade Minister Malik Samarawickrama recently concluded a one day official visit to Brussels. The two Ministers met with leading Belgian and European companies at a business roundtable hosted by Flanders Investment & Trade (FIT) and engaged in a productive interactive dialogue.These companies expressed keen interest to develop commercial ties with Sri Lanka following the recent announcement by the European Commission on the restoration of the GSP+ facility.Minister Karunanayake and Vice President of the European Investment Bank (EIB) Andrew McDowell signed a Euro 50 million Financing Agreement for the Greater Colombo Wastewater Management Project at the EIB Office in Brussels. Minister also met his Belgian counterpart Johan Van Overtveldt and discussed the possibility of upgrading Sri Lanka's credit rating within the OECD mandate and obtaining technical assistance from Belgium to train Sri Lankan officials in several key sectors. In this regard Minister Karunanayake also met with Dirk Terweduwe, CEO of Credendo, the Chair of the OECD Working Group of Experts and discussed modalities on expeditious upgrading of Sri Lanka's credit rating.Minister Malik Samarawickrama also met his counterpart Belgian Secretary of State for Foreign Trade Pieter De Crem and discussed ongoing projects in Sri Lanka to which Belgium has extended grant assistance amounting to USD 41.46 million including the 7 railway bridges project and the Moneragala-Buttala Water Supply Project which are to be completed this year. Belgium will make all efforts to benefit from the favourable investment climate in Sri Lanka following the decision of the EU to restore EU GSP+.The two Ministers met European Commissioner for Development Cooperation Neven Mimica at the European Commission and discussed ongoing development assistance programmes funded by the EU including the integrated rural development programme in the Central and Uva Provinces to improve livelihood, access to drinking water and healthcare services. They also sought EU assistance for the development of the SME sector and green energy projects. A programming mission is to shortly undertake a visit to Sri Lanka to identify projects in keeping with the priorities of the Government of Sri Lanka.The Ministers discussed follow up action on the discussions that took place during the visit of Prime Minister Ranil Wickremesinghe to Brussels in October last year.Sri Lanka's Ambassador to Belgium, Luxembourg and the European Union Rodney Perera and Embassy Officials participated in the meetings.", 
  "title": "Two top Sri Lankan Ministers meet leading Belgian and European companies ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/553-two-top-sri-lankan-ministers-meet-leading-belgian-and-european-companies"
}