{
  "date": "February 01, 2017", 
  "text": "President Maithripala Sirisena says he would introduce a new programme for eradication of Dengue in addition to the existing dengue prevention programmes.He requested the assistance from all citizens in the country make this programme a success.The President was speaking at a ceremony to open the new building at the National Dental Hospital and to lay the foundation stone for another building for the hospital yesterday (Jan. 31).He stated that few hospitals being constructed to strengthen the free health service will be vested with people near future. The government will provide all required facilities for the health sector to protect the lives of the people, he said.The President recalled about the lack of the specialist doctors and nurses has been a critical issue. He mentioned that there are challenges in the system to appoint new doctors to the hospitals. He commended the service rendered by the health staffs in the health sector.President Sirisena recalled some persons did not allow him to implement some programmes for the progress of the health sector during his tenure as the Health Minister. The President totally rejected the rumours alleging that he influences over the new doctors appointments to the hospital.I have given the freedom and made an environment to my ministers so that they can provide better service to the people. They can work without any disturbance form unwanted interferences, he said.The President unveiled the plaque to open the nine-storied building, constructed at a cost of Rs. 1200 million. He also registered the first patient through the new computer software system.After observing the units of the hospital, he laid the foundation stone for the second building to be constructed.Acting Director General of Health, Dr Jayasundara Bandara presented a souvenir to the President at this occasion.Chief Incumbent of Vijayarama, Wellawatta, Adhikarana Sangha Nayaka of the Amarapura dhammarakkitha Maha Nikaya Ven. Ahangama Ananda thero, Director Hospital Service Council Ven. Rajawelle Subhuthi Thero(MA.Pandith), Minister Rajitha Senarathne, Deputy Minister Faizal kasim, Secretary to the Ministry Anura Jayawickrama and the Director of the National Dental Teaching Hospital Doctor Pushpa Gamlath were among those participated in this occasion.", 
  "title": "A new program to eradicate Dengue  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/558-a-new-program-to-eradicate-dengue-president"
}