{
  "date": "2017-02-01", 
  "text": "The ceremonial award of the first-ever President's Truncheon and the Regimental Truncheon to the Sri Lanka Sinha Regiment (SLSR), took place at the Sinha Regimental Headquarters in Ambepussa on Monday (30th January 2017).The ceremony was held under the patronage of President Maithripala Sirisena.State Minister of Defence Hon Ruwan Wijewardene and Secretary to the Ministry of Defence Eng. Karunasena Hettiarachchi were also present at the occasion.This is the first time that the President's Truncheon which is equivalent to that of an honorary 'Colour' has been awarded to a Regiment. It is a unique emblem upon which soldiers swear loyalty to the Regiment and the State.Upon arrival at the venue the President was accorded a drive-past Guard Turnout. Later the President read the official proclamation for the award of the Truncheon to the Regiment.The newly constructed Library of the Regiment was also declared open by the President during the occasion. Constructed by the soldiers of the Regiment, the state-of-the-art eco-friendly library had won the silver medal at the 4th Holcim International Eco-Friendly Building Competition in Switzerland recently.Field Marshal Sarath Fonseka, Commander of the Army Lieutenant General Crishanthe De Silva, senior military officers and a large number of army personnel were also present at the occasion.The Sinha Regiment saw its inception on 01st October 1956 as the 1st Battalion Ceylon Sinha Regiment with its headquarters at the Imperial Camp in Diyatalawa. Subsequently the Rajarata Rifles was re-designated as the 2nd Volunteer Battalion of the Ceylon Sinha Regiment. On 1st October 1969 the 3rd Volunteer Battalion, the Ceylon Sinha Regiment was raised at Hill School, Nuwara Eliya. With Sri Lanka becoming a Republic in 1972 the Regiment was renamed as Sri Lanka Sinha Regiment. The SLSR had played an important role during the humanitarian operations. It has also produced the first ever Field Marshal of the country.", 
  "title": "President's Truncheon Awarded to Sri Lanka Sinha Regiment", 
  "url": "https://www.dgi.gov.lk/news/latest-news/559-president-s-truncheon-awarded-to-sri-lanka-sinha-regiment"
}