{
  "date": "February 01, 2017", 
  "text": "Commander of the Navy, Vice Admiral Ravindra Wijegunaratne according to an invitation from the Indian Navy is on an official visit to India from 29th January to 02nd February. He was received by the Indian Chief of Naval Staff Admiral Sunil Lanba, followed by cordial discussions, including other senior officials of the Indian Navy on Monday (30th Jan.). During the visit the Navy Commander held bilateral discussions with senior officials of the Indian Navy and officials of the Indian military and defense sector, consolidating bilateral naval relations between India and Sri Lanka to explore new avenues for naval cooperation. He will also meet with the Indian Chief of the Air Staff, Indian Chief of the Army Staff as well as the Director General, Indian Coast Guard. Besides, the Commander of the Navy also paid a courtesy call on the Indian Minister of State for Defense and Indian Defense Secretary on Monday in New Delhi.Naval cooperation between Sri Lanka and India has been traditionally strong in a wide array of interactions focusing on the common maritime operational challenges in the region. The Naval interactions and cooperation between the two nations continue to solidify through Bilateral Exercises, Training, Port Calls, Hydrographic Co-operation, Special Forces interactions, Capability Building, and Capacity Augmentation initiatives. Meanwhile, two Advanced Offshore Patrol Vessels (AOPVs) are also being constructed for the Sri Lankan Navy at the Goa Shipyard Limited.Moreover, the Commander of the Navy will be visiting the Naval War College and Goa Shipyard Limited and will be interacting with the Flag Officer Commanding Goa Area. He would further visit the Training Command of the Indian Navy based in Kochi, where he would be briefed on training aspects and would also visit various training facilities/ professional schools. During his visit to Kochi, the Admiral is expected to meet with Sri Lanka Naval personnel undergoing training in India.The Commander of the Sri Lanka Navys visit follows closely on the visit of the Chief of Naval Staff, Admiral Sunil Lanbas visit to Sri Lanka wherein he also participated in the 7th International Maritime Conference, Galle Dialogue 2016.", 
  "title": "Navy Commander visits India: Focuses on exploring new avenues for naval cooperation", 
  "url": "https://www.dgi.gov.lk/news/latest-news/560-navy-commander-visits-india-focuses-on-exploring-new-avenues-for-naval-cooperation"
}