{
  "date": "February 01, 2017", 
  "text": "A large stock of timber had been seized by Sri Lanka Customs in 2014 while it was smuggled through Sri Lanka. The illegal timber stock had been seized by the Customs during the previous regime, and no action has been taken with regard to the seizure for three years thereby denying the government its due penalty or proceeds from auctioning. Minister Karunanayake pointed out that the Customs Department should be held full responsible for the liability.The minister who questioned whose whims and fancies have been fulfilled by not holding an inquiry into the seized timber stock said that this incident is clear evidence to the attempt by certain officials of the Customs Department to put this government in embarrassment.He pointed out that certain officers of the Customs Department are attempting to create new topics to feed the propaganda machines of so called Joint Opposition led by a few minor politicians who are responsible for the ruin of this country. The minister said that the negligence in the part of Customs officers to deny investigation on this smuggled timber for 3 years is one such clear evidence to their malicious attempt against the government.Meanwhile, Finance Minister Ravi Karunanayakeordered Director General of the Sri Lanka Customs Department Chulananda Perera on 30th January to probe the incident extensively and submit him a report.The current government led by the President and the Prime Minister are taking every measure to end corruption and other misappropriation in the country and, under such circumstances, if the Department of Customs which comes under the purview of the Ministry of Finance, has disregarded legal procedures in connection with this incident, stern action will be taken against those responsible for the misdeed.", 
  "title": "Finance Minister orders to probe delay on inquiry of smuggled timber stock", 
  "url": "https://www.dgi.gov.lk/news/latest-news/561-finance-minister-orders-to-probe-delay-on-inquiry-of-smuggled-timber-stock"
}