{
  "date": "2017-02-02", 
  "text": "President Maithripala Sirisena says the objective of his government is to take the country forward, together with all people.He was speaking at a ceremony to vest the new Out Patients Department and the ward complex built at the Kalavanchikudi Base Hospital in Batticaloa, with the public yesterday (Feb. 1).The President stated that all development activities in the Eastern Province should be completed within next three years.Though some groups criticize the government with use of the democracy and the freedom in the country, we will fulfill the responsibility of building the country taking those criticisms as strength, he said.The government is committed to strengthen the reconciliation in a way that the country is not divided. The initial activities in this regard will be completed within next few months, he stated.The new Out Patients Department and the ward complex were built at a cost of Rs. 514 million with monetary contribution of the government of Sri Lanka and the JAICA.The President registered the first patient to the new ward complex.The Hospital Development Committee presented a memento to the President during the event.President Sirisena also presented felicitation awards to the officials, including the Eastern Province Health Minister A.L.M. Nazeer, who contribute to the development of the health field in the area. A portrait of President drawn by a student from the Pattirappu National School in Batticaloa, presented to President Sirisena at the event.Dignitaries including the Opposition Leader, R. Sampanthan, Health Minister, Rajitha Senarathna, Minister Daya Gamage, Deputy Ministers, Ameer Ali, Faisal Cassim, Governor of the Eastern Province, Austin Fernando, Chief Minister, Nazeer Ahamad, Eastern Provincial Council Minister, Mrs. Ariyawathi Galappaththi, Ambassador Of Japan, Kenichi Suganuma, the staff of the Kaluwanchikudy Base Hospital including its Medical Superintendent Dr Sugunan Gunasingam participated in this event.", 
  "title": "Governments goal is to take country forward  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/566-government-s-goal-is-to-take-country-forward-president"
}