{
  "date": "2017-02-02", 
  "text": "The special Dengue Prevention Campaign organized by the Ministry of Defence was successfully carried out with the assistance of the Sri Lanka Army.The programme conducted on Wednesday (01 February) covering 47 schools in the Colombo region was carried out as a precautionary measure to curb the spread of Dengue in Colombo and its suburbs.A large number of troops who are stationed nearest to these to schools in 8 zones including Kolonnawa, Battaramulla, Kaduwela, Pitakotte, Hanwella, Homagama, Kahatuduwa and Padukka were deployed to visit the schools and carryout cleaning and destroying possible mosquito breeding places.For schools in the Kolannawa zone troops of the 12 and 11 Battalion of the Vijayaba Infantry Regiment were deployed while troops of the 9 Volunteer Battalion of Sri Lanka Light Infantry were deployed to clean up 10 schools in the Battaramulla, Kaduwela and Pitakotte zones. Troops from the 10 Battalion of Sri Lanka National Guard carried out the programme in 25 schools in Hanwella, Homagama, Kahatuduwa and Padukka zones.In addition troops of the Security Forces Headquarters - West, 14 Divisional Headquarters, 8 Battalion of Sri Lanka Light Infantry and Sri Lanka Army Women's Corps, area Medical Officers of Health, Public Health Inspectors and staff members of the schools also took part in the programme.With the current rainy weather there is a high risk of an increase in the spread of Dengue. The programme was carried out to prevent an outbreak of this disease.A similar Dengue Prevention programme was also carried out by the Army last month in the Jaffna Peninsula. During the first week of January a massive Dengue prevention campaign was launched covering 147 schools followed by a similar programme during the second week involving 67 school in the region. The special Dengue Prevention Campaign organized by the Ministry of Defence was successfully carried out with the assistance of the Sri Lanka Army. The programme conducted on Wednesday (01 February) covering 47 schools in the Colombo region was carried out as a precautionary measure to curb the spread of Dengue in Colombo and its suburbs.A large number of troops who are stationed nearest to these to schools in 8 zones including Kolonnawa, Battaramulla, Kaduwela, Pitakotte, Hanwella, Homagama, Kahatuduwa and Padukka were deployed to visit the schools and carryout cleaning and destroying possible mosquito breeding places.For schools in the Kolannawa zone troops of the 12 and 11 Battalion of the Vijayaba Infantry Regiment were deployed while troops of the 9 Volunteer Battalion of Sri Lanka Light Infantry were deployed to clean up 10 schools in the Battaramulla, Kaduwela and Pitakotte zones. Troops from the 10 Battalion of Sri Lanka National Guard carried out the programme in 25 schools in Hanwella, Homagama, Kahatuduwa and Padukka zones.In addition troops of the Security Forces Headquarters - West, 14 Divisional Headquarters, 8 Battalion of Sri Lanka Light Infantry and Sri Lanka Army Women's Corps, area Medical Officers of Health, Public Health Inspectors and staff members of the schools also took part in the programme.With the current rainy weather there is a high risk of an increase in the spread of Dengue. The programme was carried out to prevent an outbreak of this disease.A similar Dengue Prevention programme was also carried out by the Army last month in the Jaffna Peninsula. During the first week of January a massive Dengue prevention campaign was launched covering 147 schools followed by a similar programme during the second week involving 67 school in the region.", 
  "title": "Dengue Prevention Programme successfully conducted in Colombo regional schools", 
  "url": "https://www.dgi.gov.lk/news/latest-news/567-dengue-prevention-programme-successfully-conducted-in-colombo-regional-schools"
}