{
  "date": "2017-02-03", 
  "text": "With a view to broadening political, trade and economic relations with Ethiopia and also forge closer relations with the African Union (AU) that is headquartered in Addis Ababa, the Government of Sri Lanka recently established a resident mission in Ethiopia.The Embassy is located at No. 875, Kebele 02, Bole Sub City, Addis Ababa, Ethiopia. (Telephone: +251-11-6154-681, +251-11-8334-175; Facsimile: +251-11-6154-785; Email: This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloak7e99df39163f0c58cab2a69522f03ffc').innerHTML = ''; var prefix = '&#109;a' + 'i&#108;' + '&#116;o'; var path = 'hr' + 'ef' + '='; var addy7e99df39163f0c58cab2a69522f03ffc = 'sl&#101;mb.&#101;th&#105;&#111;p&#105;&#97;' + '&#64;'; addy7e99df39163f0c58cab2a69522f03ffc = addy7e99df39163f0c58cab2a69522f03ffc + 'gm&#97;&#105;l' + '&#46;' + 'c&#111;m'; var addy_text7e99df39163f0c58cab2a69522f03ffc = 'sl&#101;mb.&#101;th&#105;&#111;p&#105;&#97;' + '&#64;' + 'gm&#97;&#105;l' + '&#46;' + 'c&#111;m';document.getElementById('cloak7e99df39163f0c58cab2a69522f03ffc').innerHTML += '<a ' + path + '\\'' + prefix + ':' + addy7e99df39163f0c58cab2a69522f03ffc + '\\'>'+addy_text7e99df39163f0c58cab2a69522f03ffc+'<\\/a>'; ).Sri Lankas Ambassador-designate to Ethiopia, is Mr. Sumith Dassanayake, who has already assumed office and awaits the presentation of his official credentials to President Mulatu Teshome.Sri Lanka established diplomatic relations with Ethiopia in 1972. With the establishment of diplomatic relations, Sri Lankas Ambassadors to Kenya were concurrently accredited to Ethiopia while Ethiopias Ambassadors to India were accredited to Sri Lanka. Sri Lanka and Ethiopia are both members of the Non-Aligned Movement (NAM), and G-77, and cooperate with each other in areas of mutual benefit including in multilateral fora such as the UN. The newly established Sri Lanka Mission in Addis Ababa will also be accredited to the African Union (AU), consisting of 54 countries in Africa. Sri Lanka obtained accreditation status in the African Union (AU) in April 2014 as a non-African State and accordingly, the newly appointed Ambassador of Sri Lanka in Addis Ababa will represent the Government of Sri Lanka at the African Union as an Observer in his capacity as the Permanent Representative of Sri Lanka to the African Union.", 
  "title": "Sri Lanka opens a Resident Mission in Ethiopia", 
  "url": "https://www.dgi.gov.lk/news/latest-news/571-sri-lanka-opens-a-resident-mission-in-ethiopia"
}