{
  "date": "2017-02-03", 
  "text": "Colombo International Container Terminals (CICT) has reported a throughput of two million TEUs for the 12 months ending 31 December 2016, achieving impressive YoY growth of 28% in volume. This new volume has enabled the Port of Colombo to register overall incremental growth in the three consecutive years since CICT came into operation, the company said.Announcing the milestone achievement, CICT said ULCCs (Ultra Large Container Carriers) and VLCCs (Very large Container Carriers), many of a size that only the Colombo South Terminal is capable of handling, had contributed 70% to the volumes it achieved in 2016.The incremental volume handled by CICT was one of the contributors to the overall throughput of the Port of Colombo growing by an estimated 11% in 2016, the company said. CICT is the first and currently the only deep water terminal in South Asia equipped with facilities to handle the largest vessels afloat.The overall growth achieved by the Port of Colombo bears out the rationale for CICTs successful operation, CICT CEO Mr. Ray Ren said. We are delighted with the new business CICT has attracted to the Port of Colombo in 2016, and proud of our contribution to the overall growth achieved by the Port.CICT General Manager  Commercial and Marketing Mr. TissaWickramasinghe added: It must be emphasised that this historic achievement of two million teus was made possible mainly by the synergies developed through our parent company China Merchants Port Holdings (CMPH).The ability to access the CMPH global network was the key factor in gaining and attracting new transhipment volumes to the Port of Colombo. With the introduction of new services and new shipping lines, CICT has set the trend for the Port of Colombo to stave off international competition for the highly sensitive and volatile transhipment cargo, in a depleted global shipping market.In 2015, its first full year of operation, CICT 2015 handled 1.561 million teus, with the ULCC and VLCC segments making a 67% contribution to this volume. The benefit of these mega carriers calling at the port cascades down to the other terminals and reinforces Colombos status as a major transhipment hub.Over the past two years, CICT has brought some of the largest vessels plying the Asia-Europe routes to Colombo. Of these, MSC Maya at 19,224 TEU the worlds largest container vessel, the MV Mogens Maersk (18,300 TEU), MSC New York (16,652 TEU), CMA CGM Marco Polo (16,020 TEU), YML YM Wondrous, Edith Maersk and EMC Thalassa Hellas (each 14,000 plus TEUs) and their sister vessels are now regular callers at CICT.Besides its significant contributions to the growth of the Port of Colombo in volume terms, CICT is also responsible for several firsts in service innovation and eco-friendly operations. In early 2016, the company launched a $ 10 million programme to convert its fleet of diesel operated rubber-tyred-gantry cranes to electricity driven rubber-tyred gantry cranes (E-RTGs) which have zero carbon emissions.CICT was also the first terminal in the Port of Colombo to introduce electronic boat notes, breaking new ground in efforts to reduce paper in export documentation, as well as the first to launch a mobile app for the purpose of keeping track of containerised cargo at the terminal.The concluded year also saw CICT winning the prestigious Highly Commended award in the Port Operator category at Lloyds List Middle East and Indian Subcontinent Awards, and being cited as one of the factors in its parent company  China Merchants Port Holdings (CMPH)  being adjudged Port Operator of the Year at the Lloyds List 2016 Global Awards.", 
  "title": "CICT surpasses 2million TEU milestone", 
  "url": "https://www.dgi.gov.lk/news/latest-news/572-cict-surpasses-2million-teu-milestone"
}