{
  "date": "February 03, 2017", 
  "text": "It will facilitate the people of the country to obtain the necessary information from the relevant institutions for the past 10 years under legal provision.The RTI Act was one of the key election promises of President Maithripala Sirisena as the Common Opposition Candidate at the Presidential election 2015. The present government within a short period of time of its appointment took measures to bring this historical Act under the guidance of President Sirisena and Prime Minister Wickremesinghe.The Right to Information Bill was unanimously passed with amendments in Parliament on 24th June 2016. Speaker Karu Jayasuriya signed the Act on 4th August 2016 and a period of six months was needed, starting from that day to begin the process of issuing Information.The Information Officers attached to each institution such as ministries, and public institutions will be the authority of issuing information to the public who ask for them. Currently, about 1,500 information officers have been appointed and are being trained. According to the Minster of Parliamentary Reforms and Mass Gayantha Karunathilake the information officers will also be appointed to each school and Police station in the future. Relevant application forms will be issued by those information officers. The information can also be requested through an e-mail, a letter, or orally.The information will be issued at a cost. Accordingly, the first four A4 size pages of information will be issued free of charge while the balance will be charged at Rs. 2 each.The Act also included 21 instances where information cannot be revealed. As well, it also facilitates the information seekers to go to the Independent RTI Commission, Court of Appeal or the Supreme Court to appeal if there are any discrepancies in the issue of information or in the process of issuing information. The information officers will be punished if proved to be guilty.Minster Karunathilake said that the RTI Act being implemented in Sri Lanka has been recognized as the ninth best Act in the world and the second best Act in the region.The Right to Information Act comes into effect from midnight today (3rd Feb.). It will facilitate the people of the country to obtain the necessary information from the relevant institutions for the past 10 years under legal provision.The RTI Act was one of the key election promises of President Maithripala Sirisena as the Common Opposition Candidate at the Presidential election 2015. The present government within a short period of time of its appointment took measures to bring this historical Act under the guidance of President Sirisena and Prime Minister Wickremesinghe. The Right to Information Bill was unanimously passed with amendments in Parliament on 24th June 2016. Speaker Karu Jayasuriya signed the Act on 4th August 2016 and a period of six months was needed, starting from that day to begin the process of issuing Information.The Information Officers attached to each institution such as ministries, and public institutions will be the authority of issuing information to the public who ask for them. Currently, about 1,500 information officers have been appointed and are being trained. According to the Minster of Parliamentary Reforms and Mass Gayantha Karunathilake the information officers will also be appointed to each school and Police station in the future. Relevant application forms will be issued by those information officers. The information can also be requested through an e-mail, a letter, or orally.The information will be issued at a cost. Accordingly, the first four A4 size pages of information will be issued free of charge while the balance will be charged at Rs. 2 each.The Act also included 21 instances where information cannot be revealed. As well, it also facilitates the information seekers to go to the Independent RTI Commission, Court of Appeal or the Supreme Court to appeal if there are any discrepancies in the issue of information or in the process of issuing information. The information officers will be punished if proved to be guilty.Minster Karunathilake said that the RTI Act being implemented in Sri Lanka has been recognized as the ninth best Act in the world and the second best Act in the region.", 
  "title": "RTI Act implemented from midnight today", 
  "url": "https://www.dgi.gov.lk/news/latest-news/575-rti-act-implemented-from-midnight-today"
}