{
  "date": "February 03, 2017", 
  "text": "Minister of Foreign Affairs Hon. Mangala Samaraweera called on the President of Ethiopia, H.E. Mulatu Teshome, on 01 February 2017, at the Presidential Palace in Addis Ababa.Foreign Minister Samaraweera highlighted Sri Lankas new policy of restoring friendship with traditional friends and allies, and building stronger relations with the African region, especially with Ethiopia, as it is now emerging as the Diplomatic and Political Capital of Africa with the African Union being headquartered in Addis Ababa. This was identified by the Minister as the rationale behind the Sri Lankan Cabinet approving the opening of the new Embassy in Ethiopia.He explained how the National Unity Government elected in 2015 has taken the country forward during the past two years based on the three pillars of democratization, reconciliation and development. He further stated that Sri Lanka is in the process of finalizing a new Constitutional draft that celebrates the diversity of Sri Lanka and emphasized that the Ethiopian Constitution will be an inspiration for Sri Lanka which too is a multi-ethnic, a multi-religious and a multi-lingual country.President Mulatu Teshome highlighted the importance of peace, stability and democratization of society for the progress in any developing country and stated that Sri Lanka and Ethiopia could do much more to each other, considering the similarities of the two countries. President Teshome also stated that Ethiopia could seek Sri Lankan expertise with regard to the apparel sector as the island nation has displayed the textiles and garments industry exports as one which plays a key role in advancing the country's economy.The invitation extended by Foreign Minister Samaraweera for President Mulatu Teshom to visit Sri Lanka was warmly accepted.", 
  "title": "Foreign Minister holds discussions with Ethiopian President H.E. Mulatu Teshome", 
  "url": "https://www.dgi.gov.lk/news/latest-news/577-foreign-minister-holds-discussions-with-ethiopian-president-h-e-mulatu-teshome"
}