{
  "date": "2017-02-04", 
  "text": "And the voice of strife is dumbWhen we leap to a single bugle,March to a single drum.To realize this vision, may we all dedicate ourselves this Independence Day.Message from all Ceylon Jamiyyathul UlamaThe all Ceylon Jamiyyathul Ulama has the pleasure in releasing this message of blessings to all citizens of the country on the day of celebrating the 69th Independence Day of our motherland, Sri Lanka.Let us all unite to eliminate racism from our beautiful country. We should take forward this country towards development and prosperity living in peace and coexistence. This can be achieved only by defeating racism and establishing unity among the communities.Our prayers and expectations are that all Buddhists, Hindus, Muslims and Christians in this multi-ethnic society should strive to achieve to prosperity, development and progress by following the religious advice and developing the ethic of respecting other religious.The All Ceylon JamiyyathulUlama therefore, supplicates to God, the Almighty, to shower His blessings on every Sri Lankan citizen who shall make effort to bring unity, peace, coexistence and reconciliation through which build a prosperous Nation.Message from the Mahanayaka Thero of Sri Lanka Ramagna Maha Nikaya  Independence Day is the day that is important to all Sri Lankan citizens. Sri Lanka became an independent nation on 4th February 1948 after being ruled by Europeans for over four hundred years. It reminds the struggles launched by all Sinhala, Tamil and Muslim leaders with unity. As the unity among ethnic groups has decayed after the independence, all Sinhala, Tami, and Muslim communities had to experience massive disasters within the past decades. That separation is the main cause that obstructed the economic prosperity of our country. The separation was done by politicians who misled the public to gain their political power. Some who did not realise this truth are doing the same mistake again. I kindly request all citizens to work together by promoting the national reconciliation to overcome the present economic crisis in the country in a moment that the country is being healing after the end of a 30 year cruel war. Religious and political leaders should lead this way. Many of our problems will be automatically solved when the country becomes an economically developed country.Most Ven. Napana Pemasiri TheroMessage from the Mahanayaka Thero of Sri Lanka Amarapura Maha NikayaSri Lanka which is our country has a written history of about a period of 2358 years which was ruled by one hundred and eighty two (182) kings. There were invasions in those days too but they could be defeated with the assistance of religious leadership. It is evident in Sri Lankan history that Sri Lanka could be completely defeated in 02 March 1815 due to the separations of Sinhalese leaders caused by revenge, and lust to power, wealth and positions. The country was self-sufficient and it is said that about hundred thousand paddy fields (Wellassa) were in just the Monaragala District and about 35000 reservoirs were made to protect rainwater. It is said that giants were in the country and before 69 years the independence was gained by citizens who are not physical giants but giants with their patriotism. As the country was surrendered by English in 1815 Sinhalese were brave to perform a riot again in 1818. We have such a history.This is the 69th independence celebration. In retrospect it is clear that we are far behind the other Asian countries who received independence after our country no matter who ruled the country within this period. Hence, I kindly bless on behalf of all the monks that this celebration will open the way to build a united and developed country with a broad dialogue between the rulers and public.Bless everyone for the wellbeing of all beings with the power of the triple gem!!!Most Ven. Davuldena Gnanissara TheroMessage from the Mahanayaka Thero of Malwathu Chapter of the Syamopali Maha Nikaya of the Mahavihara AncestryIt is a pleasure that the government has taken steps to hold a colourful Independence Day celebration as usual. The first threat of invasions affected the Sri Lankan sovereignty and independence was from Chola Empire. Subsequently, Portuguese, Dutch and English invasions have severely affected our independence as well as national, religious, social, academic and cultural aspects. This caused a decline in spiritual aspects and lifestyle of people.Although 69 years have been spend after the independence, bad consequences of caused in the colonial age have not been completely overcome. The time has come to consider this matter deeply by the leaders as well as public of the country and it should be understood as their foremost task and responsibility. Everyone should commit to gain economic development and prosperity in the country keeping unity and development of the country in foremost place and protecting one's religious beliefs and cultural identities and through improving coexistence and humanitarian morals. All Sri Lankans are hereby blessed with the blessings of the triple gem and tooth relic to enjoy the true meaning of independence.Most Ven. Thibbatuwawe Sri Siddhartha Sumangala TheroMessage from the Mahanayake thero of Asgiri Chapter of the Syamopali Maha Nikaya of the Mahavihara AncestryI am sending this message of greetings with great pleasure in the moment which the Democratic Socialist Republic of Sri Lanka is celebrating its 69th independence day.Independence is wholly a practical process. The independence becomes meaningful when we gain the economic and social freedom. Countries that have gained independence with us and after us have developed into a higher level with exercising this practical process. Social Analysts say that the independence of Sri Lanka has not become practical as it is a bestowed one rather than a gained one.Sri Lankan laic and ascetic leaders have created the environment needed to implement the independent struggle without any racial, religious and caste separation and with the clamorous situation in the country English rulers had to name Sri Lanka as an Independent Nation but their objective was to keep Sri Lankans as a divided nation.Psychological slavery and racist conceptions in Sri Lankan society are a great obstruction to the society. We would not be free from the western slavery until we are liberated form psychological slavery. However, it is a duty of all Sri Lankans to commemorate all ascetic and laic leaders who led the struggle for independence.I wish in this Independence Day that all could fulfil their obligations to themselves, their families, their religion, their country and their nation by in national and religious reconciliation and deviating from narrow politics. Most Ven. Warakagoda Dhammasiddhi Sri Pagngnananda Gnanarathana TheroMessage of Greetings by Archbishop of ColomboIn this moment which Sri Lanka is celebrating their 69th Independence Day, a great opportunity has occurred to recall the past for creating a better future. There was the responsibility to convert the political independence, which was won through facing various challenges in 1948, into an economic and social freedom for past 69 years. But unfortunately we were engaged in a war that destroyed a large number of lives and properties as the political field is polluted with narrow racial and religious separations and we all have suffered throughout the war. Narrow racial and communal attitudes are not the way to experience the true independence. All should unite as citizens with equal rights to gain the true independence. We should create an atmosphere that enjoys the unity within diversity and that protects needs and self-esteem of all citizens. It is a pleasure that the government led by H.E. the President is heading towards that direction. However, all political parties and opinion should be united to achieve this goal. It could not be gained alone.Moreover, it is our duty to search for the true independence that protects the culture and civilization of this country by freeing from neo-colonial and globalization trends. Let us affirm and commit to achieve this aim in this esteemed day. Hail mother Sri Lanka!Most Excellent Rev. Malcolm Cardinal Ranjith Message from the Ramakrishna MissionAs we all know that we are celebrating our 69th independence day, which is an auspicious occasion for all the Sri Lankan citizens. It is the day when Sri Lanka got freedom from the British rule after many years of hard struggle by the great freedom fighters of Sri Lanka.This day is of great importance to all Sri Lankan citizens as it gives opportunity to remember all those freedom fighters who had sacrificed their lives just for giving us beautiful, peaceful and happy life. Freedom is inseparable from responsibility.Every citizen of Sri Lanka should rededicate and take an oath today, of being highly responsible and well-educated citizens of the tomorrows Sri Lanka. Everyone should sincerely perform his/her duty and do work hard to get the nations goals fulfilled and successfully lead this democratic nation.Sri Lankas rise will be measured by the strength of the religious and cultural values, but it will equally be determined by the economic growth and equitable distribution of the nations resources.If we have the freedom to think, it is everyones responsibility to think positively. If we have the freedom to speak, it is our responsibility to speak properly and meaningfully. If we have the freedom to act, it is our responsibility to act correctly. If every Sri Lankan could feel responsible in that way, Sri Lanka would be growing more and more in the right direction, then it will be a better place for everyone.On this happy occasion, I pray to the Lord to shower His choicest blessings on H.E. the President Maithripala Sirisena, Hon. Prime Minister Ranil Wickramasinghe, all their Cabinet collogues, Parliamentarians and all the people of Sri Lanka to live with peace, prosperity and happiness.Message from Rt. Rev. Dhiloraj R.Canagasabey, Bishop of ColomboThe church of Ceylon joins fellow Sri Lankans from all communities and faith groups to greet the nation and to wish our people a happier and better future as we mark our 69th year of independence.Since 1948, we have travelled a goodly distance as a nation, progressing in many areas such as health, access to primary and secondary education, life expectancy, equality of opportunity and poverty alleviation for example. We have also made commendable gains. In economic and infrastructure development, in addressing income inequalities, in higher education, although our progress in these areas has been much below our potential.It is where we have gone wrong and even regressed that has led us to the present moral crisis the country faces.Indiscipline, dishonesty, corruption, the hunger power, position and easy riches, the breakdown of the rule of low, mistrust, animosity between various ethnic groups and even the deliberate stoking of racial and religious hatred, these are the moral and ethical faults or sins which have gradually sapped and devastated the nation from within.Merely wishing or praying for prosperity and peace does not bring them about. There is a sacred duty cast on all of us, the rulers first and foremost but also on all our citizens to work honestly, sincerely and with dedication to create that country in which we could all live with pride, that Nation the dear homeland of us all.In the words of that great lover of Sri Lanka Rev.W.S. Senior of trinity College.But most shall he sing of LankaIn the bright new days that come,When the races all have blendedAnd the voice of strife is dumbWhen we leap to a single bugle,March to a single drum.To realize this vision, may we all dedicate ourselves this Independence Day.Message from all Ceylon Jamiyyathul UlamaThe all Ceylon Jamiyyathul Ulama has the pleasure in releasing this message of blessings to all citizens of the country on the day of celebrating the 69th Independence Day of our motherland, Sri Lanka.Let us all unite to eliminate racism from our beautiful country. We should take forward this country towards development and prosperity living in peace and coexistence. This can be achieved only by defeating racism and establishing unity among the communities.Our prayers and expectations are that all Buddhists, Hindus, Muslims and Christians in this multi-ethnic society should strive to achieve to prosperity, development and progress by following the religious advice and developing the ethic of respecting other religious.The All Ceylon JamiyyathulUlama therefore, supplicates to God, the Almighty, to shower His blessings on every Sri Lankan citizen who shall make effort to bring unity, peace, coexistence and reconciliation through which build a prosperous Nation.", 
  "title": "Independence Day messages from Religious leaders", 
  "url": "https://www.dgi.gov.lk/news/latest-news/579-independence-day-messages-from-religious-leaders"
}