{
  "date": "February 04, 2017", 
  "text": "The universal right for information that the general public expected from various governments for a considerable period of time has been granted to them by the present government of good governance.According to the Universal Declaration of Human Rights that reads \"Everyone has the right to freedom of opinion and expression; this right includes freedom to hold the opinions without interference and is to seek, receive and impart information and ideas through any media and regardless of frontiers\", the present government has taken steps to grant that supreme right to the general public. I, hand in hand with the people in Sri Lanka, enjoy the pleasure of submitting the pertinent historical Act.Freedom is a spiritual requirement. Not only humans but also the animals yearn for freedom. It is quite natural that they get uneasy when the freedom is either restricted or disturbed. Therefore, personal freedom may be considered as the pioneer in social progress.It is because Sri Lankans are a nation praising freedom in its every aspect that this motherland never experienced a lack of heroes ever ready even to make the supreme sacrifice for freedom in their struggle to gain it.The freedom for dialogue, expression, and information are essential factors in maintaining respect and self-esteem of the human kind which needs to be safeguarded for democracy.I would like to pay tribute of the nation to all patriots who fought and sacrificed their lives for freedom of their motherland.Minister Gayantha Karunatilleka,Chief Government Whip of ParliamentMessage from Minister of Home AffairsThis is the second Independence Day celebration commemorated under the incumbent unity government of Sri Lanka. At this moment of time we are celebrating true independence, we should recall with gratitude our national heroes who gave leadership and committed themselves selflessly to the struggle to free the country from the yoke of two centuries of colonial rule and our valiant war heroes who made the ultimate sacrifice to liberate the country from the clutches of brutal terrorism.All these victories were achieved when we remain united; not divided. Similarly, as is evidenced from history, future challenges can only be surmounted by working in unison like the links of a chain. Therefore we celebrate 69th Independence Day with the objective of ushering in national unity fostering national reconciliation and achieving democracy and development goals. Following the genuine democratic space that was created in the aftermath of 08 January 2015, the national and political reconciliation was steered towards a new direction thanks to the sheer commitment and dedication of His Excellency the President Maithreepala Sirisena and the Hon. Prime Minister Ranil Wickremesinghe. The immediate as well as farsighted vision of our government is to realize the dream of a Sri Lanka where people can enjoy economic, social, political and cultural freedom to the fullest and to fulfill the aspirations of people for a flourishing and prosperous future enabling the achievement of scientific victories.In accord with a decision taken by our government to promote national reconciliation, the national anthem was sung in Tamil at the 68th Independence Day national ceremony. That decision which won widespread plaudits from all concerned will be implemented unchanged in the future.The all important goal of our government is to bring the national program of Beginning of the third year of a sustainable era implemented under the theme of His Excellency the President for the realization of development plans and sustainable development goals during the next three years to create a thriving and prosperous country to fruition.As a responsible government we will safeguard the motherland even at the risk of our own lives. We will never allow disharmony and conflicts to be created among communities ever again. It is our bounden duty and responsibility to preserve the freedom that we enjoy today for posterity. Our government will make every possible endeavour to overcome tomorrows challenges together as Sri Lankans and our wish today is to build a democratic and developed country and a virtuous society for a free and independent tomorrow and bring about lasting reconciliation.Minister Vajira AbeywardanaMessage from the Minister of Public Administration and ManagementAt this remarkable juncture where our country proudly celebrates the 69th anniversary of independence, I would like to pay the tribute of the nation to all heroes of mother Lanka who sacrificed their blood, sweat and lives to win the freedom for the whole nation. The epochal mission carried out by the countrymen as one nation to liberate the country from the yoke of colonization, which had been our fate for centuries, and to build a sovereign country should be commemorated.However, we should ask ourselves whether we have been successful in our effort to maintain the unity, which we had proved during the struggle for independence. We are still struggling with a number of issues for which we should find sustainable solutions as one nation even after lapse 69 years from the independence. The poverty emerges as one of the main issues. Building a concrete trust among nationalities, formulation of national policies for sustainable development as well as establishment of reconciliation within the country are the important matters, which demand priority. Even under such challenges, still there are certain aspects regarding which we can be satisfied. Today, the two main political parties of the country have set a good example leaving behind their different political views and working together in one and the same mission for the progress of the country. The government, which was elected in order to alleviate poverty, the major issue of the country, has declared this year as the year of alleviating poverty. Therefore, this year will open avenues to provide long lasting solutions to several burning issues of the country. At this juncture, it is a great achievement that we could win significant democratic rights within a short period such as the right to information and the right to express ideas for the wellbeing of the country and people.The reality we should understand correctly as a country is that the capability of our nation depends on the unity of all nationalities devoid of political divisions and the unity is the only mean through which we can face all the challenges successfully. The example given by the political authority should be followed by all nationalities in our country. The first condition of our effort to make the mission a success is the unity among people. Therefore, we must understand that any split means the destruction of the country. If we need to emerge as a proud nation, we should make every effort to step forward as one nation. Therefore, at this remarkable juncture where Sri Lanka celebrates the 69th Independence Day, I take this opportunity to wish the Sri Lankan nation courage and vision to build our country ensuring mutual respect and safeguarding the dignity of country. Minister Ranjith Madduma BandaraMessage from the Minister of Parliamentary Reforms and Mass Media The most remarkable victory of the people of this country achieved to be celebrated on the 69th National Independence Day is the legal enactment of the human right for freedom of Information.The universal right for information that the general public expected from various governments for a considerable period of time has been granted to them by the present government of good governance. According to the Universal Declaration of Human Rights that reads \"Everyone has the right to freedom of opinion and expression; this right includes freedom to hold the opinions without interference and is to seek, receive and impart information and ideas through any media and regardless of frontiers\", the present government has taken steps to grant that supreme right to the general public. I, hand in hand with the people in Sri Lanka, enjoy the pleasure of submitting the pertinent historical Act. Freedom is a spiritual requirement. Not only humans but also the animals yearn for freedom. It is quite natural that they get uneasy when the freedom is either restricted or disturbed. Therefore, personal freedom may be considered as the pioneer in social progress. It is because Sri Lankans are a nation praising freedom in its every aspect that this motherland never experienced a lack of heroes ever ready even to make the supreme sacrifice for freedom in their struggle to gain it. The freedom for dialogue, expression, and information are essential factors in maintaining respect and self-esteem of the human kind which needs to be safeguarded for democracy. I would like to pay tribute of the nation to all patriots who fought and sacrificed their lives for freedom of their motherland. Minister Gayantha Karunatilleka,Chief Government Whip of Parliament Message from Minister of Home Affairs This is the second Independence Day celebration commemorated under the incumbent unity government of Sri Lanka. At this moment of time we are celebrating true independence, we should recall with gratitude our national heroes who gave leadership and committed themselves selflessly to the struggle to free the country from the yoke of two centuries of colonial rule and our valiant war heroes who made the ultimate sacrifice to liberate the country from the clutches of brutal terrorism. All these victories were achieved when we remain united; not divided. Similarly, as is evidenced from history, future challenges can only be surmounted by working in unison like the links of a chain. Therefore we celebrate 69th Independence Day with the objective of ushering in national unity fostering national reconciliation and achieving democracy and development goals.  Following the genuine democratic space that was created in the aftermath of 08 January 2015, the national and political reconciliation was steered towards a new direction thanks to the sheer commitment and dedication of His Excellency the President Maithreepala Sirisena and the Hon. Prime Minister Ranil Wickremesinghe. The immediate as well as farsighted vision of our government is to realize the dream of a Sri Lanka where people can enjoy economic, social, political and cultural freedom to the fullest and to fulfill the aspirations of people for a flourishing and prosperous future enabling the achievement of scientific victories. In accord with a decision taken by our government to promote national reconciliation, the national anthem was sung in Tamil at the 68th Independence Day national ceremony. That decision which won widespread plaudits from all concerned will be implemented unchanged in the future. The all important goal of our government is to bring the national program of Beginning of the third year of a sustainable era implemented under the theme of His Excellency the President for the realization of development plans and sustainable development goals during the next three years to create a thriving and prosperous country to fruition. As a responsible government we will safeguard the motherland even at the risk of our own lives. We will never allow disharmony and conflicts to be created among communities ever again. It is our bounden duty and responsibility to preserve the freedom that we enjoy today for posterity. Our government will make every possible endeavour to overcome tomorrows challenges together as Sri Lankans and our wish today is to build a democratic and developed country and a virtuous society for a free and independent tomorrow and bring about lasting reconciliation. Minister Vajira Abeywardana Message from the Minister of Public Administration and Management At this remarkable juncture where our country proudly celebrates the 69th anniversary of independence, I would like to pay the tribute of the nation to all heroes of mother Lanka who sacrificed their blood, sweat and lives to win the freedom for the whole nation. The epochal mission carried out by the countrymen as one nation to liberate the country from the yoke of colonization, which had been our fate for centuries, and to build a sovereign country should be commemorated. However, we should ask ourselves whether we have been successful in our effort to maintain the unity, which we had proved during the struggle for independence. We are still struggling with a number of issues for which we should find sustainable solutions as one nation even after lapse 69 years from the independence. The poverty emerges as one of the main issues. Building a concrete trust among nationalities, formulation of national policies for sustainable development as well as establishment of reconciliation within the country are the important matters, which demand priority. Even under such challenges, still there are certain aspects regarding which we can be satisfied. Today, the two main political parties of the country have set a good example leaving behind their different political views and working together in one and the same mission for the progress of the country. The government, which was elected in order to alleviate poverty, the major issue of the country, has declared this year as the year of alleviating poverty. Therefore, this year will open avenues to provide long lasting solutions to several burning issues of the country. At this juncture, it is a great achievement that we could win significant democratic rights within a short period such as the right to information and the right to express ideas for the wellbeing of the country and people. The reality we should understand correctly as a country is that the capability of our nation depends on the unity of all nationalities devoid of political divisions and the unity is the only mean through which we can face all the challenges successfully. The example given by the political authority should be followed by all nationalities in our country. The first condition of our effort to make the mission a success is the unity among people. Therefore, we must understand that any split means the destruction of the country. If we need to emerge as a proud nation, we should make every effort to step forward as one nation. Therefore, at this remarkable juncture where Sri Lanka celebrates the 69th Independence Day, I take this opportunity to wish the Sri Lankan nation courage and vision to build our country ensuring mutual respect and safeguarding the dignity of country.  Minister Ranjith Madduma Bandara", 
  "title": "Independence Day messages from the Ministers", 
  "url": "https://www.dgi.gov.lk/news/latest-news/581-independence-day-messages-from-the-ministers"
}