{
  "date": "2017-02-06", 
  "text": "The Minister of Finance Ravi Karunanayake will be the chief guest on the occasion of the celebration to mark the 50 years of theSri Lankas partnership with the Asian Development Bank (ADB).Sri Lanka is one of the founding member countries of the Asian Development Bank (ADB), which was established in 1966.The ceremony to mark the 50 year long standing partnership with ADB will be held at the Independence Square, Colombo 07, at 3.30 pm on Monday the February 6 with the participation of Mr. Hun Kim, director general, South Asia Regional Dept (SARD) of the ADB.The guests will also opena photographic exhibition depicting the assistance given to Sri Lanka in the last 50 years by the ADB at the Independence Hall.This exhibition will be open for the general public on February 7th and 8th.Later, this exhibition will also be held in Galle on 15, 16, 17 March 2017.The first assistance from the ADB was a loan to the country in 1968 to help modernize tea factories, and it progressed to fund projects in a variety of sectors according to the needs of the country and in keeping with the development policies of the respective governments of the day. Since then the ADB has cumulatively lent $8.2 billion and provided more than $363 million in grant assistance and more than $138 million in technical assistance to the island nation.The ADBs contributions to the development of the country werein the fields of Power & Energy, Roads &Transport, Education & Skills Development, Irrigation, and Water Supply & Sanitation. Further the Regional Development, Public Sector and Finance also stand among many sectors benefitted from the financial and technical assistance received from ADB.Headquartered in Manila, ADB is dedicated to reducing poverty in Asia and the Pacific through inclusive economic growth, environmentally sustainable growth, and regional integration. ADB has 67 member countries of which 48 are from the region.The Asian Development Banks (ADB) 50-year partnership with Sri Lanka, has also contributed immensely toward the countrys development through upgrading infrastructure, improving education and skills-based training, and reconstruction in conflict- and tsunami affected areas. ADB has also supported the growth of small and medium-sized enterprises, development of agriculture and natural resources, and management of the public sector.Some of the flagship projects in the country such as the first-ever expressway in Sri Lanka (the Southern Expressway), expansion of the Colombo port, and the upgraded UdatennaMahiyangana road were made possible due to the assistance of ADB.The Sri Lanka Resident Mission was established in 1997, enabling ADB to work more closely with Sri Lanka while better appreciating and understanding the development needs, challenges, and opportunities of the country.", 
  "title": "Finance Minister Chief Guest at the Sri Lanka -ADB 50- year partnership ceremony", 
  "url": "https://www.dgi.gov.lk/news/latest-news/594-finance-minister-chief-guest-at-the-sri-lanka-adb-50-year-partnership-ceremony-2"
}