{
  "date": "February 07, 2017", 
  "text": "The 69thAnniversary of Independence of Sri Lanka was celebrated at the Embassy of Sri Lanka in Beijing today on 04thFebruary 2017 with more than 250 participants from the Sri Lankan community in China and the Chinese well wishers.This event was graced by H.E. Kong Xuanyou, Assistant Minister of Foreign Affairs of the Peoples Republic of China and higher officials from the Chinese Foreign Ministry.Also Sri Lankan Buddhist monks Most Venerable Walgampura Dewananda Nahimi and Shashrapathi Ananda Murthi Thero and Chinese Buddhist monks from Linguan Temple and other priests representing multi religions were also attended at the Ceremony.The ceremony began with the hoisting of the National Flag by H.E. the Ambassador Dr. Karunasena Kodituwakku followed by singing of the National Anthem both in Sinhala and Tamil, lighting of the traditional oil lamp and conducting multi religious observances to bless the occasion and the country.The National day messages of H.E. the President, the Hon. Prime Minister and the Hon. Minister of Foreign Affairs were read in Sinhala, Tamil and English languages.The Ambassador addressing the gathering highlighted the longstanding relations between the two countries; specially this year marks 60th Anniversary of Establishing Formal Diplomatic Relations and 65th Anniversary of establishing Trade Relations. Ambassador further mentioned that Sri Lanka was the first South Asian country which recognized Peoples Republic of China and the first country to adopt One China Policy.The Ambassador also mentioned that a new Chapter of Friendship has been opened under the Present leaderships of both Countries and Sri Lanka will work closely with the Chinese Government. In recognition of this friendship Sri Lanka will be represented at a high level at the upcoming Belt and Road Forum for International Cooperation from 14th to 15th May 2017.The Ceremony concluded with the cake cutting, and a lunch hosted by the Ambassador at the Residence.Embassy of Sri LankaBeijing", 
  "title": "The Sri Lanka Embassy in Beijing celebrates the 69th Anniversary of Independence of Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/598-the-sri-lanka-embassy-in-beijing-celebrates-the-69th-anniversary-of-independence-of-sri-lanka-2"
}