{
  "date": "2017-02-08", 
  "text": "The Embassy of Sri Lanka in the Republic of Korea in collaboration with Gimpo City Office and the Sri Lankan community celebrated the 69th anniversary of independence and the 40th anniversary of diplomatic relations between Sri Lanka and the Republic of Korea, at a community event held at the Civic Center in Gimpo City on Sunday 5 February.The celebrations, towards which particular support was extended by the Sri Lankan community representatives in Gimpo and the surrounding areas, community representatives located all over Korea, and the Sri Lanka Students Association in Korea, was attended by over 400 Sri Lankans living and working in different regions in Korea, as well as Korean dignitaries.The Chief Guest on the occasion was the Mayor of Gimpo City Yoo Young-Rok. Other Guests of honour on this occasion were Member of the Korean National Assembly from Gimpo Hong Cheol-Ho; Chief Priest of Seokwansa Temple Rev. Lim Young-Dam; Vice President of Human Resources Development (HRD) Service of Korea Kim Pyung-Hee; and Senior Superintendent of Gimpo Police Station Choi-Jae-Cheon. The event was also attended by the MahaSangha living in different regions in Korea, Korean Buddhist priests, as well as many other Korean dignitaries and Korean media who were invited as special guests. It is of particular interest that about 20 employers of companies that have recruited many Sri Lankan workers were also present accepting the invitation.Sri Lankas Ambassador to the Republic of Korea ManishaGunasekera warmly welcomed the MahaSangha, Korean dignitaries led by Chief Guest Mayor of Gimpo City, as well as all Sri Lankans who attended the event. She extended the Sri Lankan Governments special appreciation to the workers for their significant contribution towards the economies of Sri Lanka and Korea. She also welcomed the 32 percent increase in Sri Lankan workers to Korea in 2016 as compared to 2015, and reiterated the commitment of the Sri Lankan Government to look after every aspect of the welfare of Sri Lankan workers in Korea.Delivering Congratulatory Remarks on the occasion, the Mayor of Gimpo City strongly welcomed this celebration being organized in Gimpo City which is home to over 800 Sri Lankan migrant workers. The Mayor greatly appreciated the contribution of Sri Lankan workers to the economy of Gimpo city as well as that of Korea. Special remarks were delivered on this occasion by National Assembly Member Hong Cheol-Ho as well as HRD Vice President Kim Pyung-hee. HRD Vice President in his remarks welcomed Koreas labour relationship with Sri Lanka since 2004, and indicated that due to their dedicated service, the number of Sri Lankan workers entering Korea has increased from a mere 200 per year initially to more than 6,000 per year in 2016. He also referred to the services offered by HRD in relation to the welfare of Sri Lankan workers.", 
  "title": "Korean dignitaries appreciate the contribution of Sri Lankan workers", 
  "url": "https://www.dgi.gov.lk/news/latest-news/604-korean-dignitaries-appreciate-the-contribution-of-sri-lankan-workers-2"
}