{
  "date": "February 09, 2017", 
  "text": "Sri Lankan Embassy in Berlin marked the 69th Anniversary of the Independence of Sri Lanka on 4th February 2017 with an official ceremony at the Embassy premises followed by a reception in the evening at the Brgersaal Zehlendorf Community City Hall in Berlin. The National Flag was unfurled by the Ambassador and a two minute silence to commemorate war heroes was observed. The event was attended by around 300 guests.The traditional oil lamp was lighted by Ambassador Amunugama and other special invitees representing all communities. The National Anthems of Sri Lanka and Germany were sung by the Sri Lankan children living in Berlin. Religious dignitaries representing Buddhists, Hindu, Islam and Christian faiths blessed the Nation and the people of Sri Lanka. The Independence Day messages of the President, the Prime Minister and the Minister of Foreign Affairs were read in Sinhala, Tamil and English languages respectively.Addressing the gathering, Ambassador Amunugama, emphasized the significant changes and developments that have taken place in Sri Lanka under the leadership of President Maithripala Sirisena and the National Unity Government. Reviewing bilateral ties, Ambassador Amunugama noted the growing relations between Sri Lanka and Germany characterized by goodwill, mutual respect and understanding. He also encouraged the Sri Lankans residing in Germany to extend their fullest cooperation towards the efforts carried out by the Government of Sri Lanka to bring a new era to the motherland.Delivering her speech on behalf of the German Government, Ambassador Sabine Sparwasser praised the recent developments in Sri Lanka, and stated that Sri Lanka is one of the rare examples to the rest of the world, where a conflict has being brought to a lasting solution. She also commended the political progress and steps taken towards safeguarding democracy, rule of law and reconciliation. Frank Mckisch, who represented the Mayor of Steglitz  Zehlendorf also extended his best wishes to the Government and people of Sri Lanka and reiterated the commitment and support of the German Government for the wellbeing of the people of Sri Lanka.A brief program depicting the rich culture of Sri Lanka was performed by the Sri Lankan youth living in Berlin and the celebrations concluded with the signing of the National Anthem in Tamil.", 
  "title": "Sri Lanka is a Rare Example to the Rest of the World in Conflict Resolution", 
  "url": "https://www.dgi.gov.lk/news/latest-news/610-sri-lanka-is-a-rare-example-to-the-rest-of-the-world-in-conflict-resolution-2"
}