{
  "date": "2017-02-09", 
  "text": "President Maithripala Sirisena emphasizes he will not allow any injustice to happen to the medical students of universities due to SAITM Private Medical College in Malambe.As the President of the country I am not partial to any party in this issue. I will bring justice to every student while being impartial. I will have discussions with all relevant parties and solve this problem through a reasonable program which everybody can accept, he said.He requested all medical students to engage in their studies without any boycott in attending in lectures.The President was addressing a public meeting held today (Feb. 09) in the Town Hall Playground in Thalawakele. He vested the new village Hutvilpura in Nuwara Eliya with public.We cannot let the children who are to take over the future of the country, to be misled by groups with vested interests. The government fulfill its responsibility to open the ways for the students to win the competitive world in a fair society, the President stated.He said actions will be taken to enhance the quality and standards of the free education by strengthening it through supplying required facilities for all universities. He also pointed out the importance to establish educational institutes with quality and standards to solve the problems of the students who are unable to enter into universities but qualified for such education.The new village, Hutvilpura, was built in Hutvil estate in Agarapathana, Nuwara Eliya. This village contains of 150 new houses.The village was built under the concept of New Village for Upcountry  Our Own Land and Our Own House, under the project to build new villages in the plantation estates to replace the existing line rooms. The houses of this village have each 550 square feet in 7 perches. Each house has two rooms, living room, kitchen and a bathroom.The people in the area warmly received the President when he arrived to vest the village with the public. The people warmly welcome the President doing the traditional rituals and gathered on both sides of the road waving national flags to express their gratitude to the President.Addressing the gathering the President said that the Government is committed to solve all the issues of the estate sector population while strengthening their economic standards.President Sirisena further said that it is not important whether its North, East or hill country in the process of developing the country, as well as all the citizens of this country should live enjoying equal rights and privileges.The President symbolically presented title deeds to the beneficiaries.A commemorative stamp and a first day cover were issued to mark the vesting the new village with the public. A series of events including, presenting funds, provide free milk to school children, granting loans to young men and women to start self employment, giving benefits to the new Samurdhi beneficiaries, providing a laptop to Sebamalai Selestinamary, a student from Agarapatana Holbrook Tamil College , who received the first place under Arts stream from Nuwara Eliya district in 2016, were held under the patronage of the President.The former President Chandrika Bandaranaike Kumaratunga, Ministers P. Digambaran, Mano Ganesan, M.H.M. Haleem, Faizer Mustafa, Arjuna Ranathunga, State Minister, V. S. Radhakrishnan, Ministers and MPs of the district and public servants participated in this event.", 
  "title": "I will impartially bring justice to SAITM issue  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/618-i-will-impartially-bring-justice-to-saitm-issue-president"
}