{
  "date": "2017-02-13", 
  "text": "Lanka Sathosa now employs more than 3500, said Minister Bathiudeen on 12 February in Muthur. Minister Bathiudeen was addressing the opening event of 325th Lanka Sathosa outlet in Muthur.Lanka Sathosa under my Ministry is the state owned large scale retail business in Sri Lanka. We have 3500 employees under it with an annual turnover of Rs. 30 billion said Minister Bathiudeen and added: The new management of Lanka Sathosa has developed strategies for expansion. Among important projects planned are 125 CCTV Projects, 195 ERP projects, setting up of 5 laboratories, and Installation of Human Resource Information System.On its first day in action, Muturs Lanka Sathosa outlet recorded a turnover of Rs 611,000, catering to almost 1,000 consumers who patronised it.Market studies reveal Lanka Sathosa is mostly used by households whose income is Rs 30,000 and below-60% of Sri Lankas population.The first days turnover of the latest Lanka Sathosa outlet exceeds Rs 600,000-and Sri Lankas largest state owned retail chain is now aiming at 500 outlets, as per its expansion plan. Lanka Sathosa now employs more than 3500, said Minister Bathiudeen on 12 February in Muthur. Minister Bathiudeen was addressing the opening event of 325th Lanka Sathosa outlet in Muthur.Lanka Sathosa under my Ministry is the state owned large scale retail business in Sri Lanka. We have 3500 employees under it with an annual turnover of Rs. 30 billion said Minister Bathiudeen and added: The new management of Lanka Sathosa has developed strategies for expansion. Among important projects planned are 125 CCTV Projects, 195 ERP projects, setting up of 5 laboratories, and Installation of Human Resource Information System.On its first day in action, Muturs Lanka Sathosa outlet recorded a turnover of Rs 611,000, catering to almost 1,000 consumers who patronised it.Market studies reveal Lanka Sathosa is mostly used by households whose income is Rs 30,000 and below-60% of Sri Lankas population.", 
  "title": "Newest Lanka Sathosa records over Rs.600, 000 on first day ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/631-newest-lanka-sathosa-records-over-rs-600-000-on-first-day"
}