{
  "date": "February 14, 2017", 
  "text": "The 69th Anniversary of Independence of Sri Lanka was celebrated in Singapore with twin events organised by the Sri Lanka High Commission, with the support of the Sri Lankan community, Singaporean well-wishers and a host of sponsors from Sri Lanka and Singapore. A ceremony held on 4th February at the Official Residence of the High Commissioner, with the participation of around 250 Sri Lankan nationals, persons of Sri Lankan origin and friends of Sri Lanka in Singapore was marked by reading of the Independence Day Messages of President, Prime Minister and Foreign Minister to the Nation. This ceremony began with the hoisting of the National Flag by High Commissioner Nimal Weeraratne, followed by the lighting of traditional oil lamp and religious observances of all faiths represented in Sri Lanka to bless the country, its people, and the Government.Celebrating this important occasion, an evening reception was also held on 6th February, in the presence of over 300 guests representing high-level dignitaries and officials from the Government of Singapore, diplomatic community, and business community, professionals of various disciplines, academia, and the Sri Lankan diaspora in Singapore. The Singapore Government was represented by Dr. Janil Puthucheary, Minister of State for Communications and Information and for Education, and the Members of Parliament Yee Chia Hsing, Member for Chua Chu Kang GRC and Saktiandi Supaat, Member for Bishan Toa Payoh GRC.The High Commissioner addressing the gathering highlighted that this year; Sri Lanka celebrates the nation's independence, witnessing the continuation of a new journey of political, economic and social reforms begun two years ago with the establishment of a National Unity Government. Quoting the Independence Day Message of President Maithripala Sirisena, the High Commissioner also emphasised that it is at a challenging and a decisive moment that we celebrate the Independence anniversary this year, and the responsibility of strengthening the secured democratic freedom as well as ensuring that all communities could live with dignity, lies on our shoulders.Recognising that the bonds of friendship between Sri Lanka and Singapore draw momentum from strong people-to-people contacts, as they build networks, and help bringing home the best of what the host nation can offer, the High Commissioner also availed the opportunity to thank all Sri Lankans, including those of Sri Lankan origin in Singapore, as well as Singaporeans and foreign friends from far and near, for their continuous and significant contribution to strengthen relationship between the two countries.Speaking on the occasion, Minister of State Dr. Janil Puthucheary remarked that as his country, Singapore drew inspiration and looked for Sri Lanka for its development in formative years after the Independence, and now they are keen to share their developmental experience in a range of spheres with Sri Lanka. Minister Puthucheary also stated that the two countries have made significant headway in this direction having entered into partnerships in several important areas, following the Official Visit of Prime Minister Ranil Wickremesinghe to Singapore in July last year.The evening ceremony also featured the performance of a well renowned troupe brought from Sri Lanka, presenting a traditional Sri Lankan dance and showcasing the country's rich heritage.", 
  "title": "Sri Lankas 69th Independence Day Celebrations in Singapore ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/632-sri-lanka-s-69th-independence-day-celebrations-in-singapore"
}