{
  "date": "February 14, 2017", 
  "text": "I will take every step to make the country prosperous in agriculture by enhancing the farmers economy, as a President whose roots are of a agricultural family, says President Maithripala Sirisena.I will take measures to solve the water issue by filling the large tanks with blue water so that the farmers will not face any shortages for irrigating their lands, he added.The President was speaking at the public meeting held yesterday (Feb. 13) at the playground of Welamitiyawa Vidyalaya in Galewela, after launching the Wayamba Ela Project; the giant development project to supply water to Wayamba.It is everyones responsibility to build the country by supporting the countrys development without the divisions due to affiliation to political parties. Establishing or changing governments can be done at elections. But what we have to do today is to unite to build the country forgetting all arguments the President stated.If the politicians and government officers honestly fulfill their responsibilities, it is not a difficult task to save the country from the difficulties it is facing today, he said.The President further stated that the objective of the current government is to move towards development goals.We will fulfill our responsibility to build the motherland to be a great nation despite all challenges, the President emphasized.The Waymaba Ela Project which will minimize the difficulties faced by farmers due to the lack of water is carried out with a contribution of Asian Development Bank.After the completion of the project, annually, the northern part of the Kurunegala District, will receive 105,000 acre-feet of Mahaweli water. Around 300 small streams and 8 main streams in the area will be nourished through the Mahaweli water and water can be released under the Hakwatuna Oya reservoir to cultivate 2,500 hectares of land as well as under the small streams of Mee-oya Jala-dara system, water can be released to cultivate another 3,500 hectares of land and through his project it will be able to release water to cultivate more than 12,000 hectares of land in both the Yala and Maha seasons.In addition, provision of safe drinking water for people who live in those areas will help to prevent Chronic Kidney Disease. Direct and indirect employment opportunities will be opened for the people in the area due to the construction works. Around 16,000 million rupees estimated for the project and it is scheduled to complete in 2024.The groundbreaking ceremony for the stage I of the project held under the patronage of President at the Wemedilla Left Bank Main Canal.The President also presented title deeds to the people who lost their lands due to the project, under the resettlement programme.Ministers and MPs, including S.B. Nawinna, Anura Priyadarshana Yapa, Gamini Jayawickrama Perera, Akila Viraj Kariyawasam, State Minister T.B. Ekanayake, Deputy Ministers,Lakshman Wasantha Perera, Tharanath Basnayake, Governor of the North Western Province, Amara Piyaseeli Ratnayake, Chief Minister, Dharmasiri Dassanayake, Chief Minister of Central Province, Sarath Ekanayake, public servants including Mr. Udaya R Seneviratne Secretary for the Mahaweli Development & Environment and the people in the area participated at this event.", 
  "title": "I will take every step to make country prosperous in agriculture  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/633-i-will-take-every-step-to-make-country-prosperous-in-agriculture-president"
}