{
  "date": "2017-02-15", 
  "text": "Australian Prime Minister Malcolm Turnbull assured his fullest support to Sri Lankas new economic reforms being taken place and thereby to become the economic and financial hub in the Indian Ocean, and to strengthen the bilateral economic, political, and social relations. Meeting with the Sri Lankan Prime Minister Ranil Wickremesinghe and his delegation at the Parliamentary premises in Canberra this morning, the Australian Premier appreciated the visit made by his Sri Lankan counterpart at a time where the two states are marking the 70th Anniversary of the diplomatic relations.A grand-scale event had been organized there to welcome Ranil Wickremeisnghe, the first Sri Lankan Prime Minister, who participated at the bilateral discussions in Australia after Sir John Kotalawala in 1954. Premier Turnbull introduced his delegations to the Sri Lankan Premier and vice versa.During the official bilateral discussions, Prime Minister Turnbull commended the path that Sri Lanka has entered under the leadership of President Maithripala Sirisena to establish the economic development , national harmony and the reconciliation in the country. He assured Australias support for Sri Lanka at all times as one of its old friends.In response, the Sri Lankan Premier Ranil Wickremeisnghe expressed his gratitude to Australia for extending their supportive hand towards Sri Lanka even at the difficult times suffered by Sri Lanka.PM Turnbull also commended the steps taken by the Sri Lankan government to avert human trafficking and illegal migration.Both leaders also focused the attention on trade affairs in the region, extending the investment opportunities in agro-business, excavation, energy, and tourism sectors, education, defense, and oceanic protection.PM Malcolm Turnbull appreciated the contribution received from Sri Lankans in Australia to build up the Australian economy and other sectors. He said that the attention should be paid regarding the service that could be obtained from them to Sri Lanka too. Importance of establishing a Budget Bureau at the Sri Lankan Parliament was also emphasized and PM Turnbull assured their support in that regard.PM Wickremesinghe extended an invitation to his Australian counterpart to visit Sri Lanka and PM Turnbull positively responded to that.", 
  "title": "Australian PM assures fullest support towards Sri Lanka", 
  "url": "https://www.dgi.gov.lk/news/latest-news/640-australian-pm-assures-fullest-support-towards-sri-lanka"
}