{
  "date": "February 15, 2017", 
  "text": "The upper limit to pay 15% special interest on fixed deposits maintained by senior citizens in the licensed commercial banks and the licensed Specialized Banks has been increased up to Rs.1.5 million from the current limit of Rs.1 million with effect from March 01.On the instruction of the Minister of Finance Mr. Ravi Karunanayake, Treasury Secretary Dr. R.H.S. Samaratunga has informed the Central Bank of Sri Lanka to notify all banks amending the previous circular in this regard.The present Government, under its 100- day programme, in the Budget - 2015 for the first time introduced a 15% special interest scheme for senior citizens fixed deposits up to one million rupees maintained by senior citizens over the age of 60 years. Accordingly, the Government pays the difference between the 15% and the market standard interest rate offered by commercial banks. Treasury has incurred Rs.13,000 million for this purpose in 2016. As a result of this offer to senior citizens, the number of fixed deposits by senior citizens rose to 450,000 in 2016 from 91,000 in 2015.The number of fixed deposits maintained by senior citizens is reported to have risen today to 500,000 since the Minister Ravi Karunanayake announced the continuation of the senior citizens deposits scheme which guarantees an interest of 15 percent for deposits with the increase of the upper limit up to Rs 1.5 million.Director General of Department of Development Finance said that with the increase of the upper limit, Treasury has to spend Rs.18,000 million to pay the 15% interest during this yearMeanwhile, Finance Minister Ravi Karunanayake said that this Government introduced various facilities to assist senior citizens after 2015 as the ageing population is on the increase in the island.In addition to the 15% interest, which was introduced in the country for the first time in 2015, the benefit of Agrahara Insurance Scheme available for the public servants was extended up to 70 years for the benefit of those who are retiring from the public sector. In the Budget 2017 the Minister Ravi Karunanayake announced the extension of the insurance cover for the full life time of the retiring public servants from this January", 
  "title": "Upper Limit for 15% special interest to senior citizens deposits increased to Rs.1.5million", 
  "url": "https://www.dgi.gov.lk/news/latest-news/642-upper-limit-for-15-special-interest-to-senior-citizens-deposits-increased-to-rs-1-5million"
}