{
  "date": "February 16, 2017", 
  "text": "President Maithripala Sirisena says scholars and intellectuals should come forward to provide a better service to the country and the people by recognizing the social issues.The scholars and intellectuals should not be isolated in the society by limiting themselves in their own fields.Most problems of the society can be solved with the voices of the scholars and intellectuals.The President was speaking at the ceremony to mark 75th anniversary of Kegalle Vidyalaya today (Feb. 15).President Sirisena, who was the first President of Sri Lanka to visit Kegalle Vidyalaya was warmly welcomed by the children of the school.Speaking further, the President said the scholars and intellectuals should act for the social justice by putting their knowledge into practice for the progress of the society.The President said that today is an era where people reap the benefits of the free education and the Government will fulfill its responsibility of further strengthening the free education and the health of the country with a great commitment.The President promised to provide the necessary funds to build the three-storey building at the school without any delay at the request of the students of the Kegalle Vidyalaya.President Sirisena also opened the exhibition which was organized to mark the 75th Anniversary Celebrations of the Kegalle Vidyalaya. Later he joined the students to view the exhibition.A series of 22 books written by students of the school presented to the President.Certificates and the awards were presented to the students who showed outstanding performance by the President.Ministers Ranjith Siyabalapitiya, Kabir Hashim, Deputy Ministers, Champika Premadasa, Dushmantha Mithrapala, Chief Minister, Mahipala Herath, Local Governments Ministers, Past Pupils including, former Commander of Sri Lanka Navy Admiral (Retd) Daya Sandagiri, former Auditor General, Sarath Mayadunne, the staff of the school including its Principal, G.A.M.S. Sarathchandra, parents and many others participated at this event.", 
  "title": "Scholars & intellectuals should come forward to serve the country & people  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/644-scholars-intellectuals-should-come-forward-to-serve-the-country-people-president"
}