{
  "date": "February 17, 2017", 
  "text": "President Maithripala Sirisena says the Government will fulfill its responsibility of protecting and nourishing Buddhism in a more realistic and practical manner not limiting it to written words about the place of Buddhism in the Constitution. He made these remarks participating in a religious ceremony to unveil the 36-foot high Samadhi Buddha Statue at Nape Sri Bodhirukkarama Viharaya in Kegalle,on15th Feb.The religious ceremony was held under the guidance of the AnuNayaka of the Malwatta Chapter Most Venerable Niyangoda Vijithasiri Thera and with the participation of 500 Mahasangha.The President who arrived at the Sri Bodhirukkarama Viharaya engaged in religious observances and secured blessings. Later he joined in unveiling the Samadhi Buddha Statue.AnuNayaka of the Malwatta Chapter Most Venerable Niyangoda Vijithasiri Thera unveiled the Samadhi Buddha Statue and the President unveiled the plaque. The President also unveiled the plaque for the five Devales at the temple.A Sandalwood sapling was planted in the premises of the temple to mark the Presidents visit to the temple.The President presented a memento to philanthropist Mr. Gemunu Jayasuriya, who provided financial assistance to build the Samadhi Buddha Statue.President Sirisena presented a memento to the Chief Incumbent of the temple, Ven. Mampita Hemaloka Nayaka Thera and he also presented a memento to the President.Later, the President offered Atapirikara to the Malwatta Chapter Most Venerable Niyangoda Vijithasiri Thera.Minister Ranjith Siyambalapitiya, Chief Minister Mahipala Herath, Former Minister, Athauda Seneviratne, State Minister,Champika Premadasa, Deputy Minister, Dushmantha Mithrapala, Thusitha Wijemanne, MP, Provincial Councilor, Harsha Siyambalapitiya, SLFP Chief Organiser of Dedigama electorate, Kithsiri Wijetunga and many others participated at this occasion.", 
  "title": "Govt. will fulfill its responsibility of protecting and nourishing Buddhism -President ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/652-govt-will-fulfill-its-responsibility-of-protecting-and-nourishing-buddhism-president"
}