{
  "date": "2017-02-19", 
  "text": "President Maithripala Sirisena says he is the only President who declared asset to the country.If the politicians and government officers openly fulfill their responsibility no problem will arise. That example should come from the top, he said.The President was speaking at the ceremony to inaugurate the Right to Information Act held today (Feb. 17) at Temple Trees.There was no demand for me to present my asset statement. But I did it last two years, he added.The President recalled that he exposed his asset statement to the journalists according to their request, after presenting it to the Election Commissioner as the Common Candidate.The people of this country elected this government on the 8thof January 2015 to change a government which exceeded the limits of fraud, corruption and irregularity. The people elected the new government for not to act like the former government. The allegations for the former government should not be directed to the new government, he pointed out.When the program to build the country is processing the cordiality and the cooperation of the politicians and the government officers is important. It is a strong chain to build the country, the President further said.The politicians and government officers should get rid of the incorrect culture they have been used to. They should fulfill their responsibility for the country with transparency, he stated.Today there are many protests on roads in Colombo. They are misusing the democratic freedom in the country. The government took actions to give the service pension to the disabled war heroes who did not complete 12 years. This benefit hasnt been given to them in the history. Even when the government has done it, another group is protesting on the road, the President said.The website for the Right to Informationwww.rti.gov.lkwas launched by the President at this occasion.Ministers Gayantha Karunathilaka, Nimal Siripala de Silva, Vajira Abeywardena, Chandrani Bandara, Deputy Ministers Karu Paranavitana, Ranjan Ramanayake, Secretary to the Ministry of Mass Media, Nimal Bopage,Director General of the Government Information Department, Ranga Kalansuriya,Advisor to the Minister forRight to Information Act,Piyatissa Ranansinghe and many others participated in this event.", 
  "title": "I am the first President who declared asset to the country  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/654-i-am-the-first-president-who-declared-asset-to-the-country-president-2"
}