{
  "date": "February 20, 2017", 
  "text": "The foundation stone for Deduru Oya Water Supply Project was laid ceremoniously on 20th February, 2017 by Minister of City Planning and Water Supply, Hon. Rauf Hakeem, Ambassador of the Republic of Korea to Sri Lanka, H.E. Chang, Won-sam and other dignitaries.This project is supported by the Export-Import Bank of Korea (Korea Eximbank) with the aim of providing clean and safe drinking water to the people in Mahawa and Polpithigama divisions located towards the Northern part of Kurunegala district as these area are reportedly inflicted with Chronic Kidney Disease (CKD).The rapid spread of CKD has become a menace in Sri Lanka while Kurunegala district has been identified by health authorities as a severely affected area. The main reason for the spread of CKD is the consumption of unsafe ground water which is caused by the lack of piped water coverage in the larger Kurunegala district. Given these circumstances, the government of Sri Lanka aims to take measures to address the prevalence of CKD under the patronage of President Sirisena. In line with the governments plan to prevent this debilitating disease, Korea Eximbank expects to provide safe drinking water for residents in Mahawa and Polpithigama divisional secretarys divisions that are located towards the Northern part of Kurunegala district. Through this project, piped water will be provided to 18,200 households thereby benefiting 90,800 residents.The scope of this much anticipated project includes building comprehensive water supply facilities such as intake structure, water treatment plant, water transmission lines, water storage reservoirs and water distribution network. Furthermore, institutional capacities will be developed to ensure sustainable operation and maintenance (O&M) of these facilities. Upon successful project completion in mid-2019, Korea Eximbank expects that it will contribute to decrease the incidence of CKD and water-borne diseases as well as to improve the health environment and living conditions in the region. During the event, Ambassador of the Republic of Korea to Sri Lanka, H.E. Chang, Won-Sam stated that this ceremony also marks a significant milestone to celebrate the 40th anniversary of diplomatic ties between Republic of Korea and Sri Lanka in this year. [Korea Eximbank]The Export-Import Bank of Korea (Korea Eximbank) provides Official Development Assistance (ODA) for international development and cooperation. The bank signed its first ODA loan agreement with Sri Lanka in 1990, for the rehabilitation of the Colombo-Galle road. As of now, the Bank has approved USD 606 million for 27 development projects in Sri Lanka.Korea Eximbank also provides financing for international trade and overseas investment, to promote bilateral economic cooperation. Since 1978, Korea Eximbank has provided USD 386 million both for trade between Sri Lanka and Korea and for Korean companies foreign direct investments in Sri Lanka.", 
  "title": "Korea Eximbank to provide clean and safe drinking water in the Northern part of Kurunegala District", 
  "url": "https://www.dgi.gov.lk/news/latest-news/661-korea-eximbank-to-provide-clean-and-safe-drinking-water-in-the-northern-part-of-kurunegala-district"
}