{
  "date": "2017-02-22", 
  "text": "Department of Census and Statistics, on 17 November 2016 conducted the Census of Public and Semi Government Sector Employment 2016 which is the eighth in a series of censuses conducted by the Department (DCS). A Preliminary Report based on the summaries prepared manually at institutional level immediately after the census which covered both the public sector and the Semi Government sector has been prepared by DCS. The report presents information on employees at the work place they are currently attached to.Dr. A.J. Satharasinghe, Director General of Census and Statistics stated that the total number of employees in the public and semi-government sector excluding the three forces is 1,117,808 of which 54.9 percent are males and 45.1 percent are females.The census results also show that the 7.6 per cent of employees are over 56 years while 15 percent and 77.4 percent of employees are in the age groups of 18-29 years and 30-55 years respectively.The Census reveals that out of all public and semi government employees more than 95 per cent are holding permanent positions. This comprises of 75.6 per cent Permanent/Pensionable employees, 3.9 per cent permanent/ pensionable employees who are also contributing to a provident fund, and 15.7 per cent permanent employees who are contributing to a provident fund.The Census preliminary results also shows that a majority of 35.8 per cent of the work force are G.C.E (Advanced Level) qualified while one in every four employees (26.1 per cent) has a degree or a higher qualification. The Census also captures the levels of computer literacy among public and semi government sector employees which revealed that 62.7 percent of the employees are capable of performing some task using a desktop/ laptop/ tablet computer or a smart phone while one in every two employees use internet.The Preliminary report of the Census of Public and Semi Government Sector Employment 2016 can be downloaded from the DCS website, www.statistics.gov.lk.", 
  "title": "Census of Public and Semi Government Sector Employment - Preliminary Report issued", 
  "url": "https://www.dgi.gov.lk/news/latest-news/675-census-of-public-and-semi-government-sector-employment-preliminary-report-issued"
}