{
  "date": "February 24, 2017", 
  "text": "Hindus around the world will celebrate Maha Shivaratri today, February 24. Maha Shivratri is a Hindu festival celebrated annually in reverence of the god Shiva. It is the day Shiva was married to the goddess Parvati.Mahashivaratri Festival or the The Night of Shiva is celebrated with devotion and religious fervor in honor of Lord Shiva, one of the deities of Hindu Trinity. Shivaratri falls on the moonless 14th night of the new moon in the Hindu month of Phalgun, which corresponds to the month of February - March in English Calendar. Celebrating the festival of Shivaratri devotees observe day and night fast and perform ritual worship of Shiva Lingam to appease Lord Shiva.There are various interesting legends related to the festival of Maha Shivaratri. According to one of the most popular legends, Shivaratri marks the wedding day of Lord Shiva and Parvati. Some believe that it was on the auspicious night of Shivaratri that Lord Shiva performed the Tandava, the dance of the primal creation, preservation and destruction. Another popular Shivratri legend stated in Linga Purana states that it was on Shivaratri that Lord Shiva manifested himself in the form of a Linga. Hence the day is considered to be extremely auspicious by Shiva devotees and they celebrate it as Mahashivaratri - the grand night of Shiva.Various traditions and customs related to Shivaratri Festival are dutifully followed by the worshippers of Lord Shiva. Devotees observe strict fast in honor of Shiva, though many go on a diet of fruits and milk some do not consume even a drop of water. Devotees strongly believe that sincere worship of Lord Shiva on the auspicious day of Shivaratri, absolves a person of sins and liberates him from the cycle of birth and death. Shivaratri is considered especially auspicious for women. While married women pray for the well being of their husbands unmarried women pray for a husband like Lord Shiva, who is regarded as the ideal husband.To mark the Shivratri festival, devotees wake up early and take a ritual bath, preferably in river Ganga. After wearing fresh new clothes devotees visit the nearest Shiva temple to give ritual bath to the Shiva Lingum with milk, honey, water etc.On Shivaratri, worship of Lord Shiva continues all through the day and night. Every three hours priests perform ritual pooja of Shivalingam by bathing it with milk, yoghurt, honey, ghee, sugar and water amidst the chanting of Om Namah Shivaya and ringing of temple bells. Nightlong vigil or jaagran is also observed in Shiva temples where large number of devotees spend the night singing hymns and devotional songs in praise of Lord Shiva. It is only on the following morning that devotee break their fast by partaking prasad offered to the deity.Wewish all Hindusworldwide ahappyand blessed Mahashivratri.", 
  "title": "Hindus celebrate Maha Shivaratri today", 
  "url": "https://www.dgi.gov.lk/news/latest-news/679-hindus-celebrate-maha-shivaratri-toda"
}