{
  "date": "2017-02-24", 
  "text": "The prime expectation and the noble vision of all the religions is to promote existence of spiritually and morally cultured humans, says President Maithripala Sirisena.All the rituals and celebrations performed by the humans are designed to recall those core values of the religious teachings, he stated in his message issued for Maha Shiva Rathri.He further stated that the religions provide great relief to the people in todays competitive world as their lives are becoming increasingly depressed. The religious way of life, which is more towards the spiritual awakening, can be considered as an essential ingredient for building a better society, he stated.Following is the Presidents Message issued for Maha Shiva RathriThe prime expectation and the noble vision of all the religions is to promote existence of spiritually and morally cultured humans. All the rituals and celebrations performed by the humans are designed to recall those core values of the religious teachings.These religious ceremonies, that are being held to dispel the darkness of ignorance and conceit with the light of knowledge, love and peace help tremendously for the human beings to live with sustenance of human dignity in the contemporary world of new technology.Religions provide great relief to the people in todays competitive world as their lives are becoming increasingly depressed. The religious way of life, which is more towards the spiritual awakening, can be considered as an essential ingredient for building a better society.The Hindu devotees world over including Sri Lankan Hindus celebrate the Maha Shiva Rathri with the objective of enhancing their spiritual discipline.I wish all Hindu devotees who celebrate the Maha Shiva Rathri Day, expressing their gratitude to Lord Shiva by fasting and keeping a night-long vigil at temples, may achieve their aspirations.The prime expectation and the noble vision of all the religions is to promote existence of spiritually and morally cultured humans, says President Maithripala Sirisena.  All the rituals and celebrations performed by the humans are designed to recall those core values of the religious teachings, he stated in his message issued for Maha Shiva Rathri.He further stated that the religions provide great relief to the people in todays competitive world as their lives are becoming increasingly depressed. The religious way of life, which is more towards the spiritual awakening, can be considered as an essential ingredient for building a better society, he stated.Following is the Presidents Message issued for Maha Shiva RathriThe prime expectation and the noble vision of all the religions is to promote existence of spiritually and morally cultured humans. All the rituals and celebrations performed by the humans are designed to recall those core values of the religious teachings.These religious ceremonies, that are being held to dispel the darkness of ignorance and conceit with the light of knowledge, love and peace help tremendously for the human beings to live with sustenance of human dignity in the contemporary world of new technology.Religions provide great relief to the people in todays competitive world as their lives are becoming increasingly depressed. The religious way of life, which is more towards the spiritual awakening, can be considered as an essential ingredient for building a better society.The Hindu devotees world over including Sri Lankan Hindus celebrate the Maha Shiva Rathri with the objective of enhancing their spiritual discipline.I wish all Hindu devotees who celebrate the Maha Shiva Rathri Day, expressing their gratitude to Lord Shiva by fasting and keeping a night-long vigil at temples, may achieve their aspirations. ", 
  "title": "Prime expectation of religions is to promote spiritually & moral culture  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/681-prime-expectation-of-religions-is-to-promote-spiritually-moral-culture-president"
}