{
  "date": "February 25, 2017", 
  "text": "A delegation of the United States Congress called on President Maithripala Sirisena yesterday (24th Feb.) at the Presidents Official Residence and held discussions about the steps to be taken to further strengthen bilateral relations; The 8-mlember delegation is the largest ever US Congress Group to visit Sri Lanka and it included 4 from the Democratic Party and 4 from the Republican Party.Leader of the delegation, Congressman Bob Goodlatte, Chairman of the House Judiciary Committee said that the US was happy over the steps taken by the consensual government to strengthen democracy, individual freedom, and reconciliation.President Sirisena, briefed the delegation over the major achievements of the government in strengthening democracy and reconciliation and said the government is determined to implement all required policies and programs despite the hurdles from the extremist groups.He expressed his satisfaction over the strength of the bilateral relations between the two countries and added that that the Government of Sri Lanka is totally committed to further strengthen relations, especially in economic and investment spheres.President Sirisena said that Sri Lanka has an important responsibility regarding regional security in addition to national security as the country is situated at an important strategic location in the international maritime route. Hence, Sri Lanka takes all these into careful consideration while entering into international investment agreements.The President thanked the US for resuming training of Sri Lankan armed force members, and urged them to consider additional training slots for providing technical training to naval officials. He thanked the US for the development assistance provided to Sri Lanka over the years.Congressman Goodlatte said that USA will stand by Sri Lanka in its challenging journey towards economic development. The Deputy Leader Ms Jackson Lee said that the US applauds the successes of the unity government. She asked The President to consider steps required to increase women representation when the constitutional reforms are made and the President replied in affirmation.The delegation comprised of, Representative Bob Goodlatte, Representative Jackson Lee, Representative Holding, Representative Cuellar, Representative Smith and Representative Johnson.The delegation was accompanied by Atul Keshap, Ambassador for USA, and Prasad Kariyawasam Sri Lanka Ambassador in USA.", 
  "title": "American Congress delegation applauds unity governments achievements", 
  "url": "https://www.dgi.gov.lk/news/latest-news/682-american-congress-delegation-applauds-unity-government-s-achievements"
}