{
  "date": "2017-02-28", 
  "text": "After being elected, the current government has taken several steps to provide welfare facilities and grant benefits to the war heroes throughout the last two years.With that the government will not be complacent and will continue to take every possible action for their welfare in the future too, says President Maithripala Sirisena.The President made these remarks at the passing out ceremony of the first Navy Marine Corp and the ceremony to pin badges held today (Feb. 27) at the Navkabharana Wayamba Sri Lanka Navy Headquarters in Mullikulam in Mannar.The current government took measures to win the national and international honour for our security forces, he said.The current government succeeded in getting the training opportunities in powerful countries in the world, which have been lost for our security forces in the past. These opportunities will be increased in the future, the President said. He stated that USA has expressed its willingness to provide technological knowledge and training opportunities for Sri Lanka Navy.The President commended the specific mission rendered by Sri Lanka Navy during the conflict. He also commended their valued contribution being made for the national and regional security with utilization of the modern technology.For the first time in the history of Sri Lanka Navy, the Sri Lanka Marine Corp was established under the leadership of the Navy Commander Vice Admiral Ravindra Wijeygunarathne. This is the youngest marine corp established in the world.This Marine Corps possesses many distinct combatant capabilities and skills and they have perfectly trained to face any enemy attack to land area from the sea as well as to attack any enemy targets by travelling through sea to land area. They are highly skilled Marine Corps in urban, forest and river related operations.They have been providing a special training for the provision of UN peacekeeping duties, to give humanitarian assistance and management in natural disaster situations in Sri Lanka as well as in the region.The passing out parade of the first group of Marine Corps consisted of 165 officers and marines was held under the patronage of Commander-in-Chief of the Armed Forces President Maithripala Sirisena.The President also joined in viewing a display on the Mullikulum beach, portraying the Marine Corps battalion attacking an enemy campsite.The President launched the new website of the Sri Lankan Marine Corps and the Commander of the Navy, Vice Admiral Ravindra Wijegunaratne presented a memento to the President during the event.State Minister of Defence,Ruwan Wijewardene, Chief of Defense Staff, Air Chief Marshal KA Gunathilaka, Army Commander, Lt. General Chrishantha de Silva,Commander of the Navy,Vice Admiral Ravindra Wijegunaratne, Air Force Commander,Air Marshal Kapila Jayampathi, North Western Naval Commander, Real Admiral P.R.B.Disanayake,representatives including, U.S. Ambassador to Sri Lanka, Atul Keshap and many others participated in this event.", 
  "title": "Government takes every action for war heroes welfare  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/698-government-takes-every-action-for-war-heroes-welfare-president"
}