{
  "date": "2017-02-28", 
  "text": "SriLankan Airlines has commenced the induction of the first of its latest Airbus aircraft. The A320neo arriving today, February 27th will be the first of the A320neo and A321neo family aircraft in its fleet.The introduction of these new-generation aircraft will help enhance its exceptional service standards for passengers and serve to align its fleet to the airlines new strategic focus on Asia and the Middle East.The addition of seven brand new wide body A330-300 aircraft in 2016 greatly enhanced its long haul fleet and passengers can now enjoy more comfortable seats, a state-of-the-art entertainment system, excellent in-flight cuisine, and flight attendants famed for their warmth and caring.Ajith Dias, Chairman of SriLankan Airlines, said: Our airline realigned its strategic focus during the last quarter of 2016 to capitalise on market opportunities in the rapidly growing travel and tourism industry in Asia, which included the launch of services to 11 new destinations throughout the Indian Ocean and Middle East regions. The arrival of the A320neo and A321neo aircraft will better align our fleet to this objective, as these aircraft are more suited to our medium haul operations, while we already possess an excellent fleet of A330 aircraft for our long haul routes.Captain Suren Ratwatte, Chief Executive Officer of SriLankan Airlines, said:  Equipped with these aircraft and coupled with our award winning service, we will have the capability to delight our customers even further.The Neo-series has been designed to provide significantly lower fuel consumption and lower operating costs through more modern engines, aerodynamic refinements, large curved winglets, known as sharklets, and weight savings. It also features cabin improvements such as more passenger seats, larger hand luggage spaces and an improved air purification system, as well as reduced engine noise levels and a significantly increased flying range.The airlines dynamic strategy is witnessing the addition of two Airbus A320neo and four A321neo aircraft joining its fleet in a little over a year. The second A320neo aircraft is scheduled for delivery in April 2017, followed by the first and second A321neo aircraft in the second quarter. A third A321neo is to arrive before the end of 2017, with the fourth A321neo is due in the first quarter of 2018. The orders for these aircraft were placed several years ago. The revamped fleet will enable the airline to dovetail more efficient management of its newly overhauled business plan for a leaner and a more efficient regional operation. SriLankan A320neo is configured for 150 passengers in a two-class cabin layout with 12 business class seats and 138 economy class seats. It is powered by CFM Leap. The carrier will deploy the aircraft on its expanding route network connecting Colombo with destinations in India, Middle East and Far EastAirbus Industries neo series (neo stands for New Engine Option) has already proven to be highly popular in the global airline industry. The A320neo Family incorporates the latest engines and aerodynamic enhancements, delivering more than 15 percent fuel savings from day one and 20 percent by 2020. With over 4,800 orders received from 89 customers, the A320neo Family has captured over 60 percent market share in its category.The A320 Family is the worlds best-selling single aisle product line with over 12,800 orders since launch and more than 7,300 aircraft delivered to some 400 customers and operators worldwide. Thanks to their widest cabin, all members of the A320 Family offer unmatched comfort in all classes and Airbus 18 wide seats in economy as standard. SriLankan Airlines and Airbus embarked upon a long term, strategic partnership in 1993 when the airline began operating the A320 and A340. It has since grown to be an all Airbus operator with a fleet of 24 Airbus aircraftSriLankans global network covers 101 cities in 47 countries. As a member of the oneworld global airline alliance, SriLankan also connects its passengers to oneworlds worldwide network of more than 1,000 destinations in 160 countries.", 
  "title": "SriLankan Airlines welcomes the sophisticated Airbus A320neo to its fleet", 
  "url": "https://www.dgi.gov.lk/news/latest-news/700-srilankan-airlines-welcomes-the-sophisticated-airbus-a320neo-to-its-fleet"
}