{
  "date": "2017-03-01", 
  "text": "He made these remarks addressing the inaugural session of the Workshop on Sustainable Finance organized by the Central Bank of Sri Lanka, jointly with the Sustainable Banking Network (SBN) managed by International Finance Corporation (IFC), a member of the World Bank Group, at the Central Bank Auditorium, yesterday (28th Feb.).During his address the President noted that 30 percent of our countrys population is faced with serious economic difficulties and the Government has declared the year 2017 as year for the eradication of poverty on behalf of those people. He further said that the Government expects the support of all in the financial sector to achieve the success of the program.The President also pointed out the importance of environmental conservation in the process of accomplishing the economic development. He further said that it is essential the guidance of experts and professionals in all the sectors in managing the sustainable development policies.The monetary policies and management of the future development initiatives which are aimed at the development of physical resources with proper environmental evaluation, should move forward in a successful manner, the President said. He pointed out the importance of implementing a national program jointly with the financial institutions including the Central Bank, the Ministry of Environment and other relevant institutions on environmental conservation.The Governor of the Central Bank, Dr. Indrajit Coomaraswamy, representatives of the International Monetary Fund and the World Bank, national and international Financial Sector Specialists and intellectuals participated in this inaugural session.Even though the country has to face different kind of economic challenges due to the global economic crisis, the Government has given priority to the welfare of the underprivileged people, said President Maithripala Sirisena. He made these remarks addressing the inaugural session of the Workshop on Sustainable Finance organized by the Central Bank of Sri Lanka, jointly with the Sustainable Banking Network (SBN) managed by International Finance Corporation (IFC), a member of the World Bank Group, at the Central Bank Auditorium, yesterday (28th Feb.). During his address the President noted that 30 percent of our countrys population is faced with serious economic difficulties and the Government has declared the year 2017 as year for the eradication of poverty on behalf of those people. He further said that the Government expects the support of all in the financial sector to achieve the success of the program.The President also pointed out the importance of environmental conservation in the process of accomplishing the economic development. He further said that it is essential the guidance of experts and professionals in all the sectors in managing the sustainable development policies.The monetary policies and management of the future development initiatives which are aimed at the development of physical resources with proper environmental evaluation, should move forward in a successful manner, the President said. He pointed out the importance of implementing a national program jointly with the financial institutions including the Central Bank, the Ministry of Environment and other relevant institutions on environmental conservation.The Governor of the Central Bank, Dr. Indrajit Coomaraswamy, representatives of the International Monetary Fund and the World Bank, national and international Financial Sector Specialists and intellectuals participated in this inaugural session.", 
  "title": "Govt. gives priority to welfare of underprivileged - President ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/707-govt-gives-priority-to-welfare-of-underprivileged-president"
}