{
  "date": "2017-03-02", 
  "text": "President Maithripala Sirisena says we should build a country which opens schools and closes prisons.We should also build a country where healthy people are living while the number of hospitals minimized, he added.The President made these remarks at a ceremony held today (March 1) to celebrate the 150th anniversary of St. Marys College in Kegalle.He recalled the statement of Martin Luther King, the greatest tragedy of this period of social transition was not the strident clamor of the bad people, but the appalling silence of the good people and said that intellectuals and great persons should be born more and more in this country to suppress the strident clamor of the bad people.The President commended the mission carried out by the St Marys College which has a renowned history, to produce effective citizens to the country. He said the college which has good influence of the Thripitaka, Bible and the Koran is exemplary for the national reconciliation process.The President, on arrival at the college, was warmly welcomed by the students.He declared open the educational and trade exhibition, held to mark the 150th anniversary.The President presented the prizes to the students who demonstrated special skills at national and international levels.St. Marys College is one of the oldest boys colleges in Sri Lanka, having a history of nearly 150 years. It is the school of It was established in 1867 adjacent to St. Marys Church as a vernacular English school and came under the direction of Benedictine Missionaries.It was Rev. Fr. Domenico Pingulani who initiated the school and was in religious missionaries between 1864 and 1880. St. Marys College Kegalle was the fifth established Catholic boys school in Sri Lanka after the schools of Colombo, Jaffna, Kandy and Galle.Minister Ranjith Siyambalapitiya, Governor of Sabaragamuwa Province Marshal Perera, Chief Minister Maheepala Herath and the Principal of the College Mrs. Hema Wickremarathne also participated in this ceremony.The President on his way to St. Marys College looked into the well being of the students of Galigamuwa Madhya Maha Vidyalaya and had cordial discussions with them.", 
  "title": "We should build a country which opens schools and closes prisons  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/712-we-should-build-a-country-which-opens-schools-and-closes-prisons-president"
}