{
  "date": "March 02, 2017", 
  "text": "Every government should give prominence for peoples essential requirements; food, housing, health and education. The low income families have to face many problems due to the politicians who worked for their private agendas without identifying that matters of priority, says President Maithripala Sirisena.The President was speaking at the occasion to vest the second phase of the Laksanda Sevana Housing complex in Salamulla, Kolonnawa with public today (March 02). This housing complex consists of 396 houses.The beauty we can see in new roads and the stunning high storied buildings should also be seen in the lives of the people living in Colombo. Though physical development entertains the eyes, that is useless if it is unable to beautify the lives of the people, he said.The objective of the current government is to economically boost all people in the country. The development of every sector has been expedited now. The government will be succeeded in showing a large progress in all sectors including housing, urban development, agriculture, education and health, the President stated.Some groups are engaging in protests with many allegations leveled at the government. Even some media channels see only the bad side. I request all not to bring a destruction to the country by over using the democratic freedom and rights, the president further said.The Laksada Sevana housing scheme comprising of 396 housing units built at a cost of Rs 1,188 million. The houses will be given to 280 families in Sedawathta and Wadullawathta who have been displaced due to the construction of the new Kelani Bridge in parallel to the Colombo old Kelani Bridge.The Laksada Sevana housing scheme constructed in parallel to the Divisuru Purawara which is being implemented by the Urban Development Authority under the guidance of the Ministry of Megapolis and Western Development to make improve facilities in the urban areas in the Colombo city with less facilities. Each house comprises of 450-square-foot area with a living room, two bedrooms, kitchen, balcony and sanitary facilities. Expansion of the road system, construction of community centers and development of the infrastructure facilities will be completed in parallel to the construction of this housing scheme.The President opened the housing scheme by unveiling the plaque and also made an inspection tour of the Laksada Sevana housing scheme. President Sirisena symbolically handed over keys to several recipients of the houses marking the event.Ministers and MPs, including ministers Patali Champika Ranawaka, Lakshman Kiriella, Arjuna Ranatunga, Deputy Minister Lasantha Alagiyawanna, dignitaries including the Japanese Ambassador participated in this event.", 
  "title": "Housing complex of 396 houses vests with public by President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/717-housing-complex-of-396-houses-vests-with-public-by-president"
}