{
  "date": "March 06, 2017", 
  "text": "President Maithripala Sirisena says a new initiative through a new strategy will be implemented for the development of the Northern Province.The President further said that he has given instructions to all Ministers to visit the Northern Province in every month or every two months to review the progress of the development works of the respective ministries and said that he has also given instructions to present the a time frame in this regard to the Cabinet.He made these remarks participating at the opening ceremony of the first regional office of the Tell the President, program at Northern Province Governors office today (March 04).President Sirisena said that through this new program it will be simpler to present grievances and issues of the public to him. He also said that as a country we should move forward while providing solutions to the problems of every citizen. The President also said that he will visit the Northern province once in every month in the future with the relevant MPs and Ministers and the state officials to look into the steps to be taken to expedite the development program.The President, commenting on the protest carried out by the unemployed graduates said that he would be happier if they met him today, stopping that protest.Protests and fasting should be done at the essential occasions. Otherwise the value of those will be faded. There is a force being operated in the North and the South to create a rift between the government and the people, he pointed out.Even though one year has been passed after the end of the conflict hearts of the people of the country havent been connected. The effort of the current government is to build peace and brotherhood among the people by connecting those hearts so that there will not be another war in the future, he said.The Tell the President program was introduced on the 8th of January 2016, marking the one year completion of the Presidency of President Sirisena. The objective of this program is to present the issues, complaints, ideas and suggestions of the people to the President and provide quick and effective reactions and solutions to them.The people can present their issues, complaints, ideas and suggestions to the Presidential Secretariat by calling the Government Information Center through 1919, visiting the website http://tel.president.gov.lk, sending an email to This email address is being protected from spambots. You need JavaScript enabled to view it. document.getElementById('cloakae7bc6daa102f76394f4841e2399937d').innerHTML = ''; var prefix = '&#109;a' + 'i&#108;' + '&#116;o'; var path = 'hr' + 'ef' + '='; var addyae7bc6daa102f76394f4841e2399937d = 't&#101;ll' + '&#64;'; addyae7bc6daa102f76394f4841e2399937d = addyae7bc6daa102f76394f4841e2399937d + 'pr&#101;s&#105;d&#101;nts&#111;ff&#105;c&#101;' + '&#46;' + 'lk'; var addy_textae7bc6daa102f76394f4841e2399937d = 't&#101;ll' + '&#64;' + 'pr&#101;s&#105;d&#101;nts&#111;ff&#105;c&#101;' + '&#46;' + 'lk';document.getElementById('cloakae7bc6daa102f76394f4841e2399937d').innerHTML += '<a ' + path + '\\'' + prefix + ':' + addyae7bc6daa102f76394f4841e2399937d + '\\'>'+addy_textae7bc6daa102f76394f4841e2399937d+'<\\/a>'; or writing to Post Box 123, Colombo The complaints, received will be first checked by the Public Relations Unit of the Presidential Secretariat and then will be forwarded to responsible Ministries for further actions.1,098,26 complaints have been received by the Tell the President Program while 35,999 of them have been solved. 58,273 complaints are being enquired and 9,773 are pending.The People of the Northern Province will have facility to hand over their complaints from today to the newly opened office. Officers from the Presidential Secretariat have been deployed in this office. The complainers will receive the feedbacks from the office itself.The President who opened the new office observed its functions.The President also presented ten keys of the houses built for the people in Keeramale and Vallai, after freeing the lands of those areas.Minister Mahinda Samarasinghe, Duminda Dissanayake, Governor of the Northern Province Reginald Cooray, Members of the Parliament of Jaffna District M. Sumanthiran, Dharmalingam Siddhartham, Mavei Sendirajah and Angajan Ramanathan were among those participated in this event.", 
  "title": "A new program through a new plan for Northern development  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/731-a-new-program-through-a-new-plan-for-northern-development-president"
}