{
  "date": "March 07, 2017", 
  "text": " Scholarships for Diploma/Degree in Performing Arts and Fine Arts in India(CLASSICAL MUSIC/CLASSICAL DANCE/PAINTING)Applications are hereby invited for award of Scholarships for Diploma/Degree in Performing Arts and Fine Arts (Classical Music, Classical Dance and Painting) by the Indian Council for Cultural Relations (ICCR), New Delhi.Applicants should be between the age of 20-25 years and posses a minimum of three passes in GCE Advanced Level including B pass in the subject applied for e.g. Dance, Music or Art. In addition, they should have at least a simple pass in English language in GCE Ordinary Level and Advanced Level. ICCR Scholarship scheme provides scholarship in Dance, Music, Fine arts courses for one year which can be extended for two more years after reviewing their results.The application form can be obtained from the Indian Cultural Centre, No.16/2, Gregorys Road, Colombo  7 on weekdays between 9.30 am to 1.00 pm from 7 March 2017 to 17 March 2017. The applicant can also download the application forms from the sitehttp://iccr.gov.in/sites/default/files/Applicationform.pdf.The candidates have to fill up the following three application forms given below and submit to Indian Cultural Centre,16/2 Gregorys Road, Colombo or The Assistant High Commission of India, No.31 Rajapihilla Mawatha, PO Box 47, Kandy, phone no. 081-2222652 or The Consulate General of India, No.103, New Road, Hambantota, phone no. 047-2222500 or The Consulate General of India, No.14 Maruthady Lane, Nallur, Jaffna, phone no. 021-2220502.Forms to be filled in and to be submitted are the following: 1. Application Form for Scholarships including Check List and Mission's Certificate -2017 (Six Sets) ( 7 photographs)2. Physical Fitness Verification - Proforma for Health Check-Up  2016 (Six sets)3. General Instructions to Applicants -2017 Applications at ICC, Colombo will be received in between 10.00am to 1.00 pm in person on 29.3.2017 and a personal interview of the candidate will be taken on the spot. The applicants must bring their certificates in original at the time of submission of their duly filled in forms. Application forms (six sets) duly filled in and supported by VCD or DVD and photographs (7) should be handed over to The Assistant High Commission of India, Kandy or The Consulate General of India,Hambantota or The Consulate General of India,Jaffna by 29.3.2017.For further details please call ICC,Colombo at telephone No. 2684698N.B. Please be kind enough to carry this press release in your Daily/ Weekend Editions.", 
  "title": "Scholarships  for Diploma/Degree in Performing Arts and Fine Arts in India", 
  "url": "https://www.dgi.gov.lk/news/latest-news/734-scholarships-for-diploma-degree-in-performing-arts-and-fine-arts-in-india"
}