{
  "date": "2017-03-09", 
  "text": "President Maithripala Sirisena, who is on a state visit to Indonesia to attend the Indian Ocean Rim Association Leaders Summit, met with the Indonesian President Joko Widodo, yesterday (08).The Indonesian President warmly welcomed the President Sirisena when he arrived at the Merdeka Palace, the official residence of the President of Indonesia, marking the first state visit to Indonesia by a Sri Lankan Head of State in 40 years.A colourful welcome ceremony was organized at the Merdeka Palace to welcome the Sri Lankan President and a 21 Gun Salute was accorded to the President. A Bilateral meeting between the two leaders was commenced after the cordial discussions between the two leaders.The visit will help to further strengthen close friendly relations and cooperation between our countries, the Indonesia President said.It was discussed in detail regarding implementing a new plan to strengthen cooperation in the field of tourism between the two countries and further attention was focused on implementing a programme to exchange the technical knowledge in the field of agriculture. Two leaders held discussion regarding collectively working on strengthening the regional security. Their attention was also drawn to the proposal for a free trade agreement between the two countries and further discussed to look into the possibility of this through the Foreign Ministries of the two countries. The Indonesian President stated that he would provide any required support for the development programmes in Sri Lanka. The two leaders discussed to work with cooperation in the programme carried out to strengthen the democracy as democratic countries. The President further stated that opportunities for Indonesian private and government investors could be opened. The government is ready to provide required tax relief for them, he said.President Sirisena invited the Indonesian President for an official visit to Sri Lanka. He also requested to send a representative of the Indonesian government for the international Vesak festival to be held in Sri Lanka in May.In the presence of the two leaders, two agreements on maritime and fishing cooperation and the cooperation on traditional industries were signed. State Minister of Fisheries and Aquatic Resources, Duleep Vedaarachchi signed on behalf Sri Lanka while the Maritime and Fisheries minister of Indonesia signed the agreement for Indonesia.Thereafter, the two leaders attended a joint media conference.The President and the delegation attended a luncheon hosted by the Indonesian President.", 
  "title": "Indonesia & Sri Lanka to strengthen trade & economic ties", 
  "url": "https://www.dgi.gov.lk/news/latest-news/756-indonesia-sri-lanka-to-strengthen-trade-economic-ties-2"
}