{
  "date": "March 09, 2017", 
  "text": "Hosted by national carrier SriLankan Airlines, the Speculo 2017 Award Ceremony took place on 4th March 2017 at Ramada Colombo. The all-island art competition winners were presented with awards by the national airline at the high profile event, which witnessed a gathering of award -winning budding and professional artists, amidst other dignitaries.Ten shortlisted artists from the schools and open categories and 15 shortlisted professional artists were felicitated with awards, trophies, prizes and certificates.The school winners were Gayashani Dissanayake (Sirimavo Bandaranaike Vidyalaya, Colombo 7); W.A. Kaveesha K. Weerasinghe (Devi Balika Vidyalaya -Colombo 8) and N. A. Omal Selika Arachchige (D. S. Senanayake College - Colombo 08). In the Open category, Thilak Pushpakumara; S.A. Eranga Srimal; and Chamara Prasad Deeyamulla were awarded the first three places respectively. Prizes in the professional category were bagged by Shanaka Kulathunga; Basil Cooray; and Ishan Senaka Hewage respectively. A special award of appreciation was bestowed on the most senior artist in Sri Lanka, H. E. Karunaratne, who is also known as the Father of Sri Lankan Abstract Art.Budding artists from schools around the country including the areas such as Jaffna, Mannar, Bibile and Balangoda sent in their works of art for the competition, as did professors from several higher educational institutions, art teachers and even clergy members. The all-island art competition was held in the run-up to Speculo 2017, following which a national painting and visual arts exhibition was held at J. D. A. Perera Gallery from 24-26th February, featuring works by top professional artists as well as youth from all corners of the island. The competition featured over 80 professional artists (by far the most amount of professional Sri Lankan artists of esteemed repute, who have showcased their work together at a single exhibition), 350 displays and diverse pieces that were showcased under a cross-section of categories. The theme of the exhibition was My SriLankan Perspective. The exhibition was organized by SriLankan Airlines with the aim of inspiring artists from across the country to showcase their work, by creatively elaborating their perspective on the national carrier.", 
  "title": "Winners of Speculo 2017 Art Exhibition Felicitated by SriLankan Airlines", 
  "url": "https://www.dgi.gov.lk/news/latest-news/757-winners-of-speculo-2017-art-exhibition-felicitated-by-srilankan-airlines"
}