{
  "date": "March 10, 2017", 
  "text": "Increasing of the womens participation in the political sector in order to create a clean, honest and sociable political movement will be an important factor in the future, says President Maithripala Sirisena.The President was speaking at a ceremony organized by the SLFP Womens Front to mark the International Womens Day. The President was the chief guest at this ceremony, held today (March 9) in the SLFP Headquarters.Pure political characters in a pure political movement are needed by the country today. Our mothers and daughters have strength to render a clean and honest service to the people. The current government has taken steps to create the legal environment to increase womens representation in forthcoming elections, he said.The people of the country today expect honest and clean political movement which is free from fraud, corruption, irregularity, misuse of public property and without hollow noises. The SLFP should be committed to fulfill those political expectations of the people, he stated.The government will work according to the committed government policy to increase the womens representation and to give them their responsibilities in the activities of the SLFP and other work carried out under the state patronage, the president further stated.The ceremony was commenced with remembrance of the founder of the SLFP, S. W. R. D. Bandaranaike and Mrs. Sirimavo Bandaranaike.President Sirisena presented souvenirs to senior members of the SLFP Womens Front.The facebook page of the SLFP Womens Front was also launched at this occasion.Former President Chandrika Bandaranaike Kumaratunga, General Secretary of the SLFP Duminda Dissanayake, General Secretary of the UPFA Minister Mahinda Amaraweeera, Minister Nimal Siripala de Silva, State Minister Sudarshini Fernando Pulle and the Deputy Minister Sumedha G. Jayasena were among those participated in this ceremony.", 
  "title": "Womens participation is an essential factor for purity in politics  President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/762-women-s-participation-is-an-essential-factor-for-purity-in-politics-president"
}