{
  "date": "2017-03-10", 
  "text": "According to the records of archaeologists, Kachchativu Island had emerged from water over 115,000 to 130,000 years ago.The Portuguese had first administered this island during their reign in the Island nation and Sri Lanka has been exercising sovereignty and jurisdiction over Kachchativu and its adjacent waters without interruption. The church on the island is said to be built in early 1900s, dedicated to St. Anthony who is considered to be the Patron Saint of fishermen.Kachchativu, being a small distant island of 1.15 square kilometers located 20 km away from the Delft Island, with no human habitation. However, the fishing community has used this island over the years in order to mend their fishing gear after strenuous venture out at sea. Incidentally, the small St. Anthony's Church in Kachchativu had become their place of reverence during such visits.The annual Kachchativu feast which is traditionally held in February or March, is attended by a large number of Indian as well as Sri Lankan devotees with a great sense of spiritual attachment to St. Anthony's Church. However, with the staggering number of devotees visit the island for the annual church mass, the necessity was felt to build a new church on the island.At the request made by the Bishop of the Jaffna His Lordship Rt Rev Justin Bernard Gnanapragasam and following directives of the Commander of the Navy, Vice Admiral Ravindra Wijegunaratne, the Sri Lanka Navy undertook the construction of new St. Anthonys Church by laying the foundation stone of the new church on 09th May 2016. Turning over a new leaf in history, within a time span of 7 months, the Navy erected the new church and bestowed it on the Roman Catholic Diocese of Jaffna on 23rd December 2016.Against this backdrop, this years annual feast of the newly built St. Anthonys church in Kachchativu is set to get underway on a grand scale on 12th March 2017. Meanwhile, Sri Lanka Navy being the main facilitator of this historic occasion is geared up in all aspects to provide required facilities which include meals, infrastructure, installation of sanitary and drinking water to both local and Indian devotees.On the sidelines of aforesaid event, the Commander of the Navy is also scheduled to declare open the newly constructed Delft Jetty and Kachchativu Pier in Jaffna on 11th March 2017, with the intention of extending Sri Lanka Navys assistance to regulate transportation among islands in the Jaffna Peninsula. In addition, a water distribution project is also due to be declared open, providing a long waited relief to the Nallinakkapuram villagers.Meanwhile, 9,000 devotees from both India and Sri Lanka are expected to take part in this years Kachchativu Feast.", 
  "title": "Road to Kachchativu Feast  2017", 
  "url": "https://www.dgi.gov.lk/news/latest-news/763-road-to-kachchativu-feast-2017"
}