{
  "date": "2017-03-12", 
  "text": "Sri Lanka is forecasted to get normal rain in 2017, but farmers outside the wet zone have been advised to grow short maturing rice, alternative crops with tanks starting the next cropping season with low water levels, the Department of Agriculture said. In the next Yala minor season, there is expected to be normal rainfall in the Wet zone in the Dry and Intermediate zones rainfall will be low as usual, the Agro-climatology & Climate Change Division of Sri Lanka's Department of Agriculture said.Due to the lagging effect of last year's drought, irrigation tanks are low in water and it was unlikely that they will get enough water to reach capacity in the next two months.\"Therefore, it is highly advisable to grow short-age crops and varieties during Yala 2017 season in the Dry and Intermediate zones,\" the Department of Agriculture said in a weather update.\"In paddy fields, priority should be given to 2.5-months paddy varieties.\"In field that tend to dry up quickly other field crops like green gram, black gram cow-pea, sesame and vegetables should be grown, the department said.In Sri Lanka's Wet zone covering the South Western area, rice could be grown widely.\"It is likely that Wet zone of the country will continue to receive substantial amount of rains from mid-March onwards and therefore, every possible actions should be taken to bring a maximum possible extent of paddy lands to cultivation from this climatic zone,\" the statement said.On average it takes about 1,400 liters of rice to produce a kilogram of rice, especially in East Asia.But depending on the yield and the condition of the field which soak up water it may take up to 3500 to 4000 liters of water to produce a kilo of rice. Unlike other crops, rice is grown in flooded conditions.The warning is coming as the main Maha cultivation season is ending, with up to 137,000 hectares of paddy fields hit by drought.The Department of Agriculture tried to discourage farmers in areas where water shortages were forecasted last year, so that they could earn some income from an alternative crop.But officials said many farmers did not heed their advice, partly due to a faith that rains would eventually come, and partly because they wanted the security of having a store of rice.Rice production in Sri Lanka's main Maha cultivation season is expected to be sharply down in 2017, with lower output also in the Yala season despite normal rainfall being predicted, for this year. (CDN)", 
  "title": "Sri Lanka farmers advised to grow short maturing rice, other crops in 2017", 
  "url": "https://www.dgi.gov.lk/news/latest-news/774-sri-lanka-farmers-advised-to-grow-short-maturing-rice-other-crops-in-2021"
}