{
  "date": "March 12, 2017", 
  "text": "National career, SriLankan Airlines has always been mindful of their larger role it plays in a multi ethnic, multi religious and multi lingual society and as such has implemented a dynamic CSR programme which serves and benefits all communities. In recognition of the efforts of driving the Corporate Social Responsibility (CSR) practices with a futuristic vision, SriLankan Airlines Head of Human Resources, Pradeepa Kekulawala, was honored by being listed in the 100 most impactful CSR Leaders for the Airline efforts, at the 25th edition of the World CSR Congress, held in Mumbai, India recently.As the national carrier of Sri Lanka, we have been fully aware of our responsibility towards the community. Our CSR philosophy consist of three pillars; Child, Planet and Talent. Under each of these verticals the airline has introduced impactful CSR programmes and initiatives to make a difference in the lives of thousands of people, said Pradeepa Kekulawala.SriLankan Airlines was recognized for the dynamic leadership of Pradeepa Kekulawala, and his commitment to CSR which was manifested through many of the very successful projects undertaken. This Award also recognizes excellence in CSR achievements for ethical businesses practices, fostering a corporate culture of innovation and optimization and a value system that supports the objectives of the organization.Under the guidance of Pradeepa Kekulawala, the two specialized CSR units of SriLankan Airlines, SriLankan Cares and SriLankan Environment Strategy & Compliance unit are conducting specific CSR initiatives to maximize the positive impact on society and minimize the negative influence on the environment, whilst supporting the company's strategic CSR objectives.A veteran professional in the field of Human Resources with managerial experience amassed over two and a half decades, Pradeepa Kekulawala has been holding crucial management positions in the disciplines of project management, general management, marketing and business development before he made the transition into the field of HR and focused his aspirations on mastering the art of human resource development.Amongst his noteworthy achievements, in recognition of his contribution towards promoting the cause of IATA as a keen aviation HR Leader, Pradeepa was appointed to the IATAs Geneva based Human Capital Development Network Steering Committee as a founder member. He has made knowledge sharing presentations at numerous IATA events globally, representing the Airline. Under his stewardship, SriLankan Airlines HR function has evolved into a robust business partnering function, winning many accolades along the way locally and internationally including the prestigious Best HR strategy in line with the business strategy award at the 5th Asias Best Employer Brand Awards held last year in Singapore and the HR Excellence Awards in the local corporate sector in both 2012 and 2015 in Sri Lanka.", 
  "title": "SriLankan Airlines CSR leadership recognized", 
  "url": "https://www.dgi.gov.lk/news/latest-news/778-srilankan-airlines-csr-leadership-recognized-2"
}