{
  "date": "2017-03-13", 
  "text": "Sri Lanka Labour Force Survey (LFS) is designed to measure levels and trends of employment, unemployment and labour force in Sri Lanka. This survey has been conducted quarterly, since the first quarter of 1990.LFS 2016 is the 36th year of the survey series.The Department of Census and Statistics (DCS) has released labour force statistics of third quarter of 2016, based on a sample of 6440 housing units. The statistics of this News Release are coming from the new series of statistics after the reweighting process of labour force statistics. The field work of the survey for the third quarter was carried out in July, Augustand September of 2016 covering the whole country.The working age for Sri Lanka is defined as age 15 years and above. The total working age population who are employed or unemployed during the reference week is identified as the economically active population or labour force. The estimated economically active population is about 8.4 million in the third quarter 2016, of which 63.5 percent are males and 36.5 percent are females.The labour force is defined as the currently economically active population who are in working age. Labour force population expressed as a percentage of the working age population (age 15 years and over) is the labour force participation rate (LFPR). The survey results reveal that the overall LFPR for the third quarter is 53.8 percent and this is 75.0 percent and 36.1 percent for males and females respectively.Persons, who worked at least one hour during the reference period, as paid employees, employers, own account workers or contributing family workers are said to be employed. The estimated employed population is about 8.0 million for this quarter, of which, about 46.1 percent engaged in Services sector, 27.1 percent in Agriculture sector and 26.8 percent in Industry sector. The highest employment share is in service sector and this pattern is same for both male and female. Also the survey reveals that 68.0 percent of the employed population works more than 40 hours per week.During the reference period persons who did not work and looking for work and taken actions to find a job during last four weeks and ready to accept a job given a work opportunity within next two weeks are said to be unemployed. The proportion of unemployed population to the total labour force is unemployment rate. Dr. A.J. Satharasinghe, Director General of the DCS stated that the estimated unemployment rate for the third quarter 2016 was 4.5 percent.Dr. A.J. SatharasingheDirector GeneralDepartment of Census and StatisticsSri Lanka Labour Force Survey (LFS) is designed to measure levels and trends of employment, unemployment and labour force in Sri Lanka. This survey has been conducted quarterly, since the first quarter of 1990.LFS 2016 is the 36th year of the survey series.The Department of Census and Statistics (DCS) has released labour force statistics of third quarter of 2016, based on a sample of 6440 housing units. The statistics of this News Release are coming from the new series of statistics after the reweighting process of labour force statistics. The field work of the survey for the third quarter was carried out in July, Augustand September of 2016 covering the whole country.The working age for Sri Lanka is defined as age 15 years and above. The total working age population who are employed or unemployed during the reference week is identified as the economically active population or labour force. The estimated economically active population is about 8.4 million in the third quarter 2016, of which 63.5 percent are males and 36.5 percent are females.The labour force is defined as the currently economically active population who are in working age. Labour force population expressed as a percentage of the working age population (age 15 years and over) is the labour force participation rate (LFPR). The survey results reveal that the overall LFPR for the third quarter is 53.8 percent and this is 75.0 percent and 36.1 percent for males and females respectively.Persons, who worked at least one hour during the reference period, as paid employees, employers, own account workers or contributing family workers are said to be employed. The estimated employed population is about 8.0 million for this quarter, of which, about 46.1 percent engaged in Services sector, 27.1 percent in Agriculture sector and 26.8 percent in Industry sector. The highest employment share is in service sector and this pattern is same for both male and female. Also the survey reveals that 68.0 percent of the employed population works more than 40 hours per week.During the reference period persons who did not work and looking for work and taken actions to find a job during last four weeks and ready to accept a job given a work opportunity within next two weeks are said to be unemployed. The proportion of unemployed population to the total labour force is unemployment rate. Dr. A.J. Satharasinghe, Director General of the DCS stated that the estimated unemployment rate for the third quarter 2016 was 4.5 percent.Dr. A.J. SatharasingheDirector GeneralDepartment of Census and Statistics", 
  "title": "  Sri Lanka Labour Force Survey  3rd Quarter 2016", 
  "url": "https://www.dgi.gov.lk/news/latest-news/790-sri-lanka-labour-force-survey-3rd-quarter-2017"
}