{
  "date": "March 13, 2017", 
  "text": "The full interview with President Sirisena will appear in The Report: Sri Lanka 2017, OBGs forthcoming publication on the countrys economy.In the interview, the President said he hoped that Sri Lanka would be able to use its strategic location to attract international businesses looking for a gateway into India.We have met many investors who are waiting to see what kind of integration we have with India, so that they can come and invest here, employ people and create exports for the Indian market, he told OBG.The President also mapped out Sri Lankas plans to sharpen its focus on science and technology as a driver of economic development. He acknowledged that more needed to be done in this field, but said plans to establish a regional centre for innovation in Colombo reaffirmed the governments commitment to becoming a knowledge-led economy with a skilled human resource base.The Report: Sri Lanka 2017 will be a vital guide to the many facets of the country, including its macroeconomics, infrastructure, banking and other sectoral developments. The publication will contain a detailed, sector-by-sector guide for investors, alongside contributions from leading personalities, including Prime Minister Ranil Wickremesinghe, and Ban Ki-moon, former UN Secretary-General. It will be available in print and online.The key role that intra-regional economic integration can play in strengthening security across South Asia was highlighted by President Maithripala Sirisena, in a wide-ranging interview with Oxford Business Group (OBG).Sirisena noted, however, that regional economic cooperation had yet to produce equitable increases.He told OBG that Sri Lanka would like to see fairer outcomes across the board for the South Asian countries that were working to foster closer ties.Sri Lanka advocates increased economic cooperation based on equitable trade by complementing the strengths of each economy, he told OBG. Such regional cooperation would definitely lead to stronger security coordination in the region.The full interview with President Sirisena will appear in The Report: Sri Lanka 2017, OBGs forthcoming publication on the countrys economy.In the interview, the President said he hoped that Sri Lanka would be able to use its strategic location to attract international businesses looking for a gateway into India.We have met many investors who are waiting to see what kind of integration we have with India, so that they can come and invest here, employ people and create exports for the Indian market, he told OBG.The President also mapped out Sri Lankas plans to sharpen its focus on science and technology as a driver of economic development. He acknowledged that more needed to be done in this field, but said plans to establish a regional centre for innovation in Colombo reaffirmed the governments commitment to becoming a knowledge-led economy with a skilled human resource base.The Report: Sri Lanka 2017 will be a vital guide to the many facets of the country, including its macroeconomics, infrastructure, banking and other sectoral developments. The publication will contain a detailed, sector-by-sector guide for investors, alongside contributions from leading personalities, including Prime Minister Ranil Wickremesinghe, and Ban Ki-moon, former UN Secretary-General. It will be available in print and online.", 
  "title": "Economic cooperation should be based on equitable trade: President", 
  "url": "https://www.dgi.gov.lk/news/latest-news/792-economic-cooperation-should-be-based-on-equitable-trade-president-2"
}