{
  "date": "2017-03-16", 
  "text": "The High Commission of Canada to Sri Lanka and Embassy of Canada to Maldives is aware of recent erroneous media reporting on entry/visa requirements for Sri Lankan business and tourist travellers suggesting changes to Canadas entry requirements for Sri Lankan travellers. This reporting is false. Sri Lankan citizens require visas for travel to Canada. There have been no recent changes to visa requirements for Sri Lankan travellers.Any notification of changes would be announced by the Government of Canada via Government of Canada websites, social media (@CanHCSriLanka) and press releases.The High Commission of Canada encourages all travelers to verify visa and entry requirements and ensure that they have proper visas required for entry to Canada in advance of travel. Sri Lankan citizens contemplating travel to Canada are encouraged to check http://www.cic.gc.ca/english/visit/index.asp for accurate information on visa and entry requirements for Canada and for more information on how to apply. The High Commission of Canada to Sri Lanka and Embassy of Canada to Maldives is aware of recent erroneous media reporting on entry/visa requirements for Sri Lankan business and tourist travellers suggesting changes to Canadas entry requirements for Sri Lankan travellers. This reporting is false. Sri Lankan citizens require visas for travel to Canada. There have been no recent changes to visa requirements for Sri Lankan travellers.Any notification of changes would be announced by the Government of Canada via Government of Canada websites, social media (@CanHCSriLanka) and press releases.The High Commission of Canada encourages all travelers to verify visa and entry requirements and ensure that they have proper visas required for entry to Canada in advance of travel. Sri Lankan citizens contemplating travel to Canada are encouraged to check http://www.cic.gc.ca/english/visit/index.asp for accurate information on visa and entry requirements for Canada and for more information on how to apply. High Commission of Canada", 
  "title": " No Changes to Canadas Visa Requirements for Sri Lankan Travellers ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/840-no-changes-to-canada-s-visa-requirements-for-sri-lankan-travellers-2"
}