{
  "date": "March 21, 2017", 
  "text": "The Investiture Ceremony of conferring National Honors on distinguished personalities, who rendered a noble service to the country and its advancement was held yesterday (20th March) at Nelum Pokuna Theater, under the patronage of President Maithripala Sirisena. These awards were bestowed on the most distinguished persons who have made outstanding contributions to the country and its advancement.At this ceremony, held after 12 years, the President presented national honors to 89 persons lauding their individual contributions in many spheres.The highest honor conferred for exceptionally outstanding and most distinguished service to the nation was conferred on late Pandith Amaradewa.The Sri Lanka Ranjana which is awarded to non-nationals for distinguished service of a highly meritorious nature to Sri Lanka in particular and / or humanity in general was awarded to Dr. Sarath D. Gunapala and Siddhartha Kaul.Ten (10) Deshamanya awards were conferred in recognition of distinguished service of a highly meritorious nature to the nation. The awardees were Abbasally Akbar, Prof. Colvin Goonaratna, Dr. Devanesan Nesiah, Nandadasa Rajapaksha, Prof. Kingsley Muthumuni de Silva, Latha Walpola Mineka Presantha Wickramasingha, Prof. Priyani Soysa, Amaradasa Gunawardana and Tissa Devendra.Nine (09) Deshabandu awards were conferred for distinguished service of a meritorious nature to the nation. Deivanayagam Eassuwaren, Doctor Lakshman Weerasena, Leslie Shelton Devendra, Captain M. G. Kularatne, Susanthika Jayasingha, Ranjan Madugalle, Shan Wickremesinghe, Dr. Pabilis Silva and W. K. H. Wegapitiya were the awardees.Eleven Vidyajothi awards were conferred on prof. Nimal Senanayake, Dr. Bandula Wijayarathna, Doctor Colvin Samarasinghe, Prof. Harendra de Silva, Prof. T. K. Nimal Padmasena, Prof. Errol Radcliffe Jansz, Prof.Lal Chandrasena, Prof. M. W. J. G. Mendis, Prof. M. M. R. Waas Jayasekara, Prof. Sarath Kotagama and Prof. Tissa Vitarana.In addition, 22 Kala Keerthi awards, seven Sri Lanka Shikamani awards, ten Vidyanidhi awards, thirteen Kalashuri awards, two Sri Lankathilaka awards and two Veera Prathapa awards were conferred.According to the act of the National Honours  1986, the awardees of these national honours are selected out of the nominations presented by individuals and public organizations. The nominations are also inspected by an intellectual panel. Ninety persons were selected out of 426 applications forwarded for this years award ceremony.Prime Minister Ranil Wickremesinghe and Speaker Karu Jayasuriya also participated in this ceremony.", 
  "title": "National Honours  2017 held under Presidents patronage", 
  "url": "https://www.dgi.gov.lk/news/latest-news/876-national-honours-2017-held-under-president-s-patronage-4"
}