{
  "date": "2017-03-27", 
  "text": "Indonesian Tourism Minister, Arief Yahya ceremonially inaugurated Sri Lankas tourism stall at Astindo Fair 2017 on Friday morning (24 March) at the Jakarta Convention Center (JCC) in Indonesia. Sri Lankas Ambassador in Jakarta, Dharshana Perera, Embassy Officials, Sri Lankan tour operators / companies joined in the opening ceremony.This is the first time Sri Lanka is participating at Astindo. Six prominent Sri Lankan travel and tour companies - Lanka Sportreizen, Deluxe Vacations (Pvt) Ltd , Jetwin Travels, Green Holiday, Nawamini Travels (Pvt) Ltd (www.nawamini.travel), one hotelier- The Hilton Colombo (Colombo.hilton.com) and SriLankan Airlines are part of the countrys presence.Astindo Fair is Indonesias one of the biggest, most comprehensive tourism forums and an event where travel and tourism industry engage with consumers to gain information and access on traveling for their dream destinations.Tourism has featured highly during the discussions between President H.E. Maithripala Sirisena (March 2017) and Prime Minister Hon. Ranil Wickremesinghe (August 2016) had with H.E. Joko Widodo, President of Indonesia.Sri Lankas participation is a partnership between The Embassy of Sri Lanka in Jakarta, Sri Lanka Tourism Promotion Bureau (SLTB) and tourism industry partners.Studies show a market potential to capture an estimate 9.2 percent of Indonesias 260 Million plus population who travel overseas for leisure at least once a year. Another 9 percent travel on leisure within Indonesia and outside Indonesia at least once a year. This makes Indonesia high potential emerging market for the Sri Lankan tourism industry.Embassy of Sri LankaIndonesian Tourism Minister, Arief Yahya ceremonially inaugurated Sri Lankas tourism stall at Astindo Fair 2017 on Friday morning (24 March) at the Jakarta Convention Center (JCC) in Indonesia. Sri Lankas Ambassador in Jakarta, Dharshana Perera, Embassy Officials, Sri Lankan tour operators / companies joined in the opening ceremony.This is the first time Sri Lanka is participating at Astindo. Six prominent Sri Lankan travel and tour companies - Lanka Sportreizen, Deluxe Vacations (Pvt) Ltd , Jetwin Travels, Green Holiday, Nawamini Travels (Pvt) Ltd (www.nawamini.travel), one hotelier- The Hilton Colombo (Colombo.hilton.com) and SriLankan Airlines are part of the countrys presence.Astindo Fair is Indonesias one of the biggest, most comprehensive tourism forums and an event where travel and tourism industry engage with consumers to gain information and access on traveling for their dream destinations.Tourism has featured highly during the discussions between President H.E. Maithripala Sirisena (March 2017) and Prime Minister Hon. Ranil Wickremesinghe (August 2016) had with H.E. Joko Widodo, President of Indonesia.Sri Lankas participation is a partnership between The Embassy of Sri Lanka in Jakarta, Sri Lanka Tourism Promotion Bureau (SLTB) and tourism industry partners.Studies show a market potential to capture an estimate 9.2 percent of Indonesias 260 Million plus population who travel overseas for leisure at least once a year. Another 9 percent travel on leisure within Indonesia and outside Indonesia at least once a year. This makes Indonesia high potential emerging market for the Sri Lankan tourism industry.Embassy of Sri Lanka", 
  "title": "Indonesian Tourism Minister Arief Yahya Opens Sri Lanka Stall at ASTINDO 2017", 
  "url": "https://www.dgi.gov.lk/news/latest-news/912-indonesian-tourism-minister-arief-yahya-opens-sri-lanka-stall-at-astindo-2017"
}