{
  "date": "March 28, 2017", 
  "text": "People will be relieved of tax burden as soon as possible  Sri Lanka has been able to build a positive international image subsequent to its ability to make changes to the economy during the last two years, Finance Minister Ravi Karunanayake said. The Minister points out such changes in the local economy have been recognized internationally although it is not palatable to certain extremist politicians.Minister Karunanayake stated these views during a ceremony held at the Finance Ministry yesterday (27th March) to mark the conferment of the award for the Best Finance Minister of Asia Pacific Region on him by an internationally recognized London based Financial Magazine The Banker.Speaking further, Minister Ravi Karunanayake expressed the following views as well:We wouldnt have been able to achieve this victory without the leadership of President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe. I made a request soon after I assumed duty on January 10, 2015. That is to work together like one family and take the ministry activities forward. My request was honored. Certain groups in Sri Lanka looked at our work with a crooked eye but our work has been assessed and appreciated internationally. This award is clear evidence to our good work and our journey forward. We should use this international recognition in building up our country.A country cannot run on loans. Loans should be turned into investment. When independence was declared for our country in 1948, Japan remained equal to Sri Lanka. However, per capita income in Japan is currently USD 55,000 while ours is USD 4000. What is the barrier standing before us? It is the way of our thinking, our work and the way of how we negotiate with the rest of the world. Therefore, we have a good opportunity to think anew.When we assumed office, the countrys revenue was not sufficient to repay loan installments. But unity and the commitment by the people helped us to make achievements. We are now earning more than that of the recurrent expenditure. Therefore we do not need to obtain loans to repay already taken loans. The difficulties faced by the people today are a commitment that made to ensure a better tomorrow. The existing taxes will be reduced within a short time and benefits will be passed on to the people soon, the minister said.Parliamentarians Nalin Bandara, Hector Appuhamy and Acting Secretary of the Finance Ministry Chandra Ekanayake, Deputy Secretaries S.R. Atygalle and A.R. Deshapriya and several ministry officials participated in this event.", 
  "title": "Emerging international image on Sri Lanka would bring benefits to people - Finance Minister", 
  "url": "https://www.dgi.gov.lk/news/latest-news/916-emerging-international-image-on-sri-lanka-would-bring-benefits-to-people-finance-minister-2"
}