{
  "date": "March 30, 2017", 
  "text": "Addressing a gathering at the unveiling of the Buddha statue at Suduwella, Maradana, the Prime Minister observed that people of all ethnicities and religious groups had come for the unveiling, demonstrating the power of reconciliation and unity in the country.We must create a Sri Lankan identity under which all ethnicities are united within a unitary Sri Lanka. For this we need reconciliation between religions and act without causing religious or ethnic conflict. To bring about such an environment, there needs to be a suitable a political solution, the Prime Minister said.Such a solution, he added was discussed at the Parliament Constitutional Council and the Steering Committee.There is no obstacle in the path to national reconciliation. All have accepted that we have to act within a unitary state, the Prime Minister further said.When speaking of creating national reconciliation, he asked for thinking of ways in which we can devolve power without separating the country.No one has asked for the country to be divided. To strengthen the unitary structure of the state, we need to devolve power so that the citizens of each area can easily carry out their work and have the freedom to practice their religion of choice, the Premier said.He further explained that the Chief Ministers of the Northern and Southern Provincial Councils have asked for greater power sharing at the provincial level.If we can solve our political problems and act on creating religious reconciliation, we will be a country with no ethnic strife and this will enable us to develop at a fast pace. Different political parties have various stances, such diversity is needed. Such ideas however have to be put forward in support of their country and faith.But those holding certain political opinions state that this will eliminate the Sinhalese, take away the rights of the Tamils and not allow the Muslims to live in the country. Such racist ideologies are not rational and such racism is aroused by those who have failed politically. We do not need such ideologies today, we need to instead think of ways in which we can work and live together, the Prime Minister said.At the last Presidential election, we left aside our political issues, to come together to support the common candidate, Maithripala Sirisena who was chosen to take all people in this country, together along a single journey and if we can go together on this journey, we can grow faster, the Premier said.We have given clear statements on our journey to the people. We do not want another war. Our aim is to develop our country. We dont need people who scream that if power is devolved, the country with be divided, Buddhism will disappear or that the Tamil peoples rights wont be taken into account, the Prime Minister added. (CDN)Prime Minister Ranil Wickremesinghe yesterday stressed that a political solution which paves the way to ethnic harmony and reconciliation among various religious groups was needed to fast track growth and development in the country. Addressing a gathering at the unveiling of the Buddha statue at Suduwella, Maradana, the Prime Minister observed that people of all ethnicities and religious groups had come for the unveiling, demonstrating the power of reconciliation and unity in the country.We must create a Sri Lankan identity under which all ethnicities are united within a unitary Sri Lanka. For this we need reconciliation between religions and act without causing religious or ethnic conflict. To bring about such an environment, there needs to be a suitable a political solution, the Prime Minister said.Such a solution, he added was discussed at the Parliament Constitutional Council and the Steering Committee.There is no obstacle in the path to national reconciliation. All have accepted that we have to act within a unitary state, the Prime Minister further said.When speaking of creating national reconciliation, he asked for thinking of ways in which we can devolve power without separating the country.No one has asked for the country to be divided. To strengthen the unitary structure of the state, we need to devolve power so that the citizens of each area can easily carry out their work and have the freedom to practice their religion of choice, the Premier said.He further explained that the Chief Ministers of the Northern and Southern Provincial Councils have asked for greater power sharing at the provincial level.If we can solve our political problems and act on creating religious reconciliation, we will be a country with no ethnic strife and this will enable us to develop at a fast pace. Different political parties have various stances, such diversity is needed. Such ideas however have to be put forward in support of their country and faith.But those holding certain political opinions state that this will eliminate the Sinhalese, take away the rights of the Tamils and not allow the Muslims to live in the country. Such racist ideologies are not rational and such racism is aroused by those who have failed politically. We do not need such ideologies today, we need to instead think of ways in which we can work and live together, the Prime Minister said.At the last Presidential election, we left aside our political issues, to come together to support the common candidate, Maithripala Sirisena who was chosen to take all people in this country, together along a single journey and if we can go together on this journey, we can grow faster, the Premier said.We have given clear statements on our journey to the people. We do not want another war. Our aim is to develop our country. We dont need people who scream that if power is devolved, the country with be divided, Buddhism will disappear or that the Tamil peoples rights wont be taken into account, the Prime Minister added. (CDN)", 
  "title": "Political solution leading to ethnic harmony needed to fast track the countrys development: PM", 
  "url": "https://www.dgi.gov.lk/news/latest-news/933-political-solution-leading-to-ethnic-harmony-needed-to-fast-track-the-country-s-development-pm-2"
}