{
  "date": "March 31, 2017", 
  "text": "The inauguration ceremony will be held today at 10.00 a.m. under the patronage of President Sirisena and the National Celebration is open for public from 9.00 a.m. to 10 p.m.The National Celebration will be held covering the Sustainable Development goals of poverty, agriculture, health, education, women empowerment, water, energy, employment, industries, reduce inequalities, sustainable cities and communities, climate change, marine biodiversity, peace and implementation of a common plan, announced by the UN at the United Nations Sustainable Development Summit 2015.The exhibition stalls will be designed by respective Ministries and various institutions displaying their visions and methods to achieve those goals. The five days of the exhibition have been allocated according to the UN Sustainable Development goals and separate themes will be used for each day.In addition, a series of cultural shows named Gemi Ranga Madala will be held throughout the evenings of the five days.Art competitions for children, angam pora exhibitions, toxin free cookery programs, health clinics, green job fair, supporting programs for green entrepreneurs, publishing research reports, exhibition of new creations, debates, screening of films, farmers meetings, solutions for customers issues, physical fitness programs and intellectual discussions will be held in line with this national celebration.Sustain Lanka National Celebration organized in parallel to the A Toxin Free Nation three year plan, a concept of President Maithripala Sirisena and in accordance with the Sustainable Development Goals announced by the United Nations, will be held from today (31st March ) to 4th April at BMICH. The inauguration ceremony will be held today at 10.00 a.m. under the patronage of President Sirisena and the National Celebration is open for public from 9.00 a.m. to 10 p.m.The National Celebration will be held covering the Sustainable Development goals of poverty, agriculture, health, education, women empowerment, water, energy, employment, industries, reduce inequalities, sustainable cities and communities, climate change, marine biodiversity, peace and implementation of a common plan, announced by the UN at the United Nations Sustainable Development Summit 2015.The exhibition stalls will be designed by respective Ministries and various institutions displaying their visions and methods to achieve those goals. The five days of the exhibition have been allocated according to the UN Sustainable Development goals and separate themes will be used for each day.In addition, a series of cultural shows named Gemi Ranga Madala will be held throughout the evenings of the five days.Art competitions for children, angam pora exhibitions, toxin free cookery programs, health clinics, green job fair, supporting programs for green entrepreneurs, publishing research reports, exhibition of new creations, debates, screening of films, farmers meetings, solutions for customers issues, physical fitness programs and intellectual discussions will be held in line with this national celebration.", 
  "title": "Sustain Lanka National Celebration begins today at BMICH", 
  "url": "https://www.dgi.gov.lk/news/latest-news/936-sustain-lanka-national-celebration-begins-today-at-bmich-2"
}