{
  "date": "March 31, 2017", 
  "text": "He said the new legislation would be titled Independent Council for News Media Standards Act. Deputy Minister Paranavithana said several models of media regulation have been proposed in this regard, adding that the model which would be most suitable to the Sri Lankan context would be selected in consultation with all stakeholders.He said several roundtable discussions with media owners, journalists and journalists associations would be held shortly to come to an agreement on the legislation, prior to making the official draft.Asked whether the new legislation would replace the Sri Lanka Press Council Act, the Deputy Minister said it has not been decided yet.However he said the Press Council has already been asked not to exercise its draconian powers vested under the Press Council Act.Asked whether the new regulation would cover even the online media, Paranavithana observed regulation of online media via legislation would be practically difficult.However, he said the Media Ministry would soon establish a separate section called Social Media Development Section to deal with social media related issues.Under this, certain measures will be taken to get qualitative outcome from the web-based media. We will also organize training programs for social media journalists and educate them on ethics. Our approach to web-based media will be educationally driven rather than regulation, he said. (CDN)The Parliamentary Reforms and Mass Media Ministry is engaged in drafting new legislation to set up an Independent Media Council, Deputy Minister Karunarathna Paranavithana said. He said the new legislation would be titled Independent Council for News Media Standards Act. Deputy Minister Paranavithana said several models of media regulation have been proposed in this regard, adding that the model which would be most suitable to the Sri Lankan context would be selected in consultation with all stakeholders.He said several roundtable discussions with media owners, journalists and journalists associations would be held shortly to come to an agreement on the legislation, prior to making the official draft.Asked whether the new legislation would replace the Sri Lanka Press Council Act, the Deputy Minister said it has not been decided yet.However he said the Press Council has already been asked not to exercise its draconian powers vested under the Press Council Act.Asked whether the new regulation would cover even the online media, Paranavithana observed regulation of online media via legislation would be practically difficult.However, he said the Media Ministry would soon establish a separate section called Social Media Development Section to deal with social media related issues.Under this, certain measures will be taken to get qualitative outcome from the web-based media. We will also organize training programs for social media journalists and educate them on ethics. Our approach to web-based media will be educationally driven rather than regulation, he said. (CDN)", 
  "title": "Independent Media Council in the offing ", 
  "url": "https://www.dgi.gov.lk/news/latest-news/937-independent-media-council-in-the-offing"
}