{
  "date": "April 03, 2017", 
  "text": "He said that already Rs. 120 million has been disbursed for this initiative and the amount of Rs 75,000 granted for each project will be increased up to Rs 150,000 from next time while the number of projects will be increased from 1,500 to 3,000.The Premier was addressing the closing ceremony of the Yowun Puraya  2017 held yesterday (2nd April) in Trincomalee.He hoped that many self-employment opportunities will also be generated under the Swashakthi initiative.While praising the youth for implementing many valuable projects worth over Rs. 120 million, he invited the countrys youth to join the youth clubs of their areas to take leadership for such projects. Then we can empower you to work for your area by providing funds from the decentralized budget, he added.This is the first time that the representatives of Yowun Puraya are meeting in the North and East. And also it is the first time that we meet in the Opposition Leaders electorate. He invited us, supported us and this depicts the reconciliation in the country. Prime Minister Wickremesinghe further said that he and President Maithripala Sirisena during their youth only saw the conflict. But, we want to establish peace, reconciliation, and development in this country during your youth.Provisions granted under the Gamata Kotiyak initiative, implemented through the National Youth Services Council will be increased in the future, said Prime Minster Ranil Wickremesinghe. He said that already Rs. 120 million has been disbursed for this initiative and the amount of Rs 75,000 granted for each project will be increased up to Rs 150,000 from next time while the number of projects will be increased from 1,500 to 3,000.The Premier was addressing the closing ceremony of the Yowun Puraya  2017 held yesterday (2nd April) in Trincomalee.He hoped that many self-employment opportunities will also be generated under the Swashakthi initiative.While praising the youth for implementing many valuable projects worth over Rs. 120 million, he invited the countrys youth to join the youth clubs of their areas to take leadership for such projects. Then we can empower you to work for your area by providing funds from the decentralized budget, he added. This is the first time that the representatives of Yowun Puraya are meeting in the North and East. And also it is the first time that we meet in the Opposition Leaders electorate. He invited us, supported us and this depicts the reconciliation in the country.  Prime Minister Wickremesinghe further said that he and President Maithripala Sirisena during their youth only saw the conflict. But, we want to establish peace, reconciliation, and development in this country during your youth.", 
  "title": "PM assures to increase provisions for youth projects", 
  "url": "https://www.dgi.gov.lk/news/latest-news/944-pm-assures-to-increase-provisions-for-youth-projects"
}