{
  "date": "April 06, 2017", 
  "text": "Ignoring of repeated warnings of EU in this regard and several other factors eventually led Sri Lanka to undergo a ban on fish exports. However, the incumbent government expressed conformity to 52 strategies proposed by EU among which facilitation for keeping proper records about the fishing activities on international waters bears much significance.Thus, the government has taken measures to provide E-Log Books (computer tablets) to 1,490 fishers at a cost of Rs. 149 million. These Tablets have been manufactured as rugged devices and are different from the common usage. Thus they can be operated even underwater to record the details of fishing at sea.Minister of Fisheries and Aquatic Resources Development Mahinda Amaraweera has instructed the Ministry to insert these Tablets with Vessel Monitoring facilities with a view to prevent illegal fishing on international waters.These Tablet devices have been ordered and are planned to be distributed among fishers within the coming three months, mentioned the Minister.Unavailability of a proper method to record fishing details on international waters by Sri Lankan fishermen was one of the contributing factors to impose a fish ban against Sri Lanka by the European Union. Ignoring of repeated warnings of EU in this regard and several other factors eventually led Sri Lanka to undergo a ban on fish exports. However, the incumbent government expressed conformity to 52 strategies proposed by EU among which facilitation for keeping proper records about the fishing activities on international waters bears much significance.Thus, the government has taken measures to provide E-Log Books (computer tablets) to 1,490 fishers at a cost of Rs. 149 million. These Tablets have been manufactured as rugged devices and are different from the common usage. Thus they can be operated even underwater to record the details of fishing at sea.Minister of Fisheries and Aquatic Resources Development Mahinda Amaraweera has instructed the Ministry to insert these Tablets with Vessel Monitoring facilities with a view to prevent illegal fishing on international waters.These Tablet devices have been ordered and are planned to be distributed among fishers within the coming three months, mentioned the Minister.", 
  "title": "Fisher community to get E-Log books", 
  "url": "https://www.dgi.gov.lk/news/latest-news/963-fisher-community-to-get-e-log-books"
}