{
  "date": "April 17, 2017", 
  "text": "More than one thousand security forces personnel and heavy machinery of the security forces are involved in the clearing operations.Relief operations are carried out under the supervision of Security Forces Commander (West) Major General Sudantha Ranasinghe. He has requested the local people to provide more information about the houses in the locality in order to assist the relief operations to be more effective.From Friday evening up to now 10 excavator machines of the Army Engineers and a large number of dump trucks are involved in the relief operations.According to Major General Ranasinghe about 180 meter long and 75 meter wide section of the Meethotamulla garbage dump had collapsed on to an area where according to Government records, 145 houses were located. The disaster has completely destroyed more than 40 houses while the rest of the houses have been partly damaged. The area is being sectioned in to three zones and relief operations are carried out. Troops were able to rescue people and recover 19 bodies, he further said.Rescue personnel are faced with the problem of finding the exact number of houses in the affected area. Some parts of the site are buried in 30 to 40 feet of garbage. People are requested to provide information of houses where their relatives and friends have lived in order to expedite the relief operations.In the event of any further collapse of the garbage dump, people living in vulnerable parts along the garbage dump may temporarily be evacuated in order to prevent another disaster while troops will continue with the relief operations.Troops are still involved in the relief operations in Meethotamulla garbage dump, which collapsed on Friday (14th April) causing damage to a large number of lives and property. More than one thousand security forces personnel and heavy machinery of the security forces are involved in the clearing operations.Relief operations are carried out under the supervision of Security Forces Commander (West) Major General Sudantha Ranasinghe. He has requested the local people to provide more information about the houses in the locality in order to assist the relief operations to be more effective.From Friday evening up to now 10 excavator machines of the Army Engineers and a large number of dump trucks are involved in the relief operations.According to Major General Ranasinghe about 180 meter long and 75 meter wide section of the Meethotamulla garbage dump had collapsed on to an area where according to Government records, 145 houses were located. The disaster has completely destroyed more than 40 houses while the rest of the houses have been partly damaged. The area is being sectioned in to three zones and relief operations are carried out. Troops were able to rescue people and recover 19 bodies, he further said.Rescue personnel are faced with the problem of finding the exact number of houses in the affected area. Some parts of the site are buried in 30 to 40 feet of garbage. People are requested to provide information of houses where their relatives and friends have lived in order to expedite the relief operations.In the event of any further collapse of the garbage dump, people living in vulnerable parts along the garbage dump may temporarily be evacuated in order to prevent another disaster while troops will continue with the relief operations.", 
  "title": "Relief operations still underway at Meethotamulla", 
  "url": "https://www.dgi.gov.lk/news/latest-news/997-relief-operations-still-underway-at-meethotamulla"
}